Revit 2017 API
DimensionType Methods
The DimensionType type exposes the following members.
Methods
Name | Description
GetAlternateUnitsFormatOptions
 Gets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
SetAlternateUnitsFormatOptions
 Sets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
See Also
DimensionType Class
Autodesk.Revit.DB Namespace