Revit 2017 API
ViewPrintingEventArgs Properties
The ViewPrintingEventArgs type exposes the following members.
Properties
Name | Description
Index
 The index of the view being printed out of the set of all views being printed.
Settings |  Obsolete.
 The print settings of the active printing session.
TotalViews
 The number of all views being printed.
View
 The view to be printed.
See Also
ViewPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace