Revit 2017 API
PipeSettings Properties
The PipeSettings type exposes the following members.
Properties
Name | Description
Centerline
 The abbreviation of the Centerline (=) string.
ConnectorSeparator
 The connector separator string.
ConnectorTolerance
 The connector tolerance value.
FittingAngleUsage
 Determine how to use fitting angle during pipe layout or modifying layout.
FittingAnnotationSize
 The value of fitting annotation size.
FlatOnBottom
 The abbreviation of the Flat On Bottom (FOB) string.
FlatOnTop
 The abbreviation of the Flat On Top (FOT) string.
SetDown
 The abbreviation of the Set Down (SD) string.
SetUp
 The abbreviation of the Set Up (SU) string.
SizePrefix
 The size prefix string.
SizeSuffix
 The size suffix string.
UseAnnotationScaleForSingleLineFittings
 Indicates whether use annotation scale for single line fittings or not.
See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace