Revit 2017 API
NumberSystem Methods
The NumberSystem type exposes the following members.
Methods
Name | Description
GetReferencePick
 Gets the reference curve.
SetReferencePick
 Sets the reference pick.
See Also
NumberSystem Class
Autodesk.Revit.DB Namespace