Revit 2017 API
ImportInstance Methods
The ImportInstance type exposes the following members.
Methods
Name | Description
GetVisibility
Gets the visibility for the import instance in a family document.
SetVisibility
Sets the visibility for the import instance in a family document.
See Also
ImportInstance Class
Autodesk.Revit.DB Namespace