Revit 2017 API
DimensionType Members
The DimensionType type exposes the following members.
Methods
Name | Description
GetAlternateUnitsFormatOptions
 Gets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
SetAlternateUnitsFormatOptions
 Sets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
Properties
Name | Description
AlternateUnits
 The alternate units display mode for this DimensionType.
AlternateUnitsPrefix
 The prefix text for the alternate units value.
AlternateUnitsSuffix
 The suffix text for the alternate units value.
StyleType
 The dimension style type of this DimensionType.
UnitType
 The unit type of this dimension style.
See Also
DimensionType Class
Autodesk.Revit.DB Namespace