Revit 2017 API
Level Members
The Level type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of level based on an input elevation.
GetPlaneReference
 Returns a reference to this element as a plane.
Properties
Name | Description
Elevation
 Retrieves or changes the elevation above or below the ground level.
ProjectElevation
 Retrieves the elevation relative to project origin, no matter what values of the Elevation Base parameter is set.
See Also
Level Class
Autodesk.Revit.DB Namespace