Revit 2017 API
DocumentPrintingEventArgs Properties
The DocumentPrintingEventArgs type exposes the following members.
Properties
Name | Description
Settings |  Obsolete.
 The print settings of the active printing session.
See Also
DocumentPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace