Revit 2017 API
IndependentTag Members
The IndependentTag type exposes the following members.
Methods
Name | Description
CanLeaderEndConditionBeAssigned
 Checks whether the LeaderEndCondition can be assigned.
GetTaggedLocalElement
 Get the tagged local element if any.
Properties
Name | Description
HasLeader
 Whether the tag has a leader or not.
IsMaterialTag
 Identifies if it is a material tag or not.
IsMulticategoryTag
 Identifies if it is a multi-category tag or not.
IsOrphaned
 Identifies if the tag is orphaned or not.
LeaderElbow
Returns the position of the elbow of leader.
LeaderEnd
Returns the position of the end of leader.
LeaderEndCondition
 The leader end condition of the tag.
MultiReferenceAnnotationId
 The multi-reference annotation which owns this tag.
TaggedElementId
 The LinkElementId of the tagged element.
TaggedLocalElementId
 The id of the tagged local element if any.
TagHeadPosition
Returns the position of the head of tag.
TagOrientation
 The tag orientation of the tag.
TagText
 The text associated with the tag. If there are several strings assiciated with the tag, the strings will be returned concatenated.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace