Revit 2017 API
ProjectLocation Members
The ProjectLocation type exposes the following members.
Methods
Name | Description
Duplicate
Generate a copy of this project location with the specified name.
Properties
Name | Description
Name
The name of the project location.
 (Overrides Element.Name.)
ProjectPosition
Gets or sets the coordinates of a point in the project location coordinate system.
SiteLocation
The site location to which this project location refers.
See Also
ProjectLocation Class
Autodesk.Revit.DB Namespace