Revit 2017 API
ShapeImporter Members
The ShapeImporter type exposes the following members.
Constructors
Name | Description
ShapeImporter
 Default constructor. Initializes an instance of ShapeImporter that will automaticall?y recognize the file format from its extension (ShapeImporterSourceFormat.Auto).
Methods
Name | Description
Convert
 Converts the geometry stored in the external format into a collection of Revit geometry objects.
Dispose
Releases all resources used by the ShapeImporter
IsServiceAvailable
 Checks whether the data conversion service is available.
Properties
Name | Description
InputFormat
 The format of the incoming data.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace