Revit 2017 API
PropertySetLibrary Properties
The PropertySetLibrary type exposes the following members.
Properties
Name | Description
Locked
 Indicates whether a property set library is locked into a document or not. Locked libraries are read-only and cannot be removed.
ReadOnly
 Indicates whether a property set library is read-only or not. Read-only libraries cannot be renamed, or added to.
See Also
PropertySetLibrary Class
Autodesk.Revit.DB Namespace