Revit 2017 API
FamilyPointLocation Properties
The FamilyPointLocation type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Location
 The location of the point.
Name
 The name of the corresponding reference point in the Family document.
See Also
FamilyPointLocation Class
Autodesk.Revit.DB Namespace