Revit 2017 API
RuledSurface Methods
The RuledSurface type exposes the following members.
Methods
Name | Description
Create(Curve, Curve)
 Creates a Surface object coincident with the ruled surface joining two bounded generating curves.
Create(Curve, XYZ)
 Creates a Surface object coincident with the ruled surface joining a bounded generating curve to a point.
GetFirstProfileCurve
 Returns a copy of the first profile curve if it is set. If a point was used to define the first profile, this function will return NULL.
GetFirstProfilePoint
 If a point was used to define the first profile, returns a copy of that point. Otherwise return NULL.
GetSecondProfileCurve
 Returns a copy of the second profile curve if it is set. If a point was used to define the second profile, this function will return NULL.
GetSecondProfilePoint
 If a point was used to define the second profile, returns a copy of that point. Otherwise return NULL.
See Also
RuledSurface Class
Autodesk.Revit.DB Namespace