Revit 2017 API
StructuralSectionCProfileWithFold Properties
The StructuralSectionCProfileWithFold type exposes the following members.
Properties
Name | Description
FoldLength
 Fold segment length.
LipLength
 Lip segment length.
See Also
StructuralSectionCProfileWithFold Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace