Revit 2017 API
FormattedTextRun Members
The FormattedTextRun type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FormattedTextRun
Properties
Name | Description
BaselineStyle
 Specifies the style of the text as related to the baseline position.
Bold
 Indicates whether this text run uses Bold text.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Italic
 Indicates whether this text run uses Italic text.
ListStyle
 Specifies the style of a paragraph if the paragraph is a list.
NewLine
 Indicates whether this text run starts on a new line.
NewParagraph
 Indicates whether this text run starts a new paragraph.
TabNumber
 For a text run that starts at a tab stop, this value indicates the number of the tab stop.
Text
 The text segment in this text run.
Underlined
 Indicates whether this text run uses Underlined text.
See Also
FormattedTextRun Class
Autodesk.Revit.DB Namespace