Revit 2017 API
FabricationRodInfo Members
The FabricationRodInfo type exposes the following members.
Methods
Name | Description
AttachToHanger
 Attaches the hanger rod to another bearer hanger.
AttachToStructure
 Attaches to the nearest structural element.
Dispose
Releases all resources used by the FabricationRodInfo
GetBearerExtension
 Gets the bearer extension. The method is applicable only for bearer hanger.
GetRodAttachedElementId
 Gets the id of the attached component for the specified rod.
GetRodEndPosition
 Gets the position of the rod end.
IsRodLockedWithHost
 Checks if the rod is locked with the host. The method is applicable only for bearer hanger.
SetBearerExtension
 Sets the bearer extension. The method is applicable only for bearer hanger.
SetRodEndPosition
 Sets the position of the rod end. The method is applicable only for bearer hanger.
SetRodLockedWithHost
 Locks the rod with the host. The method is applicable only for bearer hanger.
Properties
Name | Description
IsAttachedToStructure
 Checks if the hanger is attached to structure.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
RodCount
 Gets the number of rods.
See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace