Revit 2017 API
StructuralSectionZProfile Properties
The StructuralSectionZProfile type exposes the following members.
Properties
Name | Description
BottomFlangeLength
 Bottom Flange segment length.
See Also
StructuralSectionZProfile Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace