Revit 2017 API
ExternalResourceServerExtensions Methods
The ExternalResourceServerExtensions type exposes the following members.
Methods
Name | Description
Dispose
GetRevitLinkOperations
 Gets the specific methods supported by the external resource of Revit Links.
See Also
ExternalResourceServerExtensions Class
Autodesk.Revit.DB Namespace