Revit 2017 API
StructuralSectionLProfileWithLips Properties
The StructuralSectionLProfileWithLips type exposes the following members.
Properties
Name | Description
LipLength
 Lip segment length.
See Also
StructuralSectionLProfileWithLips Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace