Revit 2015 API
FasciaTypeSetIterator Methods
The FasciaTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
FasciaTypeSetIterator Class
Autodesk.Revit.DB.Architecture Namespace