Revit 2015 API
FailureHandlingOptions Methods
The FailureHandlingOptions type exposes the following members.
Methods
Name | Description
Dispose
GetClearAfterRollback
 Checks if all posted failures should be removed silently when transaction is being rolled back.
GetDelayedMiniWarnings
 Checks if showing of mini-warning dialog should be delayed till the end of next transaction.
GetFailuresPreprocessor
 Getting a callback to be invoked in the beginning of failure processing.
GetForcedModalHandling
 Checks if error handling dialog at the end of transaction should be modal.
GetTransactionFinalizer
 Getting a callback to be executed after transaction is completed.
SetClearAfterRollback
 Set the flag to clear all posted failures silently if transaction is being rolled back intentionally and delivering failures to the user is not desired.
SetDelayedMiniWarnings
 Set the flag to delay showing of mini-warning dialog (if one is to be shown as a result of warnings in the current transaction) till the end of next transaction.
SetFailuresPreprocessor
 Setting a callback to be invoked in the beginning of failure processing.
SetForcedModalHandling
 Set the flag whether it pops modal error dialog if the transaction failed to finish.
SetTransactionFinalizer
 Setting a callback to be executed after transaction is completed.
See Also
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace