Revit 2015 API
ViewSheetSets Properties
The ViewSheetSets type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of objects that are in the set.
See Also
ViewSheetSets Class
Autodesk.Revit.DB Namespace