Revit 2015 API
View3D Members
The View3D type exposes the following members.
Methods
Name | Description
CanSaveOrientation
 Returns true if the View3D's orientation can be saved, false otherwise.
CreateIsometric
 Returns a new isometric View3D.
CreatePerspective
 Returns a new perspective View3D.
GetOrientation
 Gets the current non-saved orientation of the View3D.
GetRenderingSettings
 Returns the current rendering settings for this 3d view.
GetSavedOrientation
 Gets the saved orientation of the View3D.
GetSectionBox
 Get a copy of the section box.
HasBeenLocked
 Identifies if the view has ever been locked.
OrientTo
 Reorients the view to align with the forward direction.
RestoreOrientationAndLock
 Locks the view and restores its orientation.
SaveOrientation
 Converts the temporary orientation of the View3D into its saved orientation.
SaveOrientationAndLock
 Locks the view and saves its orientation
SetOrientation
 Sets the temporary orientation of the View3D. The new orientation is not saved in the document.
SetRenderingSettings
 Changes the rendering settings for this 3d view.
SetSectionBox
 Sets the section box.
Unlock
 Unlocks the view. Has no effect if the view is already unlocked.
Properties
Name | Description
IsLocked
 Indicates if the view is locked.
IsPerspective
 Identifies whether this is a perspective view.
IsSectionBoxActive
 Identifies whether or not the section box is active.
See Also
View3D Class
Autodesk.Revit.DB Namespace