Revit 2015 API
SolidArrayIterator Properties
The SolidArrayIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
SolidArrayIterator Class
Autodesk.Revit.DB Namespace