Revit 2015 API
ExternalDefinitonCreationOptions Methods
The ExternalDefinitonCreationOptions type exposes the following members.
Methods
Name | Description
Dispose
See Also
ExternalDefinitonCreationOptions Class
Autodesk.Revit.DB Namespace