Revit 2015 API
GeometryObjectArrayIterator Properties
The GeometryObjectArrayIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
GeometryObjectArrayIterator Class
Autodesk.Revit.DB Namespace