Revit 2015 API
FabricSheet Members
The FabricSheet type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of a single Fabric Sheet element within the project.
GetReinforcementRoundingManager
 Returns an object for managing reinforcement rounding override settings.
GetSheetLocation
 Gets the position and the orientation of the Fabric Sheet instance.
GetWireCenterlines()
 Gets a list of curves representing the wires centerlines of the Fabric Sheet in the both distribution directions.
GetWireCenterlines(WireDistributionDirection)
 Gets a list of curves representing the wires centerlines of the Fabric Sheet.
IsCoverOffsetValid
 Identifies if the specified value is valid for use as a cover offset.
IsSingleFabricSheetWithinHost
 Identifies if the specified single Fabric Sheet position is within the host.
PlaceInHost
 Inserts the single Fabric Sheet instance into the host element.
Properties
Name | Description
CoverOffset
 The additional cover offset of the Fabric Sheet.
CutOverallLength
 The sheet length after cutting has taken place.
CutOverallWidth
 The sheet width after cutting has taken place.
CutSheetMass
 The sheet mass after cutting has taken place.
FabricAreaOwnerId
 The Fabric Area Id.
FabricHostReference
 Controls if Single Fabric Sheet should be cut by the Host Cover
FabricLocation
 The Fabric Sheet location in the host.
HostId
 The structure element that contains the Fabric Sheet.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace