Revit 2015 API
FamilySymbolSetIterator Properties
The FamilySymbolSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
FamilySymbolSetIterator Class
Autodesk.Revit.DB Namespace