Revit 2015 API
BeamSystemTypeSet Methods
The BeamSystemTypeSet type exposes the following members.
Methods
Name | Description
Clear
Removes every BeamSystem type from the set, rendering it empty.
Contains
Erase
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
BeamSystemTypeSet Class
Autodesk.Revit.DB Namespace