Revit 2015 API
Material Properties
The Material type exposes the following members.
Properties
Name | Description
AppearanceAssetId
 The ElementId of the AppearanceAssetElement.
Color
 The color of the material.
CutPatternColor
 The color of the material cut pattern.
CutPatternId
 Gets and sets the cut fill pattern element.
Glow
 Whether the material can glow.
MaterialCagtegory |  Obsolete.
 The name of the material category, e.g. 'Wood'
MaterialCategory
 The name of the material category, e.g. 'Wood'
MaterialClass
 The name of the general material type, e.g. 'Wood.'
Shininess
 The shininess of the material.
Smoothness
 The smoothness of the material.
StructuralAssetId
 The ElementId of the structural PropertySetElement.
SurfacePatternColor
 The color of the material surface pattern.
SurfacePatternId
 Gets and sets the surface fill pattern element.
ThermalAssetId
 The ElementId of the thermal PropertySetElement.
Transparency
 The transparency of the material.
UseRenderAppearanceForShading
 True to use the render appearance settings for shaded view appearance, false to use the material's color and transparency value for shaded view appearance.
See Also
Material Class
Autodesk.Revit.DB Namespace