Revit 2015 API
MeshArrayIterator Properties
The MeshArrayIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
MeshArrayIterator Class
Autodesk.Revit.DB Namespace