Revit 2015 API
TextElement Properties
The TextElement type exposes the following members.
Properties
Name | Description
Align
The align.
BaseDirection
The base direction.
Height
The height.
LineWidth
The line width.
Symbol
Get the type of the TextElement object.
Text
Get and set the content of the TextElement object.
UpDirection
The direction towards the top of the screen.
See Also
TextElement Class
Autodesk.Revit.DB Namespace