Revit 2015 API
Connector Methods
The Connector type exposes the following members.
Methods
Name | Description
ConnectTo
Make connection between two connectors.
DisconnectFrom
Remove connection between two connectors.
Dispose
IsConnectedTo
Identifies if the connector is connected to the specified connector.
See Also
Connector Class
Autodesk.Revit.DB Namespace