Revit 2015 API
AreaLoad Properties
The AreaLoad type exposes the following members.
Properties
Name | Description
Curve
Returns the geometric curve within a geometric loop that defines the area.
Force
Returns the three dimensional force applied to one of the points for the area load.
Force1
Returns the three dimensional force applied to the point 1 of the area load.
Force2
Returns the three dimensional force applied to the point 2 of the area load.
Force3
Returns the three dimensional force applied to the point 3 of the area load.
NumCurves
Returns the number of curves within a geometric loop that defines the area.
NumLoops
Returns the number of geometric curve loops that define the area.
NumRefPoints
Returns the total number of reference points for the area load.
RefPoint
Retrieve the physical location of the reference point.
See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace