Revit 2015 API
RebarHookTypeSet Methods
The RebarHookTypeSet type exposes the following members.
Methods
Name | Description
Clear
Removes every RebarHook type from the set, rendering it empty.
Contains
Tests for the existence of a RebarHook type within the set.
Erase
Removes a specified RebarHook type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified RebarHook type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
RebarHookTypeSet Class
Autodesk.Revit.DB.Structure Namespace