Revit 2015 API
StructuralSectionISplitSlopedFlange Members
The StructuralSectionISplitSlopedFlange type exposes the following members.
Methods
Name | Description
Properties
Name | Description
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
See Also
StructuralSectionISplitSlopedFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace