Revit 2015 API
RebarCoverTypeSetIterator Properties
The RebarCoverTypeSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
RebarCoverTypeSetIterator Class
Autodesk.Revit.DB.Structure Namespace