Revit 2015 API
RoomTagTypeSet Methods
The RoomTagTypeSet type exposes the following members.
Methods
Name | Description
Clear
Removes every room tag type from the set, rendering it empty.
Contains
Tests for the existence of a room tag type within the set.
Erase
Removes a specified room tag type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified room tag type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
RoomTagTypeSet Class
Autodesk.Revit.DB.Architecture Namespace