Revit 2015 API
PointLoadTypeSetIterator Methods
The PointLoadTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
PointLoadTypeSetIterator Class
Autodesk.Revit.DB.Structure Namespace