Revit 2015 API
RoomTagTypeSetIterator Properties
The RoomTagTypeSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
RoomTagTypeSetIterator Class
Autodesk.Revit.DB.Architecture Namespace