Revit 2015 API
FabricWireType Properties
The FabricWireType type exposes the following members.
Properties
Name | Description
WireDiameter
 Determines the diameter of the wire.
See Also
FabricWireType Class
Autodesk.Revit.DB.Structure Namespace