Revit 2015 API
AnalyticalModelStick Methods
The AnalyticalModelStick type exposes the following members.
Methods
Name | Description
GetAlignmentMethod(AnalyticalElementSelector)
 Gets the alignment method for a given selector.
GetProjectionPlaneY
 Retrieves analytical model projection information for Y direction.
GetProjectionPlaneZ
 Retrieves analytical model projection information for Z direction.
GetProjectionY
 Retrieves analytical model projection information for Y direction.
GetProjectionZ
 Retrieves analytical model projection information for Z direction.
SetAlignmentMethod(AnalyticalElementSelector, AnalyticalAlignmentMethod)
 Sets the alignment method for a given selector.
SetProjection(AnalyticalElementSelector, ElementId, ElementId)
 Sets the analytical model projection to a preset value.
SetProjection(AnalyticalElementSelector, ElementId, StickElementProjectionZ)
 Sets the analytical model projection to a preset value.
SetProjection(AnalyticalElementSelector, StickElementProjectionY, ElementId)
 Sets the analytical model projection to a preset value.
SetProjection(AnalyticalElementSelector, StickElementProjectionY, StickElementProjectionZ)
 Sets the analytical model projection to a preset value.
See Also
AnalyticalModelStick Class
Autodesk.Revit.DB.Structure Namespace