Revit 2015 API
AnnotationSymbol Properties
The AnnotationSymbol type exposes the following members.
Properties
Name | Description
AnnotationSymbolType
 The AnnotationSymbol style of this AnnotationSymbol.
Leaders
Get all the leaders of this annotation symbol.
See Also
AnnotationSymbol Class
Autodesk.Revit.DB Namespace