Revit 2015 API
GenericFormSet Methods
The GenericFormSet type exposes the following members.
Methods
Name | Description
Clear
Removes every item from the set, rendering it empty.
Contains
Erase
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
GenericFormSet Class
Autodesk.Revit.DB Namespace