Revit 2015 API
BeamSystemTypeSetIterator Methods
The BeamSystemTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
BeamSystemTypeSetIterator Class
Autodesk.Revit.DB Namespace