Revit 2015 API
DimensionSegment Properties
The DimensionSegment type exposes the following members.
Properties
Name | Description
Above
The text shown above the segment's value.
Below
The text shown below the segment's value.
IsLocked
 Indicates if this segment is locked.
Origin
 The segment origin.
Prefix
The text shown before the segment's value.
Suffix
The text shown after the segment's value.
Value
 The length of the segment.
ValueOverride
The text that replaces the segment's value.
ValueString
 The displayed value shown for the dimension segment.
See Also
DimensionSegment Class
Autodesk.Revit.DB Namespace