Revit 2015 API
FamilySymbolSetIterator Members
The FamilySymbolSetIterator type exposes the following members.
Constructors
Name | Description
FamilySymbolSetIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
FamilySymbolSetIterator Class
Autodesk.Revit.DB Namespace