Revit 2015 API
WorksetTable Methods
The WorksetTable type exposes the following members.
Methods
Name | Description
Dispose
GetActiveWorksetId
 Returns the active workset's WorksetId.
GetWorkset(Guid)
 Returns the workset from a input Guid.
GetWorkset(WorksetId)
 Returns the workset from a input WorksetId.
See Also
WorksetTable Class
Autodesk.Revit.DB Namespace