Revit 2015 API
BoundarySegmentArrayArray Methods
The BoundarySegmentArrayArray type exposes the following members.
Methods
Name | Description
Append
Add the boundary segment array to the end of the array.
Clear
Removes every boundary segment array from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
ReverseIterator
Retrieve a backward moving iterator to the array.
See Also
BoundarySegmentArrayArray Class
Autodesk.Revit.DB.Mechanical Namespace