Revit 2015 API
StructuralSectionStructuralTees Members
The StructuralSectionStructuralTees type exposes the following members.
Methods
Name | Description
Properties
Name | Description
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
See Also
StructuralSectionStructuralTees Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace