Revit 2015 API
ContFootingTypeSet Properties
The ContFootingTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of ContFooting types that are in the set.
See Also
ContFootingTypeSet Class
Autodesk.Revit.DB Namespace