Revit 2015 API
BeamSystemTypeSet Members
The BeamSystemTypeSet type exposes the following members.
Constructors
Name | Description
BeamSystemTypeSet
Initializes a new instance of the BeamSystemTypeSet class
Methods
Name | Description
Clear
Removes every BeamSystem type from the set, rendering it empty.
Contains
Erase
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of BeamSystem types that are in the set.
See Also
BeamSystemTypeSet Class
Autodesk.Revit.DB Namespace