Revit 2015 API
InstanceArrayIterator Members
The InstanceArrayIterator type exposes the following members.
Constructors
Name | Description
InstanceArrayIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
InstanceArrayIterator Class
Autodesk.Revit.DB Namespace