Revit 2015 API
LevelTypeSetIterator Properties
The LevelTypeSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
LevelTypeSetIterator Class
Autodesk.Revit.DB Namespace