Revit 2015 API
MaterialSet Properties
The MaterialSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of materials that are in the set.
See Also
MaterialSet Class
Autodesk.Revit.DB Namespace