Revit 2015 API
ViewPlan Members
The ViewPlan type exposes the following members.
Methods
Name | Description
CheckPlanViewRangeValidity
 Checks if the plan view range is valid.
Create
 Creates a new ViewPlan.
CreateAreaPlan
 Creates a new area plan ViewPlan.
GetViewRange
 Gets the view range.
SetViewRange
 Sets the view range.
Properties
Name | Description
AreaScheme
The area scheme.
See Also
ViewPlan Class
Autodesk.Revit.DB Namespace