Revit 2015 API
AreaLoadTypeSetIterator Methods
The AreaLoadTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
AreaLoadTypeSetIterator Class
Autodesk.Revit.DB.Structure Namespace