Revit 2015 API
AnnotationSymbolTypeSetIterator Properties
The AnnotationSymbolTypeSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
AnnotationSymbolTypeSetIterator Class
Autodesk.Revit.DB Namespace