Revit 2015 API
TrussTypeSet Members
The TrussTypeSet type exposes the following members.
Constructors
Name | Description
TrussTypeSet
Initializes a new instance of the TrussTypeSet class
Methods
Name | Description
Clear
Removes every Truss type from the set, rendering it empty.
Contains
Tests for the existence of a Truss type within the set.
Erase
Removes a specified Truss type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified Truss type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of Truss types that are in the set.
See Also
TrussTypeSet Class
Autodesk.Revit.DB.Structure Namespace