Revit 2015 API
Units Methods
The Units type exposes the following members.
Methods
Name | Description
Dispose
GetDisplayUnitType |  Obsolete.
 Gets the display unit for the UT_Length unit type.
GetFormatOptions
 Gets the default FormatOptions for a unit type.
GetModifiableUnitTypes
 Gets all unit types for which the default FormatOptions can be modified.
IsModifiableUnitType
 Checks whether the default FormatOptions can be modified for a given unit type.
IsValidDecimalSymbolAndGrouping |  Obsolete.
 Checks if a combination of decimal symbol and digit grouping settings is allowed.
SetDecimalSymbolAndGrouping |  Obsolete.
 Sets the decimal symbol and digit grouping.
SetFormatOptions
 Sets the default FormatOptions for a unit type.
See Also
Units Class
Autodesk.Revit.DB Namespace