Revit 2015 API
InstanceArray Members
The InstanceArray type exposes the following members.
Constructors
Name | Description
InstanceArray
Initializes a new instance of the InstanceArray class
Methods
Name | Description
Append
Clear
Removes every instance from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets an instance at a specified index within the array.
Size
Returns the number of instances that are in the array.
See Also
InstanceArray Class
Autodesk.Revit.DB Namespace