Revit 2015 API
BoundarySegmentArrayIterator Methods
The BoundarySegmentArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
See Also
BoundarySegmentArrayIterator Class
Autodesk.Revit.DB.Architecture Namespace