Revit 2015 API
FasciaTypeSetIterator Properties
The FasciaTypeSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
FasciaTypeSetIterator Class
Autodesk.Revit.DB.Architecture Namespace