Revit 2015 API
SpaceTagTypeSetIterator Methods
The SpaceTagTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
SpaceTagTypeSetIterator Class
Autodesk.Revit.DB.Mechanical Namespace