Revit 2015 API
DirectShapeType Members
The DirectShapeType type exposes the following members.
Methods
Name | Description
Create
 Creates a DirectShapeType element.
SetShape
 Sets the type shape to a copy of the supplied collection of Geometry objects.
Properties
Name | Description
See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace