Revit 2015 API
BoundarySegmentArrayIterator Properties
The BoundarySegmentArrayIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
BoundarySegmentArrayIterator Class
Autodesk.Revit.DB.Mechanical Namespace