Revit 2015 API
InstanceArray Methods
The InstanceArray type exposes the following members.
Methods
Name | Description
Append
Clear
Removes every instance from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
ReverseIterator
Retrieve a backward moving iterator to the array.
See Also
InstanceArray Class
Autodesk.Revit.DB Namespace