Revit 2015 API
AnnotationSymbolTypeSet Members
The AnnotationSymbolTypeSet type exposes the following members.
Constructors
Name | Description
AnnotationSymbolTypeSet
Initializes a new instance of the AnnotationSymbolTypeSet class
Methods
Name | Description
Clear
Removes every AnnotationSymbol type from the set, rendering it empty.
Contains
Tests for the existence of a AnnotationSymbol type within the set.
Erase
Removes a specified AnnotationSymbol type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified AnnotationSymbol type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of AnnotationSymbol types that are in the set.
See Also
AnnotationSymbolTypeSet Class
Autodesk.Revit.DB Namespace