Revit 2015 API
SpaceTagTypeSet Properties
The SpaceTagTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of space tag types that are in the set.
See Also
SpaceTagTypeSet Class
Autodesk.Revit.DB.Mechanical Namespace