Revit 2015 API
StructuralSectionLAngle Members
The StructuralSectionLAngle type exposes the following members.
Methods
Name | Description
Properties
Name | Description
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
See Also
StructuralSectionLAngle Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace