Revit 2015 API
TextNote Methods
The TextNote type exposes the following members.
Methods
Name | Description
AddLeader
Add a leader for the current TextNote object and return the new leader.
RemoveLeaders
Remove all the leaders for the current TextNote object.
See Also
TextNote Class
Autodesk.Revit.DB Namespace