Revit 2015 API
AnnotationSymbolTypeSetIterator Methods
The AnnotationSymbolTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
AnnotationSymbolTypeSetIterator Class
Autodesk.Revit.DB Namespace