Revit 2015 API
RoomTagTypeSet Properties
The RoomTagTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of room tag types that are in the set.
See Also
RoomTagTypeSet Class
Autodesk.Revit.DB.Architecture Namespace