Revit 2015 API
InstanceArray Properties
The InstanceArray type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets an instance at a specified index within the array.
Size
Returns the number of instances that are in the array.
See Also
InstanceArray Class
Autodesk.Revit.DB Namespace