Revit 2015 API
RebarCoverTypeSet Properties
The RebarCoverTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of RebarCover types that are in the set.
See Also
RebarCoverTypeSet Class
Autodesk.Revit.DB.Structure Namespace