Revit 2015 API
PlanarFace Properties
The PlanarFace type exposes the following members.
Properties
Name | Description
Normal
Normal of the surface.
Origin
Origin of the surface.
Vector
Defining vectors of the surface.
See Also
PlanarFace Class
Autodesk.Revit.DB Namespace