Revit 2015 API
BoundarySegmentArray Members
The BoundarySegmentArray type exposes the following members.
Constructors
Name | Description
BoundarySegmentArray
Initializes a new instance of the BoundarySegmentArray class
Methods
Name | Description
Append
Add the boundary segment to the end of the array.
Clear
Removes every boundary segment from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified boundary segment into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a boundary segment at a specified index within the array.
Size
Returns the number of boundary segments that are in the array.
See Also
BoundarySegmentArray Class
Autodesk.Revit.DB.Architecture Namespace