Revit 2015 API
ComponentRepeater Members
The ComponentRepeater type exposes the following members.
Methods
Name | Description
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Returns an enumerator that iterates through the curve loop.
IsTypeValidForRepeater
 Determines whether given family type can be used as the default type for the repeater.
RepeatElements
 Repeats a set of adaptive component hosted on one or more repeating references.
Properties
Name | Description
DefaultFamilyType
 The default family type for the component repeater.
DimensionCount
 The dimension count of the component repeater.
See Also
ComponentRepeater Class
Autodesk.Revit.DB Namespace