Revit 2015 API
PathReinforcement Properties
The PathReinforcement type exposes the following members.
Properties
Name | Description
AdditionalOffset
 Additional offset
PathReinforcementType
 Retrieves the type of the Path Reinforcement.
See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace