Revit 2015 API
PointLoadTypeSet Methods
The PointLoadTypeSet type exposes the following members.
Methods
Name | Description
Clear
Removes every pointload type from the set, rendering it empty.
Contains
Erase
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
PointLoadTypeSet Class
Autodesk.Revit.DB.Structure Namespace