Revit 2015 API
LoadTypeBaseSetIterator Properties
The LoadTypeBaseSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
LoadTypeBaseSetIterator Class
Autodesk.Revit.DB.Structure Namespace