Revit 2015 API
PointLoadTypeSetIterator Members
The PointLoadTypeSetIterator type exposes the following members.
Constructors
Name | Description
PointLoadTypeSetIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
PointLoadTypeSetIterator Class
Autodesk.Revit.DB.Structure Namespace