Revit 2015 API
GutterTypeSetIterator Methods
The GutterTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
GutterTypeSetIterator Class
Autodesk.Revit.DB.Architecture Namespace