Revit 2015 API
LoadCaseSetIterator Methods
The LoadCaseSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
LoadCaseSetIterator Class
Autodesk.Revit.DB.Structure Namespace