Revit 2015 API
EnergyAnalysisSurface Methods
The EnergyAnalysisSurface type exposes the following members.
Methods
Name | Description
Dispose
GetAdjacentAnalyticalSpace
 Gets the secondary adjacent analytical space this surface is associated with.
GetAnalyticalOpenings
 Returns the analytical openings of the analytical surface.
GetAnalyticalSpace
 Gets the primary analytical space this surface is associated with.
GetPolyloop
 Gets the planar polygon describing the opening geometry.
See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace