Revit 2015 API
GutterTypeSet Members
The GutterTypeSet type exposes the following members.
Constructors
Name | Description
GutterTypeSet
Initializes a new instance of the GutterTypeSet class
Methods
Name | Description
Clear
Removes every gutter type from the set, rendering it empty.
Contains
Tests for the existence of a gutter type within the set.
Erase
Removes a specified gutter type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified gutter type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of gutter types that are in the set.
See Also
GutterTypeSet Class
Autodesk.Revit.DB.Architecture Namespace