Revit 2015 API
StructuralSectionCSlopedFlange Members
The StructuralSectionCSlopedFlange type exposes the following members.
Methods
Name | Description
Properties
Name | Description
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
See Also
StructuralSectionCSlopedFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace