Revit 2015 API
AreaTagTypeSetIterator Members
The AreaTagTypeSetIterator type exposes the following members.
Constructors
Name | Description
AreaTagTypeSetIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
AreaTagTypeSetIterator Class
Autodesk.Revit.DB Namespace