Revit 2015 API
SpotDimensionTypeSet Properties
The SpotDimensionTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of spotdimension types that are in the set.
See Also
SpotDimensionTypeSet Class
Autodesk.Revit.DB Namespace