Revit 2015 API
RevitLinkType Properties
The RevitLinkType type exposes the following members.
Properties
Name | Description
AttachmentType
 The attachment/overlay status of this link.
IsNestedLink
 Indicates whether this link is a nested or top-level link.
PathType
 The type of path the link uses.
See Also
RevitLinkType Class
Autodesk.Revit.DB Namespace