Revit 2015 API
RoofTypeSet Properties
The RoofTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of roof types that are in the set.
See Also
RoofTypeSet Class
Autodesk.Revit.DB Namespace