Revit 2015 API
TextNote Properties
The TextNote type exposes the following members.
Properties
Name | Description
Coord
Access the position of the TextNote object.
Leaders
Retrieves all the leaders belongs to the current TextNote object.
TextNoteType
Access the type of the TextNote object.
Width
Access the width of the TextNote object.
See Also
TextNote Class
Autodesk.Revit.DB Namespace