Revit 2015 API
RebarHookTypeSet Members
The RebarHookTypeSet type exposes the following members.
Constructors
Name | Description
RebarHookTypeSet
Initializes a new instance of the RebarHookTypeSet class
Methods
Name | Description
Clear
Removes every RebarHook type from the set, rendering it empty.
Contains
Tests for the existence of a RebarHook type within the set.
Erase
Removes a specified RebarHook type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified RebarHook type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of RebarHook types that are in the set.
See Also
RebarHookTypeSet Class
Autodesk.Revit.DB.Structure Namespace