Revit 2015 API
RoomTagTypeSetIterator Methods
The RoomTagTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
RoomTagTypeSetIterator Class
Autodesk.Revit.DB.Architecture Namespace