Revit 2015 API
GeometryObjectArray Methods
The GeometryObjectArray type exposes the following members.
Methods
Name | Description
Append
Add the geometry object to the end of the array.
Clear
Removes every geometry object from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified geometry object into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
See Also
GeometryObjectArray Class
Autodesk.Revit.DB Namespace