Revit 2015 API
ViewSheetSetsIterator Properties
The ViewSheetSetsIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
ViewSheetSetsIterator Class
Autodesk.Revit.DB Namespace