Revit 2015 API
BoundarySegmentArrayArrayIterator Methods
The BoundarySegmentArrayArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
See Also
BoundarySegmentArrayArrayIterator Class
Autodesk.Revit.DB.Mechanical Namespace