Revit 2015 API
SolidArrayIterator Methods
The SolidArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
See Also
SolidArrayIterator Class
Autodesk.Revit.DB Namespace