Revit 2015 API
MeshArray Methods
The MeshArray type exposes the following members.
Methods
Name | Description
Append
Add the mesh to the end of the array.
Clear
Removes every mesh from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified mesh into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
See Also
MeshArray Class
Autodesk.Revit.DB Namespace