Revit 2015 API
AreaCreationData Members
The AreaCreationData type exposes the following members.
Constructors
Name | Description
AreaCreationData
The data needed to create a new area
Methods
Name | Description
Properties
Name | Description
TagPoint
 Specify the location of the area tag.
See Also
AreaCreationData Class
Autodesk.Revit.Creation Namespace