Revit 2015 API
DimensionTypeSet Members
The DimensionTypeSet type exposes the following members.
Constructors
Name | Description
DimensionTypeSet
Initializes a new instance of the DimensionTypeSet class
Methods
Name | Description
Clear
Removes every dimension type from the set, rendering it empty.
Contains
Tests for the existence of a dimension type within the set.
Erase
Removes a specified dimension type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified dimension type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of dimension types that are in the set.
See Also
DimensionTypeSet Class
Autodesk.Revit.DB Namespace