Revit 2015 API
ContFootingTypeSetIterator Methods
The ContFootingTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
ContFootingTypeSetIterator Class
Autodesk.Revit.DB Namespace