Revit 2015 API
ExporterIFCRegistry Members
The ExporterIFCRegistry type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ExporterIFCRegistry
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExporterIFCRegistry Class
Autodesk.Revit.DB.IFC Namespace