Revit 2015 API
BoundaryConditions Members
The BoundaryConditions type exposes the following members.
Methods
Name | Description
associateWithLoad
Sets the Autodesk::Revit::DB::ElementId^ of Load to associate.
GetBoundaryConditionsType
 Returns the boundary conditions type.
GetDegreesOfFreedomCoordinateSystem
 Gets the origin and rotation of coordinate system that is used by translation and rotation parameters, like X Translation or Z Rotation.
GetOrientTo
 Returns the boundary conditions orientation option.
SetOrientTo
 Sets the boundary condition orientation option.
Properties
Name | Description
AssociatedLoad
Retrieve the AssociatedLoad.
Curve
Returns the geometric curve within a geometric loop that defines the area.
HostElement
Retrieve the HostElementId.
NumCurves
Returns the number of curves represent the Boundary Conditions Element.
Point
 If successful, returns the point represents Boundary Conditions.
See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace