Revit 2015 API
LoadCombination Properties
The LoadCombination type exposes the following members.
Properties
Name | Description
CombinationCaseName
Returns load combination case name.
CombinationNatureName
Returns load combination nature name of load case element.
CombinationState
Returns load combination state.
CombinationStateIndex
Returns the index in predefined load combination state array {}.
CombinationType
Returns load combination type.
CombinationTypeIndex
Returns the index in predefined load combination type array.
Factor
Returns factor value.
Name
Returns load combination name.
NumberOfComponents
Returns number of factors.
NumberOfUsages
Returns number of usages.
UsageName
Returns usage value.
See Also
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace