Revit 2015 API
StructuralSectionISplitSlopedFlange Properties
The StructuralSectionISplitSlopedFlange type exposes the following members.
Properties
Name | Description
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
See Also
StructuralSectionISplitSlopedFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace