Revit 2015 API
UIDocument Methods
The UIDocument type exposes the following members.
Methods
Name | Description
CanPlaceElementType
 Verifies that the user can be prompted to place the input element type on the current active view.
Dispose
GetOpenUIViews
Get a list of all open view windows in the Revit user interface.
GetRevitUIFamilyLoadOptions
Return the option object that allows you to use Revit's dialog boxes to let the user respond to questions that arise during loading of families.
PostRequestForElementTypePlacement
 Places a request on Revit's command queue for the user to place instances of the specified ElementType. This does not execute immediately, but instead when control returns to Revit from the current API context.
PromptForFamilyInstancePlacement(FamilySymbol)
Prompts the user to place instances of the specified FamilySymbol.
PromptForFamilyInstancePlacement(FamilySymbol, PromptForFamilyInstancePlacementOptions)
Prompts the user to place instances of the specified FamilySymbol.
PromptToMatchElementType
 Prompts the user to select elements to change them to the input type.
PromptToPlaceElementTypeOnLegendView
 Prompts the user to place an element type onto a legend view.
PromptToPlaceViewOnSheet
 Prompts the user to place a specified view onto a sheet.
RefreshActiveView
Refresh the display of the active view in the active document.
RequestViewChange
 Requests an asynchronous change of the active view in the currently active document.
SaveAndClose
Close the document, prompting the user for saving it when necessary.
SaveAs
 Saves the document to a file name obtained from the Revit user without prompting the user ot overwrite a file if it exists.
ShowElements(Element)
Shows the element by zoom to fit.
ShowElements(ElementId)
Shows the element by zoom to fit.
ShowElements(ICollection<ElementId>)
Shows the elements by zoom to fit.
ShowElements(ElementSet)
Shows the elements by zoom to fit.
See Also
UIDocument Class
Autodesk.Revit.UI Namespace