Revit 2015 API
GenericFormSet Properties
The GenericFormSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of objects that are in the set.
See Also
GenericFormSet Class
Autodesk.Revit.DB Namespace