Revit 2015 API
SpaceTagTypeSet Members
The SpaceTagTypeSet type exposes the following members.
Constructors
Name | Description
SpaceTagTypeSet
Initializes a new instance of the SpaceTagTypeSet class
Methods
Name | Description
Clear
Removes every space tag type from the set, rendering it empty.
Contains
Tests for the existence of a space tag type within the set.
Erase
Removes a specified space tag type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified space tag type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of space tag types that are in the set.
See Also
SpaceTagTypeSet Class
Autodesk.Revit.DB.Mechanical Namespace