Revit 2015 API
TextNoteTypeSetIterator Properties
The TextNoteTypeSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
TextNoteTypeSetIterator Class
Autodesk.Revit.DB Namespace