Revit 2015 API
FamilyInstance Methods
The FamilyInstance type exposes the following members.
Methods
Name | Description
AddCoping
Adds a coping (cut) to a steel beam.
flipFacing
The orientation of family instance facing will be flipped. If it can not be flipped, return false, otherwise return true.
FlipFromToRoom
 Flips the settings of "From Room" and "To Room" for the door or window instance.
flipHand
The orientation of family instance hand will be flipped. If it can not be flipped, return false, otherwise return true.
GetCopingIds
Lists the elements currently used as coping cutters for this element.
GetFamilyPointPlacementReferences
Returns the Point Placement References for the Family Instance.
GetOriginalGeometry
 Returns the original geometry of the instance, before the instance is modified by joins, cuts, coping, extensions, or other post-processing.
GetSubComponentIds
Gets the sub component ElementIds of the current family instance.
RemoveCoping
Removes a coping (cut) from a steel beam.
rotate
The family instance will be flipped by 180 degrees. If it can not be rotated, return false, otherwise return true.
SetCopingIds
Specifies the set of coping cutters on this element.
See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace