Revit 2015 API
AreaLoadTypeSet Methods
The AreaLoadTypeSet type exposes the following members.
Methods
Name | Description
Clear
Removes every areaload type from the set, rendering it empty.
Contains
Tests for the existence of a areaload type within the set.
Erase
Removes a specified areaload type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified areaload type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
AreaLoadTypeSet Class
Autodesk.Revit.DB.Structure Namespace