Revit 2015 API
LoadCaseSetIterator Members
The LoadCaseSetIterator type exposes the following members.
Constructors
Name | Description
LoadCaseSetIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
LoadCaseSetIterator Class
Autodesk.Revit.DB.Structure Namespace