Revit 2015 API
AreaTagTypeSetIterator Properties
The AreaTagTypeSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
AreaTagTypeSetIterator Class
Autodesk.Revit.DB Namespace