Revit 2015 API
Line Members
The Line type exposes the following members.
Methods
Name | Description
CreateBound
 Creates a new instance of a bound linear curve.
CreateUnbound
 Creates a new instance of an unbound linear curve.
Properties
Name | Description
Bound |  Obsolete.
Returns the bounded line between the specified points.
Direction
Returns the direction of the line.
Origin
Returns the origin of the line.
Unbound |  Obsolete.
Returns the unbounded line that passes through the specified point in the direction of the specified vector.
See Also
Line Class
Autodesk.Revit.DB Namespace