Revit 2015 API
FloorTypeSetIterator Methods
The FloorTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
FloorTypeSetIterator Class
Autodesk.Revit.DB Namespace