Revit 2015 API
LevelTypeSet Properties
The LevelTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of level types that are in the set.
See Also
LevelTypeSet Class
Autodesk.Revit.DB Namespace