Revit 2015 API
LineLoadTypeSetIterator Properties
The LineLoadTypeSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
LineLoadTypeSetIterator Class
Autodesk.Revit.DB.Structure Namespace