Revit 2015 API
GeometryObjectArrayIterator Methods
The GeometryObjectArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
See Also
GeometryObjectArrayIterator Class
Autodesk.Revit.DB Namespace