Revit 2015 API
AnalyticalModelStick.GetAlignmentMethod Method
Overload List
Name | Description
GetAlignmentMethod(AnalyticalElementSelector)
 Gets the alignment method for a given selector.
See Also
AnalyticalModelStick Class
AnalyticalModelStick Members
Autodesk.Revit.DB.Structure Namespace