Revit 2015 API
LoadCaseSet Members
The LoadCaseSet type exposes the following members.
Constructors
Name | Description
LoadCaseSet
Initializes a new instance of the LoadCaseSet class
Methods
Name | Description
Clear
Removes every load case from the set, rendering it empty.
Contains
Tests for the existence of a load case within the set.
Erase
Removes a specified load case from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified load case into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of load cases that are in the set.
See Also
LoadCaseSet Class
Autodesk.Revit.DB.Structure Namespace