Revit 2015 API
SolidArray Properties
The SolidArray type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a solid at a specified index within the array.
Size
Returns the number of solids that are in the array.
See Also
SolidArray Class
Autodesk.Revit.DB Namespace