Revit 2015 API
BoundarySegment Members
The BoundarySegment type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Curve
Get the curve that is formed by the element that defines the edge of this area.
Document
Provides the document in which the element that created this segment resides.
Element
Retrieve the element that is responsible for producing this boundary segment.
See Also
BoundarySegment Class
Autodesk.Revit.DB.Mechanical Namespace