Revit 2015 API
MeshArray Members
The MeshArray type exposes the following members.
Constructors
Name | Description
MeshArray
Initializes a new instance of the MeshArray class
Methods
Name | Description
Append
Add the mesh to the end of the array.
Clear
Removes every mesh from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified mesh into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a mesh at a specified index within the array.
Size
Returns the number of meshes that are in the array.
See Also
MeshArray Class
Autodesk.Revit.DB Namespace