Revit 2015 API
WallTypeSetIterator Methods
The WallTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
WallTypeSetIterator Class
Autodesk.Revit.DB Namespace