Revit 2015 API
TextNoteTypeSet Properties
The TextNoteTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of textnote types that are in the set.
See Also
TextNoteTypeSet Class
Autodesk.Revit.DB Namespace