Revit 2015 API
GeometryObjectArray Properties
The GeometryObjectArray type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a geometry object at a specified index within the array.
Size
Returns the number of geometry objects that are in the array.
See Also
GeometryObjectArray Class
Autodesk.Revit.DB Namespace