Revit 2015 API
SelElementSet Methods
The SelElementSet type exposes the following members.
Methods
Name | Description
Add
Add an element into the selected element set.
Clear
Clear the selected element set.
 (Overrides ElementSet.Clear().)
Create
Creates a new instance of a set specifically for holding selected elements.
Erase
Remove an element from the selected element set.
 (Overrides ElementSet.Erase(Element).)
Remove
Remove an element from the selected element set.
See Also
SelElementSet Class
Autodesk.Revit.UI.Selection Namespace