Revit 2015 API
CustomExporter Members
The CustomExporter type exposes the following members.
Constructors
Name | Description
CustomExporter
 Constructs a new instance of a CustomExporter for a given document using an input IExportContext to use during export.
Methods
Name | Description
Dispose
Releases all resources used by the CustomExporter
Export(IList<ElementId>)
 Exports a collection of 3-D views
Export(View3D)
 Exports one 3-D view
IsRenderingSupported
 Checks if 3D view rendering is currently supported in the running instance of Revit.
Properties
Name | Description
IncludeFaces
 This flag sets the exporter to either include or exclude notifications about faces being processed in the export context.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ShouldStopOnError
 This flag instructs the exporting process to either stop or continue in case an error occurs during any of the exporting methods.
See Also
CustomExporter Class
Autodesk.Revit.DB Namespace