Revit 2015 API
FormatValueOptions Methods
The FormatValueOptions type exposes the following members.
Methods
Name | Description
AreValidForUnitType |  Obsolete.
 Checks whether the FormatOptions in this FormatValueOptions is valid for a given unit type.
Dispose
GetFormatOptions
 Gets the FormatOptions to optionally override the default settings in the Units class.
SetFormatOptions
 Sets the FormatOptions to optionally override the default settings in the Units class.
See Also
FormatValueOptions Class
Autodesk.Revit.DB Namespace