Revit 2015 API
DimensionTypeSetIterator Methods
The DimensionTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
DimensionTypeSetIterator Class
Autodesk.Revit.DB Namespace