Revit 2015 API
MaterialSetIterator Properties
The MaterialSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
MaterialSetIterator Class
Autodesk.Revit.DB Namespace