Revit 2015 API
SpotDimensionTypeSet Methods
The SpotDimensionTypeSet type exposes the following members.
Methods
Name | Description
Clear
Removes every spotdimension type from the set, rendering it empty.
Contains
Tests for the existence of a spotdimension type within the set.
Erase
Removes a specified spotdimension type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified spotdimension type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
SpotDimensionTypeSet Class
Autodesk.Revit.DB Namespace