Revit 2015 API
GridTypeSet Properties
The GridTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of grid types that are in the set.
See Also
GridTypeSet Class
Autodesk.Revit.DB Namespace