Revit 2015 API
RoofTypeSetIterator Methods
The RoofTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
RoofTypeSetIterator Class
Autodesk.Revit.DB Namespace