Revit 2015 API
ReferencePlane Methods
The ReferencePlane type exposes the following members.
Methods
Name | Description
Flip
Flips the orientation of the reference plane.
See Also
ReferencePlane Class
Autodesk.Revit.DB Namespace