Revit 2015 API
LoadTypeBaseSetIterator Members
The LoadTypeBaseSetIterator type exposes the following members.
Constructors
Name | Description
LoadTypeBaseSetIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
LoadTypeBaseSetIterator Class
Autodesk.Revit.DB.Structure Namespace