Revit 2015 API
TrussTypeSetIterator Properties
The TrussTypeSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
TrussTypeSetIterator Class
Autodesk.Revit.DB.Structure Namespace