Revit 2015 API
GridTypeSet Methods
The GridTypeSet type exposes the following members.
Methods
Name | Description
Clear
Removes every grid type from the set, rendering it empty.
Contains
Tests for the existence of a grid type within the set.
Erase
Removes a specified grid type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified grid type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
GridTypeSet Class
Autodesk.Revit.DB Namespace