Revit 2015 API
AnnotationSymbolTypeSet Properties
The AnnotationSymbolTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of AnnotationSymbol types that are in the set.
See Also
AnnotationSymbolTypeSet Class
Autodesk.Revit.DB Namespace