Revit 2015 API
BoundarySegmentArrayArrayIterator Properties
The BoundarySegmentArrayArrayIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
BoundarySegmentArrayArrayIterator Class
Autodesk.Revit.DB.Mechanical Namespace