Revit 2015 API
LevelTypeSet Members
The LevelTypeSet type exposes the following members.
Constructors
Name | Description
LevelTypeSet
Initializes a new instance of the LevelTypeSet class
Methods
Name | Description
Clear
Removes every level type from the set, rendering it empty.
Contains
Tests for the existence of a level type within the set.
Erase
Removes a specified level type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified level type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of level types that are in the set.
See Also
LevelTypeSet Class
Autodesk.Revit.DB Namespace