Revit 2015 API
RevitLinkInstance Members
The RevitLinkInstance type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of a linked Revit project (RevitLinkType).
GetLinkDocument
 The document associated with the Revit link.
Properties
Name | Description
See Also
RevitLinkInstance Class
Autodesk.Revit.DB Namespace