Revit 2015 API
PointLoadTypeSet Properties
The PointLoadTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of pointload types that are in the set.
See Also
PointLoadTypeSet Class
Autodesk.Revit.DB.Structure Namespace