Revit 2015 API
AnnotationSymbol Methods
The AnnotationSymbol type exposes the following members.
Methods
Name | Description
addLeader
add a leader to this annotation symbol.
duplicate
Duplicate this annotation symbol.
removeLeader
remove a leader of this annotation symbol.
See Also
AnnotationSymbol Class
Autodesk.Revit.DB Namespace