Revit 2015 API
InSessionPrintSetting Members
The InSessionPrintSetting type exposes the following members.
Methods
Name | Description
Properties
Name | Description
PrintParameters
Returns the Parameters of Print Setup.
See Also
InSessionPrintSetting Class
Autodesk.Revit.DB Namespace