Revit 2015 API
CurtainSystemTypeSet Methods
The CurtainSystemTypeSet type exposes the following members.
Methods
Name | Description
Clear
Removes every CurtainSystem type from the set, rendering it empty.
Contains
Tests for the existence of a CurtainSystem type within the set.
Erase
Removes a specified CurtainSystem type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified CurtainSystem type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
CurtainSystemTypeSet Class
Autodesk.Revit.DB Namespace