Revit 2015 API
InternalDefinitions Members
The InternalDefinitions type exposes the following members.
Constructors
Name | Description
InternalDefinitions
Initializes a new instance of the InternalDefinitions class
Methods
Name | Description
Properties
Name | Description
See Also
InternalDefinitions Class
Autodesk.Revit.DB Namespace