Revit 2015 API
WallTypeSetIterator Members
The WallTypeSetIterator type exposes the following members.
Constructors
Name | Description
WallTypeSetIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
WallTypeSetIterator Class
Autodesk.Revit.DB Namespace