Revit 2015 API
IFCTypeInfo Members
The IFCTypeInfo type exposes the following members.
Constructors
Name | Description
IFCTypeInfo
 Constructs a new empty type info object.
Methods
Name | Description
Dispose
Releases all resources used by the IFCTypeInfo
Get2DMapHandle
 Gets the associated handle to a 2D IfcRepresentationMap for the type.
Get3DMapHandle
 Gets the associated handle to a 3D IfcRepresentationMap for the type.
GetStyle
 Gets the associated handle to an IfcTypeProduct for the type.
GetStyleTransform
 Gets the transform between the coordinate system of the type and the coordinate system of the instance's location in the Revit model.
IsValid
 Identifies if the object represents a valid type info.
Set2DMapHandle
 Sets the associated handle to a 2D IfcRepresentationMap for the type.
Set3DMapHandle
 Sets the associated handle to a 3D IfcRepresentationMap for the type.
SetStyle
 Sets the associated handle to an IfcTypeProduct for the type.
SetStyleTransform
 Sets the transform between the coordinate system of the type and the coordinate system of the instance's location in the Revit model.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MaterialId
 The material id associated with this type.
ScaledArea
 The area of the type's cross-section, scaled into the units of export.
ScaledDepth
 The depth of the type, scaled into the units of export.
ScaledInnerPerimeter
 The inner perimeter of the boundaries of the type's cross-section, scaled into the units of export.
ScaledOuterPerimeter
 The outer perimeter of the boundaries of the type's cross-section, scaled into the units of export.
See Also
IFCTypeInfo Class
Autodesk.Revit.DB.IFC Namespace