Revit 2015 API
InstanceArrayIterator Properties
The InstanceArrayIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
InstanceArrayIterator Class
Autodesk.Revit.DB Namespace