Revit 2015 API
RebarCoverTypeSetIterator Members
The RebarCoverTypeSetIterator type exposes the following members.
Constructors
Name | Description
RebarCoverTypeSetIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
RebarCoverTypeSetIterator Class
Autodesk.Revit.DB.Structure Namespace