Revit 2015 API
FasciaTypeSet Properties
The FasciaTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of fascia types that are in the set.
See Also
FasciaTypeSet Class
Autodesk.Revit.DB.Architecture Namespace