Revit 2015 API
TrussTypeSet Properties
The TrussTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of Truss types that are in the set.
See Also
TrussTypeSet Class
Autodesk.Revit.DB.Structure Namespace