Revit 2015 API
Parameter Members
The Parameter type exposes the following members.
Methods
Name | Description
AsDouble
Provides access to the double precision number within the parameter.
AsElementId
Provides access to the Autodesk::Revit::DB::ElementId^ stored within the parameter.
AsInteger
Provides access to the integer number within the parameter.
AsString
Provides access to the string contents of the parameter.
AsValueString()
Get the parameter value as a string with units.
AsValueString(FormatOptions)
Get the parameter value as a string with units.
Set(Double)
Sets the parameter to a new real number value.
Set(Int32)
Sets the parameter to a new integer value.
Set(String)
Sets the parameter to a new string of text.
Set(ElementId)
Sets the parameter to a new element id.
SetValueString
Set the parameter value according to the input string.
Properties
Name | Description
Definition
Returns the Definition object that describes the data type, name and other details of the parameter.
DisplayUnitType
Get the display unit type of the parameter object.
Element
The element to which this parameter belongs.
GUID
The Guid for a shared parameter.
HasValue
Identifies if the parameter has an assigned value.
Id
The id of the parameter.
IsReadOnly
Get the readonly property of the parameter.
 (Overrides APIObject.IsReadOnly.)
IsShared
Identifies if the parameter is a shared parameter.
StorageType
Describes the type that is used internally within the parameter to store its value.
UserModifiable
 Indicates whether the interactive user can modify the value of this parameter.
See Also
Parameter Class
Autodesk.Revit.DB Namespace