Revit 2015 API
ContFooting Members
The ContFooting type exposes the following members.
Methods
Name | Description
Properties
Name | Description
FootingType
Retrieves an object that represents the type of the footing.
See Also
ContFooting Class
Autodesk.Revit.DB Namespace