Revit 2015 API
SlabEdgeTypeSet Methods
The SlabEdgeTypeSet type exposes the following members.
Methods
Name | Description
Clear
Removes every slab edge type from the set, rendering it empty.
Contains
Tests for the existence of a slab edge type within the set.
Erase
Removes a specified slab edge type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified slab edge type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
SlabEdgeTypeSet Class
Autodesk.Revit.DB Namespace