Revit 2015 API
BoundarySegmentArrayArrayIterator Members
The BoundarySegmentArrayArrayIterator type exposes the following members.
Constructors
Name | Description
BoundarySegmentArrayArrayIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
BoundarySegmentArrayArrayIterator Class
Autodesk.Revit.DB.Mechanical Namespace