Revit 2015 API
LoadTypeBaseSet Members
The LoadTypeBaseSet type exposes the following members.
Constructors
Name | Description
LoadTypeBaseSet
Initializes a new instance of the LoadTypeBaseSet class
Methods
Name | Description
Clear
Removes every load type base from the set, rendering it empty.
Contains
Tests for the existence of a load type base within the set.
Erase
Removes a specified load type base from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified load type base into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of load type bases that are in the set.
See Also
LoadTypeBaseSet Class
Autodesk.Revit.DB.Structure Namespace