Revit 2015 API
StructuralSection Members
The StructuralSection type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the StructuralSection
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
StructuralSectionShape
 The type of structural section shape.
StructuralSectionShapeName
 A human readable string representing the structural section shape.
See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace