Revit 2015 API
WorksetTable Members
The WorksetTable type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the WorksetTable
GetActiveWorksetId
 Returns the active workset's WorksetId.
GetWorkset(Guid)
 Returns the workset from a input Guid.
GetWorkset(WorksetId)
 Returns the workset from a input WorksetId.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
WorksetTable Class
Autodesk.Revit.DB Namespace