Revit 2015 API
Leader Members
The Leader type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Elbow
Retrieves and sets the Elbow point of the Leader.
End
Retrieves and sets the End point of the Leader.
See Also
Leader Class
Autodesk.Revit.DB Namespace