Revit 2015 API
LoadTypeBaseSetIterator Methods
The LoadTypeBaseSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
LoadTypeBaseSetIterator Class
Autodesk.Revit.DB.Structure Namespace