Revit 2015 API
LineLoad Properties
The LineLoad type exposes the following members.
Properties
Name | Description
EndPoint
Returns the three dimensional location of the end point for the line load.
Force
Returns the three dimensional force applied to one of the points for the line load.
Force1
Returns the three dimensional force applied to the start point of the line load.
Force2
Returns the three dimensional force applied to the end point of the line load.
Moment
Returns the three dimensional moment applied to one of the points for the line load.
Moment1
Returns the three dimensional moment applied to the start point of the line load.
Moment2
Returns the three dimensional moment applied to the end point of the line load.
Point
Returns the three dimensional location of one of the points for the line load.
ProjectedLoad
Returns whether the load is projected or not.
StartPoint
Returns the three dimensional location of the start point for the line load.
UniformLoad
Report if the load is uniform.
See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace