Revit 2015 API
PointLoadTypeSet Members
The PointLoadTypeSet type exposes the following members.
Constructors
Name | Description
PointLoadTypeSet
Initializes a new instance of the PointLoadTypeSet class
Methods
Name | Description
Clear
Removes every pointload type from the set, rendering it empty.
Contains
Erase
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of pointload types that are in the set.
See Also
PointLoadTypeSet Class
Autodesk.Revit.DB.Structure Namespace