Revit 2015 API
DimensionTypeSet Methods
The DimensionTypeSet type exposes the following members.
Methods
Name | Description
Clear
Removes every dimension type from the set, rendering it empty.
Contains
Tests for the existence of a dimension type within the set.
Erase
Removes a specified dimension type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified dimension type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
DimensionTypeSet Class
Autodesk.Revit.DB Namespace