Revit 2015 API
StructuralSectionCSlopedFlange Properties
The StructuralSectionCSlopedFlange type exposes the following members.
Properties
Name | Description
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
See Also
StructuralSectionCSlopedFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace