Revit 2015 API
BoundarySegmentArrayArray Properties
The BoundarySegmentArrayArray type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a boundary segment array at a specified index within the array.
Size
Returns the number of boundary segment arrays that are in the array.
See Also
BoundarySegmentArrayArray Class
Autodesk.Revit.DB Namespace