Revit 2015 API
FabricSheet Properties
The FabricSheet type exposes the following members.
Properties
Name | Description
CoverOffset
 The additional cover offset of the Fabric Sheet.
CutOverallLength
 The sheet length after cutting has taken place.
CutOverallWidth
 The sheet width after cutting has taken place.
CutSheetMass
 The sheet mass after cutting has taken place.
FabricAreaOwnerId
 The Fabric Area Id.
FabricHostReference
 Controls if Single Fabric Sheet should be cut by the Host Cover
FabricLocation
 The Fabric Sheet location in the host.
HostId
 The structure element that contains the Fabric Sheet.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace