Revit 2015 API
StructuralSectionRound Class
 Defines common set of parameters for structural section round contour.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Syntax
C#
public class StructuralSectionRound : StructuralSection
Visual Basic
Public Class StructuralSectionRound _
	Inherits StructuralSection
Visual C++
public ref class StructuralSectionRound : public StructuralSection
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionPipeStandard
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundBar
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundHSS
See Also
StructuralSectionRound Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace