Revit 2015 API
GutterTypeSetIterator Members
The GutterTypeSetIterator type exposes the following members.
Constructors
Name | Description
GutterTypeSetIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
GutterTypeSetIterator Class
Autodesk.Revit.DB.Architecture Namespace