Revit 2015 API
AreaTagTypeSetIterator Methods
The AreaTagTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
AreaTagTypeSetIterator Class
Autodesk.Revit.DB Namespace