Revit 2015 API
FamilySymbolSet Members
The FamilySymbolSet type exposes the following members.
Constructors
Name | Description
FamilySymbolSet
Initializes a new instance of the FamilySymbolSet class
Methods
Name | Description
Clear
Removes every symbol from the set, rendering it empty.
Contains
Tests for the existence of a family symbol within the set.
Erase
Removes a specified family symbol from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified family symbol into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of family symbols that are in the set.
See Also
FamilySymbolSet Class
Autodesk.Revit.DB Namespace