Revit 2015 API
ViewCropRegionShapeManager Members
The ViewCropRegionShapeManager type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ViewCropRegionShapeManager
GetCropRegionShape
 Gets the crop region boundaries.
IsCropRegionShapeValid
 Verifies that boundaries represent one closed curve loop without self-intersections, consisting of non-zero length straight lines in plane parallel to the view plane. Curves in boundaries use model coordinates.
RemoveCropRegionShape
 Removes boundaries of crop region.
RemoveSplit
 Removes split settings of crop region.
SetCropRegionEmptyShape
 Sets crop region of empty shape making possible interactive sketching.
SetCropRegionShape
 Sets boundaries of crop region.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ShapeSet
 Verifies that view has crop region shape set.
Split
 Verifies that view crop region is split.
Valid
 Verifies that view is allowed to manage crop region shape.
See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace