Revit 2015 API
StructuralSectionLAngle Properties
The StructuralSectionLAngle type exposes the following members.
Properties
Name | Description
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
See Also
StructuralSectionLAngle Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace