Revit 2015 API
AreaTagTypeSet Members
The AreaTagTypeSet type exposes the following members.
Constructors
Name | Description
AreaTagTypeSet
Initializes a new instance of the AreaTagTypeSet class
Methods
Name | Description
Clear
Removes every areatag type from the set, rendering it empty.
Contains
Tests for the existence of a areatag type within the set.
Erase
Removes a specified areatag type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified areatag type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of areatag types that are in the set.
See Also
AreaTagTypeSet Class
Autodesk.Revit.DB Namespace