Revit 2015 API
GridTypeSet Members
The GridTypeSet type exposes the following members.
Constructors
Name | Description
GridTypeSet
Initializes a new instance of the GridTypeSet class
Methods
Name | Description
Clear
Removes every grid type from the set, rendering it empty.
Contains
Tests for the existence of a grid type within the set.
Erase
Removes a specified grid type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified grid type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of grid types that are in the set.
See Also
GridTypeSet Class
Autodesk.Revit.DB Namespace