Revit 2015 API
RebarShapeSet Members
The RebarShapeSet type exposes the following members.
Constructors
Name | Description
RebarShapeSet
Initializes a new instance of the RebarShapeSet class
Methods
Name | Description
Clear
Removes every rebar shape from the set, rendering it empty.
Contains
Tests for the existence of a rebar shape within the set.
Erase
Removes a specified rebar shape from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified rebar shape into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of rebar shapes that are in the set.
See Also
RebarShapeSet Class
Autodesk.Revit.DB.Structure Namespace