Revit 2015 API
AnalyticalModelSweptProfile Methods
The AnalyticalModelSweptProfile type exposes the following members.
Methods
Name | Description
Dispose
GetDrivingCurve
 Provides access to the curve that dictates the path of the swept profile.
GetSweptProfile
 Returns an object that describes the profile that is swept along the driving curve.
See Also
AnalyticalModelSweptProfile Class
Autodesk.Revit.DB.Structure Namespace