Revit 2015 API
GeometryObjectArrayIterator Members
The GeometryObjectArrayIterator type exposes the following members.
Constructors
Name | Description
GeometryObjectArrayIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
GeometryObjectArrayIterator Class
Autodesk.Revit.DB Namespace