Revit 2015 API
ViewSheet Properties
The ViewSheet type exposes the following members.
Properties
Name | Description
IsPlaceholder
 Identifies whether or not the view sheet represents a placeholder sheet.
SheetNumber
 The sheet number of the document.
Views |  Obsolete.
Returns the set of all views on the sheet.
See Also
ViewSheet Class
Autodesk.Revit.DB Namespace