Revit 2015 API
CurtainSystemTypeSetIterator Properties
The CurtainSystemTypeSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
CurtainSystemTypeSetIterator Class
Autodesk.Revit.DB Namespace