Revit 2015 API
BeamSystemTypeSetIterator Properties
The BeamSystemTypeSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
BeamSystemTypeSetIterator Class
Autodesk.Revit.DB Namespace