Revit 2015 API
Dimension Properties
The Dimension type exposes the following members.
Properties
Name | Description
Above
The text shown above the segment's value.
AreSegmentsEqual
Indicates if all segments are forced to be equal.
Below
The text shown below the segment's value.
Curve
 A curve that represents the dimension line.
DimensionShape
The shape of this dimension.
DimensionType
 The dimension style of this dimension.
FamilyLabel
The family parameter label of the dimension.
IsLocked
 Indicates if this dimension is locked.
Name
Retrieves or changes the name associated with the Dimension.
NumberOfSegments
The number of segments for the dimension.
Prefix
The text shown before the segment's value.
References
 Returns an array of geometric references to which the dimension is attached.
Segments
The segments in the dimension.
Suffix
The text shown after the segment's value.
Value
 The value of the dimension.
ValueOverride
The text that replaces the segment's value.
ValueString
 The dimension value as a user visible string.
View
 Supplies the view that contains the dimension if the dimension is view specific.
See Also
Dimension Class
Autodesk.Revit.DB Namespace