Revit 2015 API
ImageType Properties
The ImageType type exposes the following members.
Properties
Name | Description
Path
 The original image file path used if the image is loaded from a disk file, or empty if the image is generated by Revit internally, such as save a view to an image.
See Also
ImageType Class
Autodesk.Revit.DB Namespace