Revit 2015 API
WallTypeSet Members
The WallTypeSet type exposes the following members.
Constructors
Name | Description
WallTypeSet
Initializes a new instance of the WallTypeSet class
Methods
Name | Description
Clear
Removes every wall type from the set, rendering it empty.
Contains
Tests for the existence of a wall type within the set.
Erase
Removes a specified wall type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified wall type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of wall types that are in the set.
See Also
WallTypeSet Class
Autodesk.Revit.DB Namespace