Revit 2015 API
MaterialSetIterator Methods
The MaterialSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
MaterialSetIterator Class
Autodesk.Revit.DB Namespace