Revit 2015 API
AreaLoadTypeSet Properties
The AreaLoadTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of areaload types that are in the set.
See Also
AreaLoadTypeSet Class
Autodesk.Revit.DB.Structure Namespace