Revit 2015 API
Plane Members
The Plane type exposes the following members.
Constructors
Name | Description
Plane(XYZ, XYZ)
Constructor for geometry plane.
Plane(XYZ, XYZ, XYZ)
Constructor for geometry plane.
Methods
Name | Description
Properties
Name | Description
Normal
Get the Normal of the plane.
Origin
Get the Origin of the plane.
XVec
Get the XVec of the plane.
YVec
Get the YVec of the plane.
See Also
Plane Class
Autodesk.Revit.DB Namespace