Revit 2015 API
BooleanOperationsUtils Methods
The BooleanOperationsUtils type exposes the following members.
Methods
Name | Description
Dispose
ExecuteBooleanOperation
 Perform a boolean geometric operation between two solids, and return a new solid to represent the result.
ExecuteBooleanOperationModifyingOriginalSolid
 Perform a boolean geometric operation between two solids, and modify the original solid to represent the result.
See Also
BooleanOperationsUtils Class
Autodesk.Revit.DB Namespace