Revit 2015 API
FasciaTypeSet Members
The FasciaTypeSet type exposes the following members.
Constructors
Name | Description
FasciaTypeSet
Initializes a new instance of the FasciaTypeSet class
Methods
Name | Description
Clear
Removes every fascia type from the set, rendering it empty.
Contains
Tests for the existence of a fascia type within the set.
Erase
Removes a specified fascia type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified fascia type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of fascia types that are in the set.
See Also
FasciaTypeSet Class
Autodesk.Revit.DB.Architecture Namespace