Revit 2015 API
Grid Methods
The Grid type exposes the following members.
Methods
Name | Description
ExtendToAllLevels
Adjust the grid to cut all levels.
GetExtents
Gets the extents of the grid in the model.
See Also
Grid Class
Autodesk.Revit.DB Namespace