Revit 2015 API
Point Members
The Point type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Coord
 Returns the coordinates of the point.
Reference
Returns a stable reference to the point.
See Also
Point Class
Autodesk.Revit.DB Namespace