Revit 2015 API
BoundarySegmentArrayArray Members
The BoundarySegmentArrayArray type exposes the following members.
Constructors
Name | Description
BoundarySegmentArrayArray
Initializes a new instance of the BoundarySegmentArrayArray class
Methods
Name | Description
Append
Add the boundary segment array to the end of the array.
Clear
Removes every boundary segment array from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a boundary segment array at a specified index within the array.
Size
Returns the number of boundary segment arrays that are in the array.
See Also
BoundarySegmentArrayArray Class
Autodesk.Revit.DB.Mechanical Namespace