Revit 2015 API
Wire Methods
The Wire type exposes the following members.
Methods
Name | Description
AppendVertex
 Appends one vertex to the end of the wire.
AreVertexPointsValid
 Checks if the given vertex points are valid for the wire.
ConnectTo
 Connects the wire to other elements.
Create
 Creates a new wire.
GetVertex
 Gets the position of an existing vertex.
InsertVertex
 Inserts a new vertex before the specified index.
IsVertexPointValid
 Checks if the given vertex point can be added to this wire.
RemoveVertex
 Removes the vertex corresponding to the specified index.
SetVertex
 Sets the position of a given vertex.
See Also
Wire Class
Autodesk.Revit.DB.Electrical Namespace