Revit 2015 API
RebarBarTypeSet Methods
The RebarBarTypeSet type exposes the following members.
Methods
Name | Description
Clear
Removes every RebarBar type from the set, rendering it empty.
Contains
Tests for the existence of a RebarBar type within the set.
Erase
Removes a specified RebarBar type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified RebarBar type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
RebarBarTypeSet Class
Autodesk.Revit.DB.Structure Namespace