Revit 2015 API
LoadTypeBaseSet Properties
The LoadTypeBaseSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of load type bases that are in the set.
See Also
LoadTypeBaseSet Class
Autodesk.Revit.DB.Structure Namespace