Revit 2015 API
TextNoteTypeSetIterator Methods
The TextNoteTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
TextNoteTypeSetIterator Class
Autodesk.Revit.DB Namespace