Revit 2015 API
DimensionTypeSet Properties
The DimensionTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of dimension types that are in the set.
See Also
DimensionTypeSet Class
Autodesk.Revit.DB Namespace