Revit 2015 API
PointCloudType Methods
The PointCloudType type exposes the following members.
Methods
Name | Description
Create
 Creates a new point cloud type for a given point cloud engine.
See Also
PointCloudType Class
Autodesk.Revit.DB Namespace