Revit 2015 API
LoadCaseSetIterator Properties
The LoadCaseSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
LoadCaseSetIterator Class
Autodesk.Revit.DB.Structure Namespace