Revit 2017 API
DatumPlane Methods
The DatumPlane type exposes the following members.
Methods
Name | Description
AddLeader
 Adds a default Leader for the indicated end of the datum plane. This method does not apply to Reference planes (which do not support leaders).
CanBeVisibleInView
 Checks if the datum plane can be visible in the view.
GetCurvesInView
 Gets a collection of curves representing the DatumPlane element in the given view.
GetDatumExtentTypeInView
 Identifies if the end of the datum plane is aligned with 3D extents or is set to vary specifically in the indicated view.
GetLeader
 Gets a copy of the leader applied to the indicated end of the datum plane. This method does not apply to Reference planes (which do not support leaders).
GetPropagationViews
 Gets a list of candidate views which are parallel to the current view and to which the extents of the datum may be propagated.
HasBubbleInView
 Identifies if the DatumPlane has bubble or not.
HideBubbleInView
 Hides the bubble in a view. This method does not apply to Reference planes.
IsBubbleVisibleInView
 Identifies if the bubble is visible or not in a view.
IsCurveValidInView
 Checks if the curve is valid to be as the extents for the datum plane in a view. The curve must be bound and coincident with the original one of the datum plane.
IsLeaderValid
 Identifies if the leader valid or not for this DatumPlane. This method does not apply to Reference planes (which do not support leaders).
Maximize3DExtents
 Maximizes the 3d extents of the datum plane in all possible views.
PropagateToViews
 Propagates the extents applied to this datum in the view to the specified parallel views.
SetCurveInView
 Sets the extents to match the curve.
SetDatumExtentType
 Sets whether or not the end of the datum plane is aligned with 3D extents or is set to vary specifically in the indicated view.
SetLeader
 Sets the leader to the indicated end of the datum plane. This method does not apply to Reference planes (which do not support leaders).
ShowBubbleInView
 Shows the bubble in a view. This method does not apply to Reference planes.
See Also
DatumPlane Class
Autodesk.Revit.DB Namespace