Revit 2017 API
ProjectLocation Properties
The ProjectLocation type exposes the following members.
Properties
Name | Description
Name
The name of the project location.
 (Overrides Element.Name.)
ProjectPosition
Gets or sets the coordinates of a point in the project location coordinate system.
SiteLocation
The site location to which this project location refers.
See Also
ProjectLocation Class
Autodesk.Revit.DB Namespace