Revit 2017 API
Ellipse Methods
The Ellipse type exposes the following members.
Methods
Name | Description
Create
 Creates a new geometric ellipse or elliptical arc object.
See Also
Ellipse Class
Autodesk.Revit.DB Namespace