Revit 2017 API
LoadCase Properties
The LoadCase type exposes the following members.
Properties
Name | Description
NatureCategory |  Obsolete.
 The nature category of the load case.
NatureId
 The nature ID of the load case.
Number
 Returns unique load case number.
SubcategoryId
 Build-in or user defined subcategory of Structural Load Cases (OST_LoadCases) category.
See Also
LoadCase Class
Autodesk.Revit.DB.Structure Namespace