Revit 2017 API
StructuralSectionCParallelFlange Properties
The StructuralSectionCParallelFlange type exposes the following members.
Properties
Name | Description
BoltDiameter
 Maximum bolt hole diameter, in. (mm)
BoltSpacing
 Standard bolt spacing, in. (mm)
ClearWebHeight
 Detailing depth between the web toes of the fillets, in.(mm)
FlangeToeOfFillet
 Detailing distance from center of web to flange toe of fillet, in. (mm)
WebToeOfFillet
 Detailing distance from outer face of flange to web toe of fillet, in. (mm)
See Also
StructuralSectionCParallelFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace