Revit 2017 API
TextNode Methods
The TextNode type exposes the following members.
Methods
Name | Description
GetFormattedText
 Returns an FormattedText object that contains text and associated formatting of this TextNode.
GetFormattedTextRuns |  Obsolete.
 Returns a list of separated runs of formatted text.
See Also
TextNode Class
Autodesk.Revit.DB Namespace