Revit 2017 API
BasePoint Properties
The BasePoint type exposes the following members.
Properties
Name | Description
IsShared
Indicates whether the base point is shared.
See Also
BasePoint Class
Autodesk.Revit.DB Namespace