Revit 2017 API
ProjectPosition Members
The ProjectPosition type exposes the following members.
Constructors
Name | Description
ProjectPosition
Construct a new ProjectPosition object with the specified East/West offset, North/South offset, elevation offset and angle of rotation
Methods
Name | Description
Properties
Name | Description
Angle
Angle from True North
EastWest
East/West offset
Elevation
Elevation above ground level.
NorthSouth
North/South offset
See Also
ProjectPosition Class
Autodesk.Revit.DB Namespace