Revit 2017 API
ProjectLocation Methods
The ProjectLocation type exposes the following members.
Methods
Name | Description
Duplicate
Generate a copy of this project location with the specified name.
See Also
ProjectLocation Class
Autodesk.Revit.DB Namespace