Revit 2017 API
FabricationPart Members
The FabricationPart type exposes the following members.
Methods
Name | Description
AdjustEndLength
 Adjusts the length for the specified connector.
AlignPartByConnectors
 Moves fabrication part by one of its connectors and aligns it to another connector.
CanAdjustEndLength
 Checks if the end of fabrication part can be adjusted.
ConnectAndCouple
 Makes a connection between the specified connectors and adds coupling if necessary.
Create(Document, FabricationServiceButton, Int32, ElementId)
 Creates a fabrication part element based on button.
Create(Document, FabricationServiceButton, Double, Double, ElementId)
 Creates a fabrication part element based on button and size.
CreateHanger(Document, FabricationServiceButton, Int32, ElementId)
 Creates a free placed hanger.
CreateHanger(Document, FabricationServiceButton, ElementId, Connector, Double, Boolean)
 Creates a hanger on the fabrication part.
CreateHanger(Document, FabricationServiceButton, Int32, ElementId, Connector, Double, Boolean)
 Creates a hanger on the fabrication part.
GetCalculatedDimensionValue
 Gets the calculated dimension value.
GetDimensionCalculatedOptions
 Gets the calculated options of the fabrication dimension.
GetDimensions
 Gets all fabrication dimensions.
GetDimensionValue
 Gets the value of the fabrication dimension, returns value in Revit internal units.
GetHostedInfo
 Gets the fabrication hosted element information.
GetProductListEntryCount
 Gets the number of product entries for this part.
GetProductListEntryName
 Gets the specified product list entry name.
GetRodInfo
 Gets the fabrication rod information.
GetTransform
 Gets the transformation matrix of the fabrication part element.
IsAHanger
 Checks whether it is a hanger.
IsAStraight
 Checks whether it is a straight part.
IsATap
 Checks if it is any sort of tap.
IsDimensionCalculated
 Checks if the fabrication dimension is calculated.
IsProductList
 Gets whether or not the fabrication part is a product list.
IsProductListEntryCompatibleSize
 Checks to see if this part can be changed to the specified product entry without altering any connected dimensions.
OptimizeLengths
 Optimizes the length fabrication straight parts.
PlaceAsTap
 Places the part by its connector to a specific position on the straight part at the specified distance from the host part connector.
PlaceFittingAsCutIn
 Places the fitting on the straight part by cut in, use the fitting's focal point as the insertion position.
Reposition
 Repositions the fabrication straight part to another end of the run.
RotateConnectedPartByConnector
 Rotates a connected fabrication part around the axis of the specified connector.
RotateConnectedTap
 Rotates a connected fabrication tap by the specified angles about the primary and secondary axis.
SetCalculatedDimensionValue
 Sets the calculated dimension value.
SetDimensionValue
 Sets the fabrication dimension value. The value is in Revit internal units.
SetPositionByEnd
 Positions the connector of the fabrication part element by the passed point.
StretchAndFit
 Stretch the fabrication part from the specified connector and fit to the target routing end.
Properties
Name | Description
Alias
 The alias of the fabrication part.
BottomOfPartElevation
 The associated elevation to the bottom of fabrication part off of the current level.
ConnectorManager
 The connector manager of the fabrication part.
CutType
 The cut type of the fabrication part.
DomainType
 The domain type for the fabrication part.
DoubleWallMaterial
 The double wall material identifier of the fabrication part.
DoubleWallMaterialArea
 The double wall material area of the fabrication part. If the fabrication part is not double walled, returns zero.
DoubleWallMaterialThickness
 The double wall material thickness of the fabrication part. If the fabrication part is not double walled, returns zero.
HasDoubleWall
 True if the fabrication part is double walled.
HasInsulation
 True if the fabrication part is insulated.
HasLining
 True if the fabrication part is lined.
InsulationArea
 The insulation area of the fabrication part. If the fabrication part is not insulated, returns zero.
InsulationSpecification
 The fabrication part insulation specification identifier.
InsulationThickness
 The insulation thickness of the fabrication part. If the fabrication part is not insulated, returns zero.
InsulationType
 The insulation type of the fabrication part.
IsBoughtOut
 True if the fabrication part is bought out.
ItemCustomId
 The item custom identifier for the fabrication part.
ItemNumber
 The item number that is used for identification, re-ordering from shop.
LevelOffset
 The associated level offset that indicates the distance from the center of the fabrication part to the current level.
LiningArea
 The lining area of the fabrication part. If the fabrication part is not lined, returns zero.
LiningThickness
 The lining thickness of the fabrication part. If the fabrication part is not lined, returns zero.
LiningType
 The lining type of the fabrication part.
Material
 The fabrication material identifier.
MaterialThickness
 The material thickness of the fabrication part.
Notes
 The notes of the fabrication part.
Origin
 The origin of the fabrication part element.
OverallSize
 The overall size of the fabrication part.
ProductCode
 The current database id of the part within the fabrication database.
ProductDataRange
 The product data range of the fabrication part.
ProductFinishDescription
 The product finish description of the fabrication part.
ProductInstallType
 The product install type of the fabrication part.
ProductListEntry
 The product entry index of the fabrication part. A value of -1 indicates the fabrication part is not a product list.
ProductLongDescription
 The product long description of the fabrication part.
ProductMaterialDescription
 The product material description of the fabrication part.
ProductName
 The product name of the fabrication part.
ProductOriginalEquipmentManufacture
 The product original equipment manufacture (OEM) of the fabrication part.
ProductShortDescription
 The product short description of the fabrication part.
ProductSizeDescription
 The product size description of the fabrication part.
ProductSpecificationDescription
 The product specification description of the fabrication part.
ServiceAbbreviation
 The associated service abbreviation for the fabrication service.
ServiceId
 The fabrication part service identifier. The service can only be changed to compatible services.
ServiceName
 The name of the service associated with the fabrication part.
SheetMetalArea
 The sheet metal area of the fabrication part.
Size
 The size of the fabrication part.
Slope
 The slope for the straight fabrication part.
Specification
 The fabrication part specification identifier.
TopOfPartElevation
 The associated elevation to the top of fabrication part off of the current level.
ValidationStatus
 The validation status of the fabrication part.
Vendor
 The vendor of the fabrication part.
VendorCode
 The vendor code of the fabrication part.
Weight
 The weight of the fabrication part.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace