Revit 2017 API
DockablePaneProviderData Members
The DockablePaneProviderData type exposes the following members.
Constructors
Name | Description
DockablePaneProviderData
Initializes a new instance of the DockablePaneProviderData class
Methods
Name | Description
Properties
Name | Description
ContextualHelp
 The contextual help associated with the pane.
EditorInteraction
 Defines the interaction this pane has with the Active Editor when the pane becomes active.
FrameworkElement
 The Windows Presentation Framework object containing the pane's user interface.
InitialState
 The initial position of the docking pane.
VisibleByDefault
 Controls the default visibility of the pane upon the first time the pane/plugin is loaded into Revit.
See Also
DockablePaneProviderData Class
Autodesk.Revit.UI Namespace