Revit 2017 API
RevitLinkOperations Members
The RevitLinkOperations type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RevitLinkOperations
SetGetLocalPathForOpenCallback
 Sets the IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command for Revit links obtained from an IExternalResourceServer.
SetOnLocalLinkSharedCoordinatesSavedCallback
 Sets the callback that will be called when the Revit user saves new shared coordinate settings to a linked document obtained from an IExternalResourceServer.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RevitLinkOperations Class
Autodesk.Revit.DB Namespace