Revit 2017 API
SiteLocation Methods
The SiteLocation type exposes the following members.
Methods
Name | Description
ConvertFromProjectTime
Converts project time to UTC time.
ConvertToProjectTime
Converts local time or UTC time to project time.
See Also
SiteLocation Class
Autodesk.Revit.DB Namespace