Revit 2017 API
StructuralSectionRoundHSS Members
The StructuralSectionRoundHSS type exposes the following members.
Constructors
Name | Description
StructuralSectionRoundHSS
 Creates a new instance of Structural Section Round HSS shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
WallDesignThickness
 Represents wall design thickness of pipe.
WallNominalThickness
 Represents wall nominal thickness of pipe.
See Also
StructuralSectionRoundHSS Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace