Revit 2017 API
ElectricalSystem Methods
The ElectricalSystem type exposes the following members.
Methods
Name | Description
AddToCircuit
Add a set of exist components to the Electrical System.
DisconnectPanel
Disconnect the panel for the Electrical System.
NewWires
 Create a bunch of wires for the electrical system.
RemoveFromCircuit
remove a set of exist components from the Electrical System.
SelectPanel
Set the panel for the Electrical System.
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace