Revit 2017 API
IndependentTag Methods
The IndependentTag type exposes the following members.
Methods
Name | Description
CanLeaderEndConditionBeAssigned
 Checks whether the LeaderEndCondition can be assigned.
GetTaggedLocalElement
 Get the tagged local element if any.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace