Revit 2017 API
ShapeImporter Methods
The ShapeImporter type exposes the following members.
Methods
Name | Description
Convert
 Converts the geometry stored in the external format into a collection of Revit geometry objects.
Dispose
IsServiceAvailable
 Checks whether the data conversion service is available.
See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace