Revit 2017 API
RevitLinkOperations Methods
The RevitLinkOperations type exposes the following members.
Methods
Name | Description
Dispose
SetGetLocalPathForOpenCallback
 Sets the IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command for Revit links obtained from an IExternalResourceServer.
SetOnLocalLinkSharedCoordinatesSavedCallback
 Sets the callback that will be called when the Revit user saves new shared coordinate settings to a linked document obtained from an IExternalResourceServer.
See Also
RevitLinkOperations Class
Autodesk.Revit.DB Namespace