Revit 2017 API
MEPSystemType Members
The MEPSystemType type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Abbreviation
 Identifies the abbreviation, the short name, for the system type
CalculationLevel
 Identifies the calculation level for the system type.
LineColor
 Indicates the color that should override the line color for all components in the system.
LinePatternId
 Indicates the line pattern color that should override the line color for all components in the system.
LineWeight
 Indicates the weight that should override the line weight for all components in the system.
MaterialId
 Indicates the material id that should override the material for all components in the system.
SystemClassification
 Identifies the classification for the system type
See Also
MEPSystemType Class
Autodesk.Revit.DB Namespace