Revit 2017 API
PipingSystem Properties
The PipingSystem type exposes the following members.
Properties
Name | Description
BaseEquipmentConnector
The connector within base equipment which is used to connect with system.
FixtureUnits |  Obsolete.
 The fixture units of this piping system
Flow |  Obsolete.
 The flow of this piping system
IsWellConnected
 Indicates if the system is well connected or not.
PipingNetwork
 Pipes and fittings which are contained in this system.
StaticPressure |  Obsolete.
 The static pressure of this piping system
SystemType
The type of this piping system.
See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace