Revit 2017 API
Surface Members
The Surface type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the Surface
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
Surface Class
Autodesk.Revit.DB Namespace