Revit 2017 API
StructuralSectionISlopedFlange Properties
The StructuralSectionISlopedFlange type exposes the following members.
Properties
Name | Description
BoltDiameter
 Maximum bolt hole diameter, in. (mm)
BoltSpacing
 Standard bolt spacing, in. (mm)
ClearWebHeight
 Detailing depth between the web toes of the fillets, in.(mm)
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
WebToeOfFillet
 Detailing distance from outer face of flange to web toe of fillet, in. (mm)
See Also
StructuralSectionISlopedFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace