Revit 2017 API
StructuralSectionPipeStandard Members
The StructuralSectionPipeStandard type exposes the following members.
Constructors
Name | Description
StructuralSectionPipeStandard
 Creates a new instance of Structural Section Pipe Standard shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
WallDesignThickness
 Represents wall design thickness of rectangle.
WallNominalThickness
 Represents wall nominal thickness of rectangle.
See Also
StructuralSectionPipeStandard Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace