Revit 2017 API
StairsPath Methods
The StairsPath type exposes the following members.
Methods
Name | Description
Create
 Creates a new stairs path for the specified stairs with the specified stairs path type only in the plan view.
See Also
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace