Revit 2017 API
StructuralSectionCProfileWithLips Properties
The StructuralSectionCProfileWithLips type exposes the following members.
Properties
Name | Description
LipLength
 Lip segment length.
See Also
StructuralSectionCProfileWithLips Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace