Revit 2017 API
MechanicalSystem Properties
The MechanicalSystem type exposes the following members.
Properties
Name | Description
BaseEquipmentConnector
The connector within the base equipment which is used to connect with the system.
DuctNetwork
 The ducts and fittings contained within the system.
Flow |  Obsolete.
 The flow of this piping system
IsWellConnected
 Indicates if the system is well connected or not.
StaticPressure |  Obsolete.
 The static pressure of this piping system
SystemType
The type of this duct system.
See Also
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace