Revit 2017 API
NumberSystem Properties
The NumberSystem type exposes the following members.
Properties
Name | Description
JustifyOffset
 The offset to the justification curve.
JustifyOption
 The number justify option of number system.
NumberDisplayRule
 The display rule of the number system.
NumberedElementId
 The LinkElementId of the numbered host element.
NumberOrientation
 The number orientation of number system.
ReferenceOffset
 The offset to the reference curve.
See Also
NumberSystem Class
Autodesk.Revit.DB Namespace