Revit 2017 API
StructuralSectionZProfileWithLips Properties
The StructuralSectionZProfileWithLips type exposes the following members.
Properties
Name | Description
BottomFlangeLength
 Bottom Flange segment length.
LipLength
 Lip segment length.
See Also
StructuralSectionZProfileWithLips Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace