Revit 2017 API
RebarCoupler Methods
The RebarCoupler type exposes the following members.
Methods
Name | Description
CouplerLinkTwoBars
 returns true if the coupler sits on two rebar and false otherwise
Create
 Creates a new instance of a Rebar Coupler element within the project.
GetCoupledReinforcementData
 gets the reinforcement data. If coupler stays on one bar the list will have size = 1. If coupler connects two bars the size will be 2.
GetCouplerPositionTransform
 Return a transform representing the relative position of the coupler at index couplerPositionIndex in the set.
GetCouplerQuantity
 Identifies the number of couplers in a set.
GetPointsForPlacement
 gets the point (or points in case of rebar set) where the coupler is placed
See Also
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace