Revit 2017 API
DialogBoxShowingEventArgs Properties
The DialogBoxShowingEventArgs type exposes the following members.
Properties
Name | Description
DialogId
 A unique string identifier for DialogBox and TaskDialog type dialogs in Revit.
HelpId |  Obsolete.
 An ID that represents the dialog that has been displayed.
See Also
DialogBoxShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace