Revit 2017 API
Level Methods
The Level type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of level based on an input elevation.
GetPlaneReference
 Returns a reference to this element as a plane.
See Also
Level Class
Autodesk.Revit.DB Namespace