Revit 2017 API
FabricationService Methods
The FabricationService type exposes the following members.
Methods
Name | Description
Dispose
GetButton
 Gets the service button for a given group index and button index from the service.
GetButtonCount
 Gets the number of buttons for a given group in the service.
GetGroupName
 Gets the name of a group based on group index.
IsValidButtonIndex
 Validates the button index.
IsValidGroupIndex
 Validates the group index.
See Also
FabricationService Class
Autodesk.Revit.DB Namespace