Revit 2017 API
StructuralSectionPipeStandard Properties
The StructuralSectionPipeStandard type exposes the following members.
Properties
Name | Description
WallDesignThickness
 Represents wall design thickness of rectangle.
WallNominalThickness
 Represents wall nominal thickness of rectangle.
See Also
StructuralSectionPipeStandard Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace