Revit 2017 API
RebarConstraintsManager Methods
The RebarConstraintsManager type exposes the following members.
Methods
Name | Description
ClearHandleConstraintPairHighlighting
 Clears all highlighting in all views.
Dispose
GetAllConstrainedHandles
 Retrieves all handles on the Rebar that are constrained to external references.
GetConstraintCandidatesForHandle
 Returns all possible RebarConstraints that could be used for a specified RebarConstrainedHandle.
GetCurrentConstraintOnHandle
 Retrieves the RebarConstraint that acts on the specified RebarConstraintHandle.
GetPreferredConstraintOnHandle
 Returns the RebarConstraint that has been set as preferred for the specified RebarConstrainedHandle.
HasValidRebar
 Checks whether the Manager's Rebar is still valid.
HighlightHandleConstraintPairInAllViews
 Highlights the specified RebarConstrainedHandle and RebarConstraint in all views.
RemovePreferredConstraintFromHandle
 Clears the user-preferred RebarConstraint from the specified RebarConstrainedHandle.
SetPreferredConstraintForHandle
 Sets the RebarConstraint as preferred constraint target for the specified RebarConstrainedHandle.
See Also
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace