Revit 2017 API
FabricationPart Methods
The FabricationPart type exposes the following members.
Methods
Name | Description
AdjustEndLength
 Adjusts the length for the specified connector.
AlignPartByConnectors
 Moves fabrication part by one of its connectors and aligns it to another connector.
CanAdjustEndLength
 Checks if the end of fabrication part can be adjusted.
ConnectAndCouple
 Makes a connection between the specified connectors and adds coupling if necessary.
Create(Document, FabricationServiceButton, Int32, ElementId)
 Creates a fabrication part element based on button.
Create(Document, FabricationServiceButton, Double, Double, ElementId)
 Creates a fabrication part element based on button and size.
CreateHanger(Document, FabricationServiceButton, Int32, ElementId)
 Creates a free placed hanger.
CreateHanger(Document, FabricationServiceButton, ElementId, Connector, Double, Boolean)
 Creates a hanger on the fabrication part.
CreateHanger(Document, FabricationServiceButton, Int32, ElementId, Connector, Double, Boolean)
 Creates a hanger on the fabrication part.
GetCalculatedDimensionValue
 Gets the calculated dimension value.
GetDimensionCalculatedOptions
 Gets the calculated options of the fabrication dimension.
GetDimensions
 Gets all fabrication dimensions.
GetDimensionValue
 Gets the value of the fabrication dimension, returns value in Revit internal units.
GetHostedInfo
 Gets the fabrication hosted element information.
GetProductListEntryCount
 Gets the number of product entries for this part.
GetProductListEntryName
 Gets the specified product list entry name.
GetRodInfo
 Gets the fabrication rod information.
GetTransform
 Gets the transformation matrix of the fabrication part element.
IsAHanger
 Checks whether it is a hanger.
IsAStraight
 Checks whether it is a straight part.
IsATap
 Checks if it is any sort of tap.
IsDimensionCalculated
 Checks if the fabrication dimension is calculated.
IsProductList
 Gets whether or not the fabrication part is a product list.
IsProductListEntryCompatibleSize
 Checks to see if this part can be changed to the specified product entry without altering any connected dimensions.
OptimizeLengths
 Optimizes the length fabrication straight parts.
PlaceAsTap
 Places the part by its connector to a specific position on the straight part at the specified distance from the host part connector.
PlaceFittingAsCutIn
 Places the fitting on the straight part by cut in, use the fitting's focal point as the insertion position.
Reposition
 Repositions the fabrication straight part to another end of the run.
RotateConnectedPartByConnector
 Rotates a connected fabrication part around the axis of the specified connector.
RotateConnectedTap
 Rotates a connected fabrication tap by the specified angles about the primary and secondary axis.
SetCalculatedDimensionValue
 Sets the calculated dimension value.
SetDimensionValue
 Sets the fabrication dimension value. The value is in Revit internal units.
SetPositionByEnd
 Positions the connector of the fabrication part element by the passed point.
StretchAndFit
 Stretch the fabrication part from the specified connector and fit to the target routing end.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace