Revit 2017 API
StructuralSectionRoundHSS Properties
The StructuralSectionRoundHSS type exposes the following members.
Properties
Name | Description
WallDesignThickness
 Represents wall design thickness of pipe.
WallNominalThickness
 Represents wall nominal thickness of pipe.
See Also
StructuralSectionRoundHSS Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace