Revit 2017 API
StructuralSection Methods
The StructuralSection type exposes the following members.
Methods
Name | Description
Dispose
See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace