Revit 2017 API
PropertySetLibrary Methods
The PropertySetLibrary type exposes the following members.
Methods
Name | Description
AddPropertySet
 Adds a property set from the document to this library.
AddPropertySetWithName
 Adds a property set from the document to this library using an alternate name.
AddToDocument
 Adds a property set from a library to the document. The property set will be available for use even if the library is unloaded.
AddToDocumentWithName
 Adds a property set from a library to the document. The property set will be available for use even if the library is unloaded.
Create
 Creates a new property set library in the given document.
ExportXml
 Export this property set library to an external, XML-based file.
Find
 Finds an existing PropertySetLibrary with a given name.
GetName
 Gets the name of the property set library.
HasPropertySet
 Determines whether the library has a property set with a given name.
ImportXml
 Import an external property set library into a Revit document.
RemovePropertySet
 Removes a property set with a given name from the library.
RenamePropertySet
 Renames a property set in the library.
RenameSubclass
 Changes the subclass field of all property sets in this library from one value to another.
SetName
 Sets the name of the property set library.
See Also
PropertySetLibrary Class
Autodesk.Revit.DB Namespace