Revit 2017 API
StructuralSectionHotRolled Properties
The StructuralSectionHotRolled type exposes the following members.
Properties
Name | Description
FlangeThickness
 Flange Thickness.
WebFillet
 Web Fillet - fillet radius between web and flange.
WebThickness
 Web Thickness.
See Also
StructuralSectionHotRolled Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace