Revit 2017 API
NurbSpline Methods
The NurbSpline type exposes the following members.
Methods
Name | Description
Create(HermiteSpline)
 Creates a new geometric NurbSpline object from a HermiteSpline.
Create(IList<XYZ>, IList<Double>) |  Obsolete.
 Creates a new geometric NurbSpline object using the same calculations that Revit uses when sketching splines in the user interface.
Create(IList<XYZ>, IList<Double>, IList<Double>, Int32, Boolean, Boolean) |  Obsolete.
 Creates a new geometric NURBSpline object.
CreateCurve(HermiteSpline)
 Creates a new geometric Curve object by converting the given HermiteSpline. The created curve may be a NURBSpline or a simpler curve such as line or arc.
CreateCurve(IList<XYZ>, IList<Double>)
 Creates a new geometric Curve object from NURBS curve data containing just control points and weights. The created curve may be a NURBSpline or a simpler curve such as line or arc.
CreateCurve(Int32, IList<Double>, IList<XYZ>)
 Creates a new geometric Curve object from NURBS curve data, which does not include weights. The created curve may be a NURBSpline or a simpler curve such as line or arc.
CreateCurve(Int32, IList<Double>, IList<XYZ>, IList<Double>)
 Creates a new geometric Curve object from NURBS curve data, which includes weights. The created curve may be a NURBSpline or a simpler curve such as line or arc.
SetControlPointsAndWeights
Set the control points, weights simultaneously.
See Also
NurbSpline Class
Autodesk.Revit.DB Namespace