Revit 2017 API
RebarConstraint Methods
The RebarConstraint type exposes the following members.
Methods
Name | Description
Dispose
GetConstraintType
 Returns the RebarConstraintType of a RebarConstraint.
GetDistanceToTargetCover
 Returns the distance from the RebarConstrainedHandle to the target Host Cover Element surface. The RebarConstraintType of the RebarConstraint must be 'ToCover.'
GetDistanceToTargetHostFace
 Returns the distance from the RebarConstrainedHandle to the target Host Element surface. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace.'
GetRebarConstraintTargetHostFaceType
 Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.'
GetTargetElement
 Returns the Element object (either Host or Rebar) which provides the constraint.
GetTargetHostFaceReference
 Returns a reference to the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.'
GetTargetRebarAngleOnBarOrHookBend
 Returns the angular increment along a bar or hook bend to which the RebarConstraint is attached.
GetTargetRebarBendNumber
 Returns the number of the bend on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'BarBend.'
GetTargetRebarConstraintType
 Returns the TargetRebarConstraintType of the handle on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar.'
GetTargetRebarEdgeNumber
 Returns the number of the edge on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'Edge.'
GetTargetRebarHookBarEnd
 Returns 0 or 1 to indicate which end hook on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'HookBend.'
HasAnEdgeNumber
 Checks if the getTargetRebarEdgeNumber method can be called for the RebarConstraint.
IsEqual
 Returns true if the specified RebarConstraint is the same as 'this.' The method can be used to determine which of the RebarConstraint candidates offered by the RebarConstraintsManager is currently active.
IsFixedDistanceToHostFace
 Returns true if the RebarConstraintType of the RebarConstraint is 'FixedDistanceToHostFace.'
IsToCover
 Returns true if the RebarConstraintType of the RebarConstraint is 'ToCover.'
IsToHostFaceOrCover
 Returns true if the RebarConstraintType of the RebarConstraint is either 'FixedDistanceToHostFace' or 'ToCover.'
IsToOtherRebar
 Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar.'
IsValid
 Checks that the RebarConstraint still has access to valid Rebar constraint data and that its RebarConstraintsManager is still valid.
SetDistanceToTargetCover
 Sets the distance from the RebarConstrainedHandle to the target Host Cover Element surface. The RebarConstraintType of the RebarConstraint must be 'ToCover.'
SetDistanceToTargetHostFace
 Sets the distance from the RebarConstrainedHandle to the target Host Element surface. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace.'
TargetIsBarBend
 Returns true if the RebarTargetConstraintType of the RebarConstraint is 'BarBend'
TargetIsHookBend
 Returns true if the RebarTargetConstraintType of the RebarConstraint is 'HookBend'
TargetRebarConstraintTypeIsEdge
 Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar,' and the RebarConstraint is attached to an edge of the other Rebar Element.
See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace