Revit 2017 API
WallFoundation Members
The WallFoundation type exposes the following members.
Methods
Name | Description
Create
 Creates a new wall foundation within the project.
GetFoundationType |  Obsolete.
 Gets an object that represents the type of the foundation.
SetFoundationType |  Obsolete.
 Sets an object that represents the type of the foundation.
Properties
Name | Description
WallId
 Returns the id of the host wall.
See Also
WallFoundation Class
Autodesk.Revit.DB Namespace