Revit 2017 API
StructuralSectionRectangleHSS Members
The StructuralSectionRectangleHSS type exposes the following members.
Constructors
Name | Description
StructuralSectionRectangleHSS
 Creates a new instance of Structural Section Rectangle HSS shape with the associated set of parameters, used to attach to structural element.
Methods
Name | Description
Properties
Name | Description
InnerFillet
 Inner Fillet - Corner fillet inner radius.
OuterFillet
 Outer Fillet - Corner fillet outer radius.
WallDesignThickness
 Represents wall design thickness of rectangle.
WallNominalThickness
 Represents wall nominal thickness of rectangle.
See Also
StructuralSectionRectangleHSS Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace