Revit 2017 API
ElectricalSystem Members
The ElectricalSystem type exposes the following members.
Methods
Name | Description
AddToCircuit
Add a set of exist components to the Electrical System.
DisconnectPanel
Disconnect the panel for the Electrical System.
NewWires
 Create a bunch of wires for the electrical system.
RemoveFromCircuit
remove a set of exist components from the Electrical System.
SelectPanel
Set the panel for the Electrical System.
Properties
Name | Description
ApparentCurrent
Returns the ApparentCurrent value of the Electrical System.
ApparentCurrentPhaseA
Returns the ApparentCurrentPhaseA value of the Electrical System.
ApparentCurrentPhaseB
Returns the ApparentCurrentPhaseB value of the Electrical System.
ApparentCurrentPhaseC
Returns the ApparentCurrentPhaseC value of the Electrical System.
ApparentLoad
Returns the ApparentLoad value of the Electrical System.
ApparentLoadPhaseA
Returns the ApparentLoadPhaseA value of the Electrical System.
ApparentLoadPhaseB
Returns the ApparentLoadPhaseB value of the Electrical System.
ApparentLoadPhaseC
Returns the ApparentLoadPhaseC value of the Electrical System.
BalancedLoad
Reports whether the BalancedLoad is on or off.
CircuitNumber
Returns the CircuitNumber of the Electrical System.
CircuitType
Get the circuit type of the Electrical System.
GroundConductorsNumber
Returns the GroundConductors Number of the Electrical System.
HotConductorsNumber
Returns the HotConductors Number of the Electrical System.
Length
Returns the Length value of the Electrical System.
LoadClassifications
Returns the LoadClassifications used in the Electrical System.
LoadName
Get/Set the LoadName of the Electrical System.
Name
Returns the Name of the Electrical System.
 (Overrides Element.Name.)
NeutralConductorsNumber
Returns the NeutralConductors Number of the Electrical System.
PanelName
Returns the Panel name of the Electrical System.
PolesNumber
Returns the Poles Number of the Electrical System.
PowerFactor
Returns the PowerFactor value of the Electrical System.
PowerFactorState
Returns the PowerFactorState type of the Electrical System.
Rating
Get/Set the Rating value of the Electrical System.
RunsNumber
Returns the Runs Number of the Electrical System.
StartSlot
Get/Set the Start Slot where the Electrical System is located in its panel.
SystemType
Returns the Electrical System Type of the Electrical System.
TrueCurrent
Returns the TrueCurrent value of the Electrical System.
TrueCurrentPhaseA
Returns the TrueCurrentPhaseA value of the Electrical System.
TrueCurrentPhaseB
Returns the TrueCurrentPhaseB value of the Electrical System.
TrueCurrentPhaseC
Returns the TrueCurrentPhaseC value of the Electrical System.
TrueLoad
Returns the TrueLoad value of the Electrical System.
TrueLoadPhaseA
Returns the TrueLoadPhaseA value of the Electrical System.
TrueLoadPhaseB
Returns the TrueLoadPhaseB value of the Electrical System.
TrueLoadPhaseC
Returns the TrueLoadPhaseC value of the Electrical System.
Voltage
Returns the Voltage value of the Electrical System.
VoltageDrop
Returns the VoltageDrop value of the Electrical System.
WireSizeString
Returns the WireSize as a String of the Electrical System.
WireType
Get/Set the wire type of the Electrical System.
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace