Revit 2017 API
PipeType Properties
The PipeType type exposes the following members.
Properties
Name | Description
Class |  Obsolete.
The schedule type of the pipe type.
See Also
PipeType Class
Autodesk.Revit.DB.Plumbing Namespace