Revit 2017 API
StructuralSectionRectangleHSS Properties
The StructuralSectionRectangleHSS type exposes the following members.
Properties
Name | Description
InnerFillet
 Inner Fillet - Corner fillet inner radius.
OuterFillet
 Outer Fillet - Corner fillet outer radius.
WallDesignThickness
 Represents wall design thickness of rectangle.
WallNominalThickness
 Represents wall nominal thickness of rectangle.
See Also
StructuralSectionRectangleHSS Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace