Revit 2017 API
IExternalResourceUIServer Methods
The IExternalResourceUIServer type exposes the following members.
Methods
Name | Description
GetDBServerId
 Implement this method to return the id of the server which is associated with this UI server.
HandleBrowseResult
 Implement this method to handle browsing external resources operation result.
HandleLoadResourceResults
See Also
IExternalResourceUIServer Interface
Autodesk.Revit.UI Namespace