Revit 2017 API
SiteLocation Properties
The SiteLocation type exposes the following members.
Properties
Name | Description
Elevation
The Elevation of the site location.
Latitude
The latitude of the site location.
Longitude
The longitude of the site location.
PlaceName
The place name of the site.
TimeZone
Time-zone that contains the site
WeatherStationName
The name of the weather station at the site location.
See Also
SiteLocation Class
Autodesk.Revit.DB Namespace