Revit 2017 API
StructuralSectionRound Properties
The StructuralSectionRound type exposes the following members.
Properties
Name | Description
CentroidHorizontal
 Distance from centroid to the left extremites along horizontal axis.
CentroidVertical
 Distance from centroid to the upper extremites along vertical axis.
Diameter
 Pipe Diameter.
ElasticModulusStrongAxis
 Elastic section modulus about main strong axis for calculation of bending stresses.
ElasticModulusWeakAxis
 Elastic section modulus about main weak axis for calculation of bending stresses.
MomentOfInertiaStrongAxis
 Moment of Inertia about main strong axis (I).
MomentOfInertiaWeakAxis
 Moment of Inertia about main weak axis (I).
NameKey
 Name Key
NominalWeight
 Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
Perimeter
 Painting surface of the unit length.
PlasticModulusStrongAxis
 Plastic section modulus in bending about main strong axis (Z, Wpl)
PlasticModulusWeakAxis
 Plastic section modulus in bending about main weak axis.
PrincipalAxesAngle
 Rotation angle between the principal axes and cross section reference planes.
SectionArea
 Cross section area.
ShearAreaStrongAxis
 Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
ShearAreaWeakAxis
 Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
TorsionalModulus
 Section modulus for calculations of torsion stresses (Ct)
TorsionalMomentOfInertia
 Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
WarpingConstant
 Warping constant (Cw, Iomega, H)
See Also
StructuralSectionRound Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace