Revit 2017 API
BasePoint Members
The BasePoint type exposes the following members.
Methods
Name | Description
Properties
Name | Description
IsShared
Indicates whether the base point is shared.
See Also
BasePoint Class
Autodesk.Revit.DB Namespace