Revit 2017 API
SpatialElementTag Properties
The SpatialElementTag type exposes the following members.
Properties
Name | Description
HasLeader
Identifies if a leader is displayed for the tag or not.
IsOrphaned
Identifies if the tag is orphaned or not.
IsTaggingLink
Identifies if the tag has reference to an object in a linked document or not.
LeaderElbow
The position of the leader's elbow (middle point).
LeaderEnd
The position of the leader's end.
Location
The location of the tag.
 (Overrides Element.Location.)
Name
The name associated with the tag.
 (Overrides Element.Name.)
TagHeadPosition
The position of the tag's head.
TagOrientation
The orientation of the tag.
View
The view in which the tag was placed.
See Also
SpatialElementTag Class
Autodesk.Revit.DB Namespace