Revit 2017 API
RebarConstraintsManager Members
The RebarConstraintsManager type exposes the following members.
Methods
Name | Description
ClearHandleConstraintPairHighlighting
 Clears all highlighting in all views.
Dispose
Releases all resources used by the RebarConstraintsManager
GetAllConstrainedHandles
 Retrieves all handles on the Rebar that are constrained to external references.
GetConstraintCandidatesForHandle
 Returns all possible RebarConstraints that could be used for a specified RebarConstrainedHandle.
GetCurrentConstraintOnHandle
 Retrieves the RebarConstraint that acts on the specified RebarConstraintHandle.
GetPreferredConstraintOnHandle
 Returns the RebarConstraint that has been set as preferred for the specified RebarConstrainedHandle.
HasValidRebar
 Checks whether the Manager's Rebar is still valid.
HighlightHandleConstraintPairInAllViews
 Highlights the specified RebarConstrainedHandle and RebarConstraint in all views.
RemovePreferredConstraintFromHandle
 Clears the user-preferred RebarConstraint from the specified RebarConstrainedHandle.
SetPreferredConstraintForHandle
 Sets the RebarConstraint as preferred constraint target for the specified RebarConstrainedHandle.
Properties
Name | Description
IsRebarConstrainedPlacementEnabled
 A static property defining if the 'Rebar Constrained Placement' setting is on or off in current Revit Application Session.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace