Revit 2017 API
ImportInstance Members
The ImportInstance type exposes the following members.
Methods
Name | Description
GetVisibility
Gets the visibility for the import instance in a family document.
SetVisibility
Sets the visibility for the import instance in a family document.
Properties
Name | Description
IsLinked
Identifies whether this instance is a linked object rather than imported one.
See Also
ImportInstance Class
Autodesk.Revit.DB Namespace