Revit 2017 API
Railing Methods
The Railing type exposes the following members.
Methods
Name | Description
Create(Document, CurveLoop, ElementId, ElementId)
 Creates a new railing by specifying the railing path in the project document.
Create(Document, ElementId, ElementId, RailingPlacementPosition)
 Automatically creates new railings with the specified railing type on all sides of a stairs or ramp element.
Flip
 Flips the railing.
GetHandRails
 Get all the handrails of the railing.
GetPath
 Gets the railing path.
IsValidHostForNewRailing
 Checks whether new railing can be created and placed on the specified host.
RailingCanBeHostedByElement
 Checks whether the specified element can be used as a host for the railing. The host can be a stairs, ramp, floor, slab edge, wall or roof.
RemoveHost
 Removes the association between the railing and its host.
Reset
 Resets the railing to the default one that the system generates.
SetPath
 Sets the railing path.
See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace