Revit 2017 API
FabricationHostedInfo Methods
The FabricationHostedInfo type exposes the following members.
Methods
Name | Description
DisconnectFromHost
 Disconnects the part from the host.
Dispose
GetBearerCenterline
 Gets the centerline of the bearer. The method is applicable only for bearer hanger.
PlaceOnHost
 Places the part on the specified host.
See Also
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace