Revit 2016 API
SkyBackgroundSettings Members
The SkyBackgroundSettings type exposes the following members.
Methods
Name | Description
Properties
Name | Description
VisibilityDistance
 The visibility distance of sky background.
See Also
SkyBackgroundSettings Class
Autodesk.Revit.DB Namespace