Revit 2016 API
Pipe Properties
The Pipe type exposes the following members.
Properties
Name | Description
FlowState
The flow state of the pipe.
IsPlaceholder
 Identifies if the pipe is a placeholder or not.
PipeType
 The pipe type of this pipe.
See Also
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace