Revit 2016 API
AreaLoad Members
The AreaLoad type exposes the following members.
Methods
Name | Description
Create(Document, AnalyticalModelSurface, XYZ, AreaLoadType)
 Creates a new hosted area load within the project.
Create(Document, IList<CurveLoop>, XYZ, AreaLoadType)
 Creates a new non-hosted area load within the project.
Create(Document, IList<CurveLoop>, IList<XYZ>, IList<Int32>, IList<Int32>, AreaLoadType)
 Creates a new non-hosted area load within the project.
GetLoops
 Returns curve loops that define geometry of the area load.
GetRefPoint
 Returns the physical location of the reference point.
SetLoops
 Sets curve loops that define geometry of the area load.
Properties
Name | Description
Area
 Returns area of the area load.
Curve |  Obsolete.
Returns the geometric curve within a geometric loop that defines the area.
Force |  Obsolete.
Returns the three dimensional force applied to one of the points for the area load.
Force1 |  Obsolete.
 Returns the three dimensional force applied to the 1st reference point of the area load.
Force2 |  Obsolete.
 Returns the three dimensional force applied to the 2nd reference point of the area load.
Force3 |  Obsolete.
 Returns the three dimensional force applied to the 3rd reference point of the area load.
ForceVector1
 The force vector applied to the 1st reference point of the area load, oriented according to OrientTo setting.
ForceVector2
 The force vector applied to the 2nd reference point of the area load, oriented according to OrientTo setting.
ForceVector3
 The force vector applied to the 3rd reference point of the area load, oriented according to OrientTo setting.
IsProjected
 Indicates if the load is projected.
NumCurves |  Obsolete.
Returns the number of curves within a geometric loop that defines the area.
NumLoops |  Obsolete.
 Returns the number of geometric curve loops that define the area.
NumRefPoints
 Returns the total number of reference points for the area load.
RefPoint |  Obsolete.
Retrieve the physical location of the reference point.
See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace