Revit 2016 API
LoadUsageArrayIterator Members
The LoadUsageArrayIterator type exposes the following members.
Constructors
Name | Description
LoadUsageArrayIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
LoadUsageArrayIterator Class
Autodesk.Revit.DB.Structure Namespace