Revit 2016 API
ObjectFactory Methods
The ObjectFactory type exposes the following members.
Methods
Name | Description
Dispose
For Internal Use Only.
See Also
ObjectFactory Class
Autodesk.Revit.DB Namespace