Revit 2016 API
RevitCommandId Members
The RevitCommandId type exposes the following members.
Methods
Name | Description
LookupCommandId
 Looks up and retrieves the Revit command id with the given id string.
LookupPostableCommandId
 Looks up and retrieves the Revit command id with the given id string.
Properties
Name | Description
CanHaveBinding
 Indicates whether the command can be assigned a binding to an external add-in..
HasBinding
 Indicates whether a replacement of either the Execute or CanExecute events (or both) have been applied to this command.
Id
 The command id.
Name
 The command name.
See Also
RevitCommandId Class
Autodesk.Revit.UI Namespace