Revit 2016 API
DGNExportOptions Methods
The DGNExportOptions type exposes the following members.
Methods
Name | Description
GetExportLineweightTable
 Gets a copy of the line weight table.
GetPredefinedOptions
 Returns an instance DGNExportOptions containing settings from a predefined export setup.
SetExportLineweightTable
 Sets the line weight table to use during export.
See Also
DGNExportOptions Class
Autodesk.Revit.DB Namespace