Revit 2016 API
PipeSettings Properties
The PipeSettings type exposes the following members.
Properties
Name | Description
ConnectorSeparator
 The connector separator string.
ConnectorTolerance
 The connector tolerance value.
FittingAngleUsage
 Determine how to use fitting angle during pipe layout or modifying layout.
FittingAnnotationSize
 The value of fitting annotation size.
SizePrefix
 The size prefix string.
SizeSuffix
 The size suffix string.
UseAnnotationScaleForSingleLineFittings
 Indicates whether use annotation scale for single line fittings or not.
See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace