Revit 2016 API
AreaLoad Properties
The AreaLoad type exposes the following members.
Properties
Name | Description
Area
 Returns area of the area load.
Curve |  Obsolete.
Returns the geometric curve within a geometric loop that defines the area.
Force |  Obsolete.
Returns the three dimensional force applied to one of the points for the area load.
Force1 |  Obsolete.
 Returns the three dimensional force applied to the 1st reference point of the area load.
Force2 |  Obsolete.
 Returns the three dimensional force applied to the 2nd reference point of the area load.
Force3 |  Obsolete.
 Returns the three dimensional force applied to the 3rd reference point of the area load.
ForceVector1
 The force vector applied to the 1st reference point of the area load, oriented according to OrientTo setting.
ForceVector2
 The force vector applied to the 2nd reference point of the area load, oriented according to OrientTo setting.
ForceVector3
 The force vector applied to the 3rd reference point of the area load, oriented according to OrientTo setting.
IsProjected
 Indicates if the load is projected.
NumCurves |  Obsolete.
Returns the number of curves within a geometric loop that defines the area.
NumLoops |  Obsolete.
 Returns the number of geometric curve loops that define the area.
NumRefPoints
 Returns the total number of reference points for the area load.
RefPoint |  Obsolete.
Retrieve the physical location of the reference point.
See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace