Revit 2016 API
DocumentPrintingEventArgs Methods
The DocumentPrintingEventArgs type exposes the following members.
Methods
Name | Description
GetViewElementIds
 Returns ElementIds of the views to be printed.
See Also
DocumentPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace