Revit 2016 API
LoadCaseSet Methods
The LoadCaseSet type exposes the following members.
Methods
Name | Description
Clear
Contains
Erase
ForwardIterator
GetEnumerator
Insert
ReverseIterator
See Also
LoadCaseSet Class
Autodesk.Revit.DB.Structure Namespace