Revit 2016 API
Level Properties
The Level type exposes the following members.
Properties
Name | Description
Elevation
 Retrieves or changes the elevation above or below the ground level.
LevelType |  Obsolete.
 The level style of this level.
PlaneReference |  Obsolete.
Returns a reference to this element as a plane.
ProjectElevation
 Retrieves the elevation relative to project origin, no matter what values of the Elevation Base parameter is set.
See Also
Level Class
Autodesk.Revit.DB Namespace