Revit 2016 API
LoadCase Properties
The LoadCase type exposes the following members.
Properties
Name | Description
NatureCategory
 The nature category of the load case.
NatureId
 The nature of the load case.
Number
 Returns the load case number.
See Also
LoadCase Class
Autodesk.Revit.DB.Structure Namespace