Revit 2016 API
FabricSheet Methods
The FabricSheet type exposes the following members.
Methods
Name | Description
Create(Document, Element, ElementId)
 Creates a new instance of a single flat Fabric Sheet element within the project.
Create(Document, ElementId, ElementId, CurveLoop)
 Creates a new instance of a single bent Fabric Sheet element within the project.
GetBendProfile
 Returns the profile (not including generated fillets) that defines the shape of the Fabric Sheet bending.
GetBendProfileWithFillets
 Returns the profile with generated fillets that defines the shape of the Fabric Sheet bending.
GetReinforcementRoundingManager
 Returns an object for managing reinforcement rounding override settings.
GetSheetLocation
 Gets the position and the orientation of the Fabric Sheet instance.
GetWireCenterlines()
 Gets a list of curves representing the wires centerlines of the Fabric Sheet in the both distribution directions.
GetWireCenterlines(WireDistributionDirection)
 Gets a list of curves representing the wires centerlines of the Fabric Sheet.
IsCoverOffsetValid
 Identifies if the specified value is valid for use as a cover offset.
IsSingleFabricSheetWithinHost
 Identifies if the specified single Fabric Sheet position is within the host.
IsValidHost(Element)
 Checks whether an element is a valid host for fabric sheet.
IsValidHost(Document, ElementId)
 Checks whether an element is a valid host for fabric sheet.
PlaceInHost
 Inserts the single Fabric Sheet instance into the host element.
SetBendProfile
 Sets new profile that defines the shape of the Fabric Sheet bending.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace