Revit 2016 API
BaseImportOptions Methods
The BaseImportOptions type exposes the following members.
Methods
Name | Description
Dispose
GetLayerSelection
 Get all set layers name which user want to import into Revit.
GetRefPoint |  Obsolete.
 Gets the 3D point in the document where the imported instance will be inserted.
SetLayerSelection
 Set the layers name which user want to import into Revit.
SetRefPoint |  Obsolete.
 Sets the 3D point in the document where the imported instance will be inserted. If not explicitly set, the instance will be inserted at the document origin.
See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace