Revit 2016 API
LoadCaseArrayIterator Properties
The LoadCaseArrayIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
LoadCaseArrayIterator Class
Autodesk.Revit.DB.Structure Namespace