Revit 2016 API
RenderingQualitySettings Methods
The RenderingQualitySettings type exposes the following members.
Methods
Name | Description
Dispose
See Also
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace