Revit 2016 API
DuctFittingAndAccessoryConnectorData Methods
The DuctFittingAndAccessoryConnectorData type exposes the following members.
Methods
Name | Description
Dispose
See Also
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace