Revit 2016 API
AnnotationSymbol Properties
The AnnotationSymbol type exposes the following members.
Properties
Name | Description
AnnotationSymbolType
 The AnnotationSymbol style of this AnnotationSymbol.
Leaders |  Obsolete.
Retrieves all leaders currently attached to the annotation symbol.
See Also
AnnotationSymbol Class
Autodesk.Revit.DB Namespace