Revit 2016 API
LoadCombinationArrayIterator Members
The LoadCombinationArrayIterator type exposes the following members.
Constructors
Name | Description
LoadCombinationArrayIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
LoadCombinationArrayIterator Class
Autodesk.Revit.DB.Structure Namespace