Revit 2016 API
TextNode Methods
The TextNode type exposes the following members.
Methods
Name | Description
GetFormattedTextRuns
 Returns a list of separated runs of formated text.
See Also
TextNode Class
Autodesk.Revit.DB Namespace