Revit 2016 API
LineLoad Members
The LineLoad type exposes the following members.
Methods
Name | Description
Create(Document, AnalyticalModelStick, XYZ, XYZ, LineLoadType)
 Creates a new hosted line load within the project.
Create(Document, AnalyticalModelSurface, Int32, XYZ, XYZ, LineLoadType)
 Creates a new hosted line load within the project.
Create(Document, XYZ, XYZ, XYZ, XYZ, LineLoadType, SketchPlane)
 Creates a new non-hosted line load within the project using data at point.
GetCurve
 Returns curve that define geometry of the line load.
SetPoints
 Sets start and end point of the line load.
Properties
Name | Description
EndPoint
 Returns the three dimensional location of the end point for the line load.
Force |  Obsolete.
Returns the three dimensional force applied to one of the points for the line load.
Force1 |  Obsolete.
 Returns the three dimensional force applied to the start point of the line load.
Force2 |  Obsolete.
 Returns the three dimensional force applied to the end point of the line load.
ForceVector1
 The force vector applied to the start point of the line load, oriented according to OrientTo setting.
ForceVector2
 The force vector applied to the end point of the line load, oriented according to OrientTo setting.
IsProjected
 Indicates if the load is projected.
IsUniform
 Indicates if the load is uniform.
Moment |  Obsolete.
Returns the three dimensional moment applied to one of the points for the line load.
Moment1 |  Obsolete.
 Returns the three dimensional moment applied to the start point of the line load.
Moment2 |  Obsolete.
 Returns the three dimensional moment applied to the end point of the line load.
MomentVector1
 The moment vector applied to the start point of the line load, oriented according to OrientTo setting.
MomentVector2
 The moment vector applied to the end point of the line load, oriented according to OrientTo setting.
Point |  Obsolete.
Returns the three dimensional location of one of the points for the line load.
ProjectedLoad |  Obsolete.
 Indicates if the load is projected.
StartPoint
 Returns the three dimensional location of the start point for the line load.
UniformLoad |  Obsolete.
 Indicates if the load is uniform.
See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace