Revit 2016 API
LoadUsageArray Properties
The LoadUsageArray type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets an load usage at a specified index within the array.
Size
Returns the number of load usages that are in the array.
See Also
LoadUsageArray Class
Autodesk.Revit.DB.Structure Namespace