Revit 2016 API
DocumentPrintingEventArgs Members
The DocumentPrintingEventArgs type exposes the following members.
Methods
Name | Description
GetViewElementIds
 Returns ElementIds of the views to be printed.
Properties
Name | Description
Settings
 The print settings of the active printing session.
See Also
DocumentPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace