Revit 2016 API
LoadCombinationArray Methods
The LoadCombinationArray type exposes the following members.
Methods
Name | Description
Append
Clear
Removes every item from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
ReverseIterator
Retrieve a backward moving iterator to the array.
See Also
LoadCombinationArray Class
Autodesk.Revit.DB.Structure Namespace