Revit 2016 API
FabricationPart Properties
The FabricationPart type exposes the following members.
Properties
Name | Description
ConnectorManager
 The connector manager of the fabrication part.
DomainType
 The domain type for the fabrication part.
InsulationSpecification
 The fabrication part insulation specification identifier.
LevelOffset
 The associated level offset that indicates the distance from the center of the fabrication part to the current level.
Material
 The fabrication material identifier.
Origin
 The origin of the fabrication part element.
ProductCode
 The current database id of the part within the fabrication database.
ProductListEntry
 The product list entry index of the fabrication part. A value of -1 indicates the fabrication part is not a product list entry.
ServiceId
 The fabrication part service identifier.
Specification
 The fabrication part specification identifier.
ValidationStatus
 The validation status of the fabrication part.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace