Revit 2016 API
TessellatedShapeBuilder Methods
The TessellatedShapeBuilder type exposes the following members.
Methods
Name | Description
AddFace
 Adds a face to the currently open connected face set.
AreTargetAndFallbackCompatible
 Checks whether this combination of fallback and target parameters can be used as a valid combination of inputs.
Build
 Builds the designated geometrical objects from the stored face sets.
CancelConnectedFaceSet
 Cancels the current face set - i.e., all data from it will be lost and the builder will have no open connected face set anymore.
Clear
 Erases all face set and clears the logs, if any.
CloseConnectedFaceSet
 Closes the currently open connected face set.
CreateMeshByExtrusion
 Builds a mesh by extruding curve loop(s) along extrusion distance.
Dispose
DoesFaceHaveEnoughLoopsAndVertices
 Checks whether 'face' has enough loops and vertcies to be valid.
OpenConnectedFaceSet
 Opens a new connected face set.
See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace