Revit 2016 API
ViewPrintingEventArgs Members
The ViewPrintingEventArgs type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Index
 The index of the view being printed out of the set of all views being printed.
Settings
 The print settings of the active printing session.
TotalViews
 The number of all views being printed.
View
 The view to be printed.
See Also
ViewPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace