Revit 2016 API
Document Methods
The Document type exposes the following members.
Methods
Name | Description
NewArea
Creates a new area
NewAreaBoundaryConditions(Element, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double)
 Creates a new Area BoundaryConditions element on a host element.
NewAreaBoundaryConditions(Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double)
 Creates a new Area BoundaryConditions element on a reference.
NewAreaBoundaryLine
Creates a new boundary line as an Area border.
NewAreaLoad(Element, XYZ, Boolean, AreaLoadType) |  Obsolete.
Creates a new uniform hosted area load with polygonal shape within the project.
NewAreaLoad(IList<XYZ>, XYZ, Boolean, AreaLoadType) |  Obsolete.
Creates a new uniform unhosted area load with polygonal shape within the project.
NewAreaLoad(CurveArray, Int32[], Int32[], IList<XYZ>, Boolean, AreaLoadType) |  Obsolete.
Creates a new unhosted area load with variable forces at the vertices within the project.
NewAreaLoad(CurveArray, Int32[], Int32[], XYZ, XYZ, XYZ, Boolean, AreaLoadType) |  Obsolete.
Creates a new unhosted area load with variable forces at the vertices within the project.
NewAreas
Creates new areas
NewAreaTag
Creates a new area tag.
NewCrossFitting
Add a new family instance of a cross fitting into the Autodesk Revit document, using four connectors.
NewCurtainSystem
Creates a new CurtainSystem element from a set of faces.
NewCurtainSystem2
Creates a new CurtainSystem element from a set of face references.
NewDuct(Connector, Connector, DuctType)
Adds a new duct into the document, using two connectors and duct type.
NewDuct(XYZ, Connector, DuctType)
Adds a new duct into the document, using a point, connector and duct type.
NewDuct(XYZ, XYZ, DuctType)
Adds a new duct into the document, using two points and duct type.
NewElbowFitting
Add a new family instance of an elbow fitting into the Autodesk Revit document, using two connectors.
NewElectricalSystem(Connector, ElectricalSystemType)
Creates a new MEP Electrical System element from an unused Connector.
NewElectricalSystem(ICollection<ElementId>, ElectricalSystemType)
Creates a new MEP Electrical System element from a set of electrical components.
NewExtrusionRoof
Creates a new Extrusion Roof.
NewFamilyInstance(Curve, FamilySymbol, Level, StructuralType)
Inserts a new instance of a family into the document, using a curve, type/symbol and reference level.
NewFamilyInstance(XYZ, FamilySymbol, Level, StructuralType)
Inserts a new instance of a family into the document, using a location, type/symbol and a base level.
NewFamilyInstance(XYZ, FamilySymbol, Element, Level, StructuralType)
Inserts a new instance of a family into the document, using a location, type/symbol, the host element and a base level.
NewFascia(FasciaType, Reference)
Creates a fascia along a reference.
NewFascia(FasciaType, ReferenceArray)
Creates a fascia along a reference array.
NewFlexDuct(IList<XYZ>, FlexDuctType)
Adds a new flexible duct into the document, using a point array and duct type.
NewFlexDuct(Connector, Connector, FlexDuctType)
Adds a new flexible duct into the document, using two connector, and duct type.
NewFlexDuct(Connector, IList<XYZ>, FlexDuctType)
Adds a new flexible duct into the document, using a connector, point array and duct type.
NewFlexPipe(IList<XYZ>, FlexPipeType)
Adds a new flexible pipe into the document, using a point array and pipe type.
NewFlexPipe(Connector, Connector, FlexPipeType)
Adds a new flexible pipe into the document, using two connector, and flexible pipe type.
NewFlexPipe(Connector, IList<XYZ>, FlexPipeType)
Adds a new flexible pipe into the document, using a connector, point array and pipe type.
NewFloor(CurveArray, Boolean)
 Creates a floor within the project with the given horizontal profile using the default floor style.
NewFloor(CurveArray, FloorType, Level, Boolean)
 Creates a floor within the project with the given horizontal profile and floor style on the specified level.
NewFloor(CurveArray, FloorType, Level, Boolean, XYZ)
 Creates a floor within the project with the given horizontal profile and floor style on the specified level with the specified normal vector.
NewFootPrintRoof
Creates a new FootPrintRoof element.
NewFoundationSlab
 Creates a foundation slab within the project with the given horizontal profile and floor style on the specified level.
NewFoundationWall
Creates a new wall foundation object.
NewGrid(Arc) |  Obsolete.
 Creates a new radial grid line.
NewGrid(Line) |  Obsolete.
 Creates a new linear grid line.
NewGrids |  Obsolete.
Creates new grid lines.
NewGutter(GutterType, Reference)
Creates a gutter along a reference.
NewGutter(GutterType, ReferenceArray)
Creates a gutter along a reference array.
NewLineBoundaryConditions(Element, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double)
 Creates a new Line BoundaryConditions element on a host element.
NewLineBoundaryConditions(Reference, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double)
 Creates a new Line BoundaryConditions element on a reference.
NewLineLoad(Element, IList<XYZ>, IList<XYZ>, Boolean, Boolean, Boolean, LineLoadType, SketchPlane) |  Obsolete.
Creates a new hosted line load within the project using data at two points.
NewLineLoad(Reference, IList<XYZ>, IList<XYZ>, Boolean, Boolean, Boolean, LineLoadType, SketchPlane) |  Obsolete.
Creates a new hosted line load within the project using data at an array of points.
NewLineLoad(IList<XYZ>, IList<XYZ>, IList<XYZ>, Boolean, Boolean, Boolean, LineLoadType, SketchPlane) |  Obsolete.
Creates a new unhosted line load within the project using data at an array of points.
NewLineLoad(XYZ, XYZ, XYZ, XYZ, XYZ, XYZ, Boolean, Boolean, Boolean, LineLoadType, SketchPlane) |  Obsolete.
Creates a new unhosted line load within the project using data at two points.
NewLoadCase |  Obsolete.
Creates a new instance of a LoadCase element within the project.
NewLoadCombination |  Obsolete.
Creates a new instance of a LoadCombination element within the project.
NewLoadNature |  Obsolete.
Creates a new instance of a LoadNature element within the project.
NewLoadUsage |  Obsolete.
Creates a new instance of a LoadUsage element within the project.
NewMechanicalSystem
Creates a new MEP mechanical system element.
NewOpening(Element, CurveArray, eRefFace)
 Creates a new opening in a beam, brace and column.
NewOpening(Element, CurveArray, Boolean)
 Creates a new opening in a roof, floor and ceiling.
NewOpening(Level, Level, CurveArray)
 Creates a new shaft opening between a set of levels.
NewOpening(Wall, XYZ, XYZ)
 Creates a rectangular opening on a wall.
NewPipingSystem
Creates a new MEP piping system element.
NewPointBoundaryConditions
 Creates a new Point BoundaryConditions Element.
NewPointLoad(Reference, XYZ, XYZ, Boolean, PointLoadType, SketchPlane) |  Obsolete.
Creates a new hosted point load within the project.
NewPointLoad(XYZ, XYZ, XYZ, Boolean, PointLoadType, SketchPlane) |  Obsolete.
Creates a new unhosted point load within the project.
NewRoom(Phase)
 Creates a new unplaced room and with an assigned phase.
NewRoom(Level, UV)
 Creates a new room on a level at a specified point.
NewRoom(Room, PlanCircuit)
 Creates a new room within the confines of a plan circuit, or places an unplaced room within the confines of the plan circuit.
NewRoomBoundaryLines
Creates a new boundary line as an Room border.
NewRooms2(Level)
 Creates new rooms in each plan circuit found in the given level in the last phase.
NewRooms2(Level, Phase)
 Creates new rooms in each plan circuit found in the given level in the given phase.
NewRooms2(Phase, Int32)
 Creates new unplaced rooms in the given phase.
NewRoomTag
 Creates a new RoomTag referencing a room in the host model or in a Revit link.
NewSlab
 Creates a slab within the project with the given horizontal profile using the default floor style.
NewSlabEdge(SlabEdgeType, Reference)
Creates a slab edge along a reference.
NewSlabEdge(SlabEdgeType, ReferenceArray)
Creates a slab edge along a reference array.
NewSpace(Phase)
 Creates a new unplaced space on a given phase.
NewSpace(Level, UV)
Creates a new space element on the given level at the given location.
NewSpace(Level, Phase, UV)
Creates a new space element on the given level, at the given location, and assigned to the given phase.
NewSpaceBoundaryLines
Creates a new boundary line as an Space border.
NewSpaces2(Phase, Int32)
 Creates a set of new unplaced spaces on a given phase.
NewSpaces2(Level, Phase, View)
 Creates new spaces on the available plan circuits of a the given level.
NewSpaceTag
 Creates a new SpaceTag.
NewSpotCoordinate
 Generate a new spot coordinate object within the project.
NewSpotElevation
 Generate a new spot elevation object within the project.
NewTag
 Creates a new IndependentTag Element.
NewTakeoffFitting
Add a new family instance of an takeoff fitting into the Autodesk Revit document, using one connector and one MEP curve.
NewTeeFitting
Add a new family instance of a tee fitting into the Autodesk Revit document, using three connectors.
NewTransitionFitting
Add a new family instance of an transition fitting into the Autodesk Revit document, using two connectors.
NewUnionFitting
Add a new family instance of an union fitting into the Autodesk Revit document, using two connectors.
NewZone
Creates a new Zone element.
See Also
Document Class
Autodesk.Revit.Creation Namespace