Revit 2016 API
Duct Methods
The Duct type exposes the following members.
Methods
Name | Description
Create
 Creates a new duct.
CreatePlaceholder
 Creates a new placeholder duct.
IsDuctTypeId
 Checks if given type is valid duct type.
IsHvacSystemTypeId
 Checks if given type is valid HVAC system type.
IsLevelId
 Checks if given element id is valid level element.
See Also
Duct Class
Autodesk.Revit.DB.Mechanical Namespace