Revit 2016 API
Duct Members
The Duct type exposes the following members.
Methods
Name | Description
Create
 Creates a new duct.
CreatePlaceholder
 Creates a new placeholder duct.
IsDuctTypeId
 Checks if given type is valid duct type.
IsHvacSystemTypeId
 Checks if given type is valid HVAC system type.
IsLevelId
 Checks if given element id is valid level element.
Properties
Name | Description
DuctType
 The duct type of this duct.
IsPlaceholder
 Identifies if the duct is a placeholder or not.
See Also
Duct Class
Autodesk.Revit.DB.Mechanical Namespace