Revit 2016 API
DockablePaneProviderData Members
The DockablePaneProviderData type exposes the following members.
Constructors
Name | Description
DockablePaneProviderData
Initializes a new instance of the DockablePaneProviderData class
Methods
Name | Description
Properties
Name | Description
ContextualHelp
 The contextual help associated with the pane.
FrameworkElement
 The Windows Presentation Framework object containing the pane's user interface.
InitialState
 The initial position of the docking pane.
See Also
DockablePaneProviderData Class
Autodesk.Revit.UI Namespace