Revit 2016 API
CurveElement Members
The CurveElement type exposes the following members.
Methods
Name | Description
GetLineStyleIds
Retrieves the set of available line style Element Ids.
SetGeometryCurve
SetSketchPlaneAndCurve
Properties
Name | Description
CenterPointReference
Centerpoint reference of curve element. Curves such as circles, arcs, ellipses, and partial ellipses support this property.
CurveElementType
The curve element type.
GeometryCurve
Geometry curve of the curve element.
LineStyle
The line style of this curve element.
SketchPlane
The sketch plane the curve element lies in.
See Also
CurveElement Class
Autodesk.Revit.DB Namespace