Revit 2016 API
Category Methods
The Category type exposes the following members.
Methods
Name | Description
GetCategory(Document, BuiltInCategory)
Retrieves a category object corresponding to a BuiltInCategory ID.
GetCategory(Document, ElementId)
 Retrieves a category object corresponding to the category ID.
GetGraphicsStyle
Gets the graphics style associated with this category for the given graphics style type.
GetHashCode |  (Overrides Object.GetHashCode().)
GetLineWeight
Retrieves the line weight assigned to the category for the given graphics style type.
SetLineWeight
Sets the line weight for the given graphics style type.
See Also
Category Class
Autodesk.Revit.DB Namespace