Revit 2016 API
LoadCaseArrayIterator Methods
The LoadCaseArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
See Also
LoadCaseArrayIterator Class
Autodesk.Revit.DB.Structure Namespace