Revit 2016 API
BasicFileInfo Methods
The BasicFileInfo type exposes the following members.
Methods
Name | Description
Dispose
Extract
 Retrieves basic file data.
GetDocumentVersion
 Gets the DocumentVersion for the file.
See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace