Revit 2016 API
DirectShape Properties
The DirectShape type exposes the following members.
Properties
Name | Description
TypeId
 Element id of a DirectShapeType object that holds properties to be shared by this element. Optional.
See Also
DirectShape Class
Autodesk.Revit.DB Namespace