Revit 2016 API
ViewShapeBuilder Methods
The ViewShapeBuilder type exposes the following members.
Methods
Name | Description
AddCurve
 Add a curve to the GRep associated to this ViewShapeBuilder.
Reset
 Clears the accumulated geometry and resets other ViewShapeBuilder parameters to invalid values.
SetShape(DirectShape) |  Obsolete.
 Set a view-specific shape of the DirectShape object to geometry accumulated in this ViewShapeBuilder object. The view type currently set in ViewShapeBuilder is used. Since the accumulated geometry was validated by ViewShapeBuilder already, this skips the second validation in DirectShape. This function resets this ViewShapeBuilder object: the geometry is transferred to DirectShape, view normal and view type are invalidated.
SetShape(DirectShapeType) |  Obsolete.
 Set a view-specific shape of the DirectShapeType object to geometry accumulated in this ViewShapeBuilder object. The view type currently set in ViewShapeBuilder is used. Since the accumulated geometry was validated by ViewShapeBuilder already, this skips the second validation in DirectShapeType. This function resets this ViewShapeBuilder object: the geometry is transferred to DirectShapeType, view normal and view type are invalidated.
ValidateCurve(Curve)
 Validates curve to be added to the view-specific shape being constructed. Called by AddCurve() to validate input. Expects a valid view normal to be set prior to the call.
ValidateCurve(Curve, DirectShapeTargetViewType)
 Validates curve to be added to the view-specific shape being constructed. Called by AddCurve() to validate input. This function may be used to pre-validate the geometry being added to avoid AddCurve() throwing an InvalidArgumentException
ValidateViewType
 Validates the incoming view type. As of today, the only allowed view type is Plan.
See Also
ViewShapeBuilder Class
Autodesk.Revit.DB Namespace