Revit 2016 API
RoomTag Properties
The RoomTag type exposes the following members.
Properties
Name | Description
Room
The room that the tag is associated with.
RoomTagType
The tag type.
See Also
RoomTag Class
Autodesk.Revit.DB.Architecture Namespace