Revit 2016 API
MechanicalSystem Methods
The MechanicalSystem type exposes the following members.
Methods
Name | Description
Create(Document, ElementId)
 Creates a new instance of a mechanical system and adds it to the document.
Create(Document, ElementId, String)
 Creates a new instance of a mechanical system and adds it to the document.
IsPressureDropServerMissing
 Indicates if any pressure drop server which was used in the mechanical system is not available.
See Also
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace