Revit 2016 API
Pipe Members
The Pipe type exposes the following members.
Methods
Name | Description
Create(Document, ElementId, ElementId, Connector, Connector)
 Creates a new pipe that connects two connectors. The new pipe will have the same diameter and system type as the start connector. If the connection fails, the method throws an exception.
Create(Document, ElementId, ElementId, Connector, XYZ)
 Creates a new pipe that connects to the connector. The new pipe will have the same diameter and system type as the connector. If the connection fails, the method throws an exception.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ)
 Creates a new pipe from two points.
CreatePlaceholder
 Creates a new placeholder pipe.
IsLevelId
 Checks if given element id is valid level element.
IsPipeTypeId
 Checks if given type is valid pipe type.
IsPipingConnector
 Checks if the given connector is a valid piping connector.
IsPipingSystemTypeId
 Checks if given type is valid piping system type.
SetSystemType
 Updates the associated system type for the pipe. If the pipe previously did not have a system associated to it, this will create a new system.
Properties
Name | Description
FlowState
The flow state of the pipe.
IsPlaceholder
 Identifies if the pipe is a placeholder or not.
PipeType
 The pipe type of this pipe.
See Also
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace