Revit 2016 API
Grid Properties
The Grid type exposes the following members.
Properties
Name | Description
Curve
Retrieves an object that represents the geometry of the grid line.
GridType |  Obsolete.
Get and Set the type of the grid object.
IsCurved
 Identifies if the grid line is curved or straight.
See Also
Grid Class
Autodesk.Revit.DB Namespace