Revit 2016 API
DialogBoxShowingEventArgs Members
The DialogBoxShowingEventArgs type exposes the following members.
Methods
Name | Description
OverrideResult
 Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value.
Properties
Name | Description
HelpId
 An ID that represents the dialog that has been displayed.
See Also
DialogBoxShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace