Revit 2016 API
ScheduleField Methods
The ScheduleField type exposes the following members.
Methods
Name | Description
CanTotal
 Indicates if totals can be enabled for this field.
CanTotalByAssemblyType
 Indicates if totals by assembly type can be enabled for this field.
CreatesCircularReferences
 Checks whether a field ID would create a circular chain of references when used by the PercentageOf property of this field.
Dispose
GetFormatOptions
 Gets the FormatOptions to optionally override the default settings in the Units class.
GetName
 Gets the name of the field.
GetSchedulableField
 Gets a SchedulableField object representing this field.
GetStyle
 Gets the style of this field.
ResetOverride
 Resets the override of this field.
SetFormatOptions
 Sets the FormatOptions to optionally override the default settings in the Units class.
SetStyle
 Sets the style of this field.
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace