Revit 2016 API
PipingSystem Members
The PipingSystem type exposes the following members.
Methods
Name | Description
Create(Document, ElementId)
 Creates a new instance of a piping system and adds it to the document.
Create(Document, ElementId, String)
 Creates a new instance of a piping system and adds it to the document.
IsFlowServerMissing
 Indicates if any flow server which was used in the piping system is not available.
IsPressureDropServerMissing
 Indicates if any pressure drop server which was used in the piping system is not available.
Properties
Name | Description
BaseEquipmentConnector
The connector within base equipment which is used to connect with system.
FixtureUnits
 Indicates the computed total fixture units for the piping system.
Flow
 Indicates the computed total flow for the piping system.
IsWellConnected
 Indicates if the system is well connected or not.
PipingNetwork
 Pipes and fittings which are contained in this system.
StaticPressure
 Indicates the computed static pressure for the piping system.
SystemType
The type of this piping system.
See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace