Revit 2016 API
Frame Methods
The Frame type exposes the following members.
Methods
Name | Description
Dispose
IsOrthogonal
 Determines if this frame's basis vectors are orthogonal.
IsOrthonormal
 Determines if this frame's basis vectors are orthonormal.
IsRightHanded
 Determine if this frame's basis is right-handed.
Transform
 Applies the input transform to this frame.
See Also
Frame Class
Autodesk.Revit.DB Namespace