Revit 2016 API
LoadUsageArrayIterator Properties
The LoadUsageArrayIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
LoadUsageArrayIterator Class
Autodesk.Revit.DB.Structure Namespace