Revit 2016 API
LoadCaseSetIterator Methods
The LoadCaseSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Reset
See Also
LoadCaseSetIterator Class
Autodesk.Revit.DB.Structure Namespace