Revit 2016 API
NurbSpline Members
The NurbSpline type exposes the following members.
Methods
Name | Description
Create(IList<XYZ>, IList<Double>)
 Creates a new geometric NurbSpline object using the same calculations that Revit uses when sketching splines in the user interface.
Create(IList<XYZ>, IList<Double>, IList<Double>, Int32, Boolean, Boolean)
 Creates a new geometric NURBSpline object.
SetControlPointsAndWeights
Set the control points, weights simultaneously.
Properties
Name | Description
CtrlPoints
Returns the control points of the nurb spline.
Degree
Returns the degree of the nurb spline.
isClosed
Return/set the nurb spline's isClosed property.
isRational
Returns whether the nurb spline is rational or not.
Knots
Return/set the knots of the nurb spline.
Weights
Returns the weights of the nurb spline.
See Also
NurbSpline Class
Autodesk.Revit.DB Namespace