Revit 2016 API
RevisionSettings Properties
The RevisionSettings type exposes the following members.
Properties
Name | Description
RevisionAlphabet |  Obsolete.
 Determines the sequence of characters assigned to revisions that use alphabetic numbering.
RevisionCloudSpacing
 Determines the size in paper space of revision clouds drawn in a project.
RevisionNumbering
 Determines how the revision number values will display on sheets.
See Also
RevisionSettings Class
Autodesk.Revit.DB Namespace