Revit 2016 API
RebarContainer Properties
The RebarContainer type exposes the following members.
Properties
Name | Description
ItemsCount
 The count of Items in this Rebar Container.
ScheduleMark
 The Schedule Mark parameter. On creation, the Schedule Mark is set to a value that is unique to the host, but it can be set to any value.
See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace