Revit 2016 API
TextNote Properties
The TextNote type exposes the following members.
Properties
Name | Description
LeaderCount
 Number of leader objects currently attached to the text note.
LeaderLeftAttachment
 Attachment position of leaders on the left side of the text note.
LeaderRightAttachment
 Attachment position of leaders on the right side of the text note.
Leaders |  Obsolete.
Retrieves all leaders currently attached to the TextNote object.
TextNoteType
Access the type of the TextNote object.
See Also
TextNote Class
Autodesk.Revit.DB Namespace