Revit 2016 API
TextNode Members
The TextNode type exposes the following members.
Methods
Name | Description
GetFormattedTextRuns
 Returns a list of separated runs of formated text.
Properties
Name | Description
BaseDirection
 Direction of the base line of the text object (in model space).
Color
 The color of the text.
FontHeight
 Height [ft] of the font including both the typographic ascender and descender.
FontName
 The name of the text font.
Height
 Height [ft] of the area of the text content.
HorizontalAlignment
 Horizontal alignment of the text content within the text area of the element.
IsBold
 Indicates whether the text style is set to bold text.
IsForRightToLeftReading
 Indicates whether the text uses Right-To-Left reading order.
IsItalic
 Indicates whether the text style is set to italic text.
IsKeptReadable
 A flag controling how text behaves inside a rotated text object.
IsTransparent
 Indicates whether the text background is transparent or opaque.
IsUnderlined
 Indicates whether the text style is set to underlined text.
Position
 Position of the text (in model coordinates.)
TabSize
 The size of one tabulator space.
Text
 The content of the text annotation as a plain string stripped of all formating.
TextSize
 Height [ft] of the text.
UpDirection
 Direction along the vertical axis of letters of the text object (in model space).
VerticalAlignment
 Vertical alignment of the text content within the text area of the element.
Width
 Width [ft] of the area of the text content.
WidthScale
 Horizontal scale applied to the text.
See Also
TextNode Class
Autodesk.Revit.DB Namespace