Revit 2016 API
LoadCaseArray Methods
The LoadCaseArray type exposes the following members.
Methods
Name | Description
Append
Add the load case to the end of the array.
Clear
Removes every load case from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified load case into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
See Also
LoadCaseArray Class
Autodesk.Revit.DB.Structure Namespace