Revit 2016 API
LoadCaseArray Properties
The LoadCaseArray type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets an load case at a specified index within the array.
Size
Returns the number of load cases that are in the array.
See Also
LoadCaseArray Class
Autodesk.Revit.DB.Structure Namespace