Revit 2016 API
FabricationServiceButton Methods
The FabricationServiceButton type exposes the following members.
Methods
Name | Description
Dispose
GetConditionImage
Gets the image for the specified fabrication service button condition.
GetConditionLowerValue
 Gets the condition lower value (valid if greater or equal) for a given condition index.
GetConditionName
 Gets the name of the specified condition on the fabrication service button.
GetConditionUpperValue
 Gets the condition upper value (valid if less) for a given condition index.
GetImage
Gets the image for fabrication service button.
IsUnrestrictedCondition
 Checks if the condition is unrestricted.
IsValid
 Checks if the button contains only valid fittings.
IsValidConditionIndex
 Validates if the given condition index is valid or not.
See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace