Revit 2016 API
Family Methods
The Family type exposes the following members.
Methods
Name | Description
CanHaveStructuralSection
 Identifies if this Family can have a structural section.
ExtractPartAtom
 Writes a PartAtom XML from the contents of a family object.
GetFamilySymbolIds
 Gets the ids of the FamilySymbols owned by this Family.
GetFamilyTypeParameterValues
 Returns all applicable values for a FamilyType parameter of this family.
HasStructuralSection |  Obsolete.
 Identifies if this Family can have a structural section. This property is deprecated in Revit 2016. Use canHaveStructuralSection instead.
IsAppropriateCategoryId
 Identifies if the input category id can be assigned as the new category for this family.
See Also
Family Class
Autodesk.Revit.DB Namespace