Revit 2016 API
Autodesk.Revit.DB Namespace
Classes
Class | Description
ACADExportOptions
 The base class for options used to export DWG and DXF format files.
AdaptiveComponentFamilyUtils
 An interface for Adaptive Component Instances.
AdaptiveComponentInstanceUtils
 An interface for Adaptive Component Instances.
AddInId
 Identifies an AddIn registered with Revit
AlphanumericRevisionSettings
 Contains settings that apply to Revisions with the Alphanumeric RevisionNumberType.
AnnotationSymbol
This object represents a symbol of the Generic Annotation.
AnnotationSymbolType
An object that represents an annotation style.
APIObject
Supports all objects in the Autodesk Revit API hierarchy.
AppearanceAssetElement
 An element that represents an appearance asset for use in composing material definitions.
Arc
A circular arc.
Area
Provides access to the area topology in Autodesk Revit.
AreaFilter
 A filter used to match areas.
AreaScheme
The area scheme associated with a particular area plan.
AreaTag
Provides access to the area topology in Autodesk Revit.
AreaTagFilter
 A filter used to match area tags.
AreaTagType
An object that represents an Area Tag style.
AreaVolumeSettings
 This class provides access to settings related to volume and area computations.
AssemblyCodeTable
 AssemblyCodeTable represents the collection of ClassificationEntries for a document.
AssemblyDifference
 Class that describes difference between two assemblies.
AssemblyDifferenceConfiguration
 The two assemblies being compared have different spatial configuration
AssemblyDifferenceMemberCount
 The two assemblies being compared have different number of members
AssemblyDifferenceMemberDifference
 The two assemblies being compared have different members
AssemblyDifferenceNamingCategory
 The two assemblies being compared have different naming categories
AssemblyDifferenceNone
 The two assemblies being compared are identical
AssemblyInstance
 Combines multiple elements for tagging, filtering, scheduling and creating isolated assembly views.
AssemblyMemberDifference
 Class that describes difference between two assembly members
AssemblyMemberDifferentCategory
 The two assembly members being compared have different category
AssemblyMemberDifferentGeometry
 The two assembly members being compared have different geometry
AssemblyMemberDifferentParameters
 The two assembly members being compared have different parameters
AssemblyMemberDifferentType
 The two assembly members being compared have different type
AssemblyType
 Type for construction assembly elements.
AssemblyViewUtils
 Utilities that provide capabilities related to assembly view creation and validation.
BackgroundSettings
 Represents the rendering background settings.
BaseArray
 An abstract base class that represents an array within the Revit project.
BaseExportOptions
 The base class for options used to export DWG, DXF and DGN format files.
BaseImportOptions
 A base class containing import options used during import of several formats.
BasePoint
Represents kinds of BasePoints.
BasicFileInfo
 Encapsulates basic information about a Revit file, including worksharing status, Revit version, username and central path.
BeamSystem
 An object that represents a BeamSystem within the Autodesk Revit project.
BeamSystemType
An object that specifies the type of a beam system in Autodesk Revit.
Binding
Binding objects are used to take a parameter definition and bind it to one or more categories.
BindingMap
The parameters BindingMap contains all the parameter bindings that exist in the Autodesk Revit project.
Blend
A blend solid or void form.
BooleanOperationsUtils
 These utilities are applicable for the geometry created by GeometryCreationUtilities and the geometry of Revit model.
BoundarySegment
 An object that represents a segment of an area boundary.
BoundingBoxContainsPointFilter
 A filter used to match elements with a bounding box that contains the given point.
BoundingBoxIntersectsFilter
 A filter used to match elements with a bounding box that intersects the given Outline.
BoundingBoxIsInsideFilter
 A filter used to match elements with a bounding box that is contained by the given Outline.
BoundingBoxUV
A two-dimensional rectangle, parallel to the coordinate axes.
BoundingBoxXYZ
A three-dimensional rectangular box at an arbitrary location and orientation within the Revit model.
BrowserOrganization
 The organization settings for grouping, sorting, and filtering of items in the project browser.
BuildingPadType
 Represents a specific type of Building Pad.
BuildingSiteExportOptions
Building Site Export options.
BuiltInFailures
Provides a container of all Revit built-in FailureDefinitionId instances.
BuiltInFailures.AnalyticalModelFailures
 Failures about AnalyticalModel.
BuiltInFailures.ArrayFailures
 Failures about Arrays.
BuiltInFailures.AssemblyFailures
 Failures related to Assemblies.
BuiltInFailures.AutoJoinFailures
 Failures about AutoJoin.
BuiltInFailures.AutoRouteFailures
 Failures about AutoRoute.
BuiltInFailures.BeamFailures
 Failures about Beams.
BuiltInFailures.BeamSystemFailures
 Failures about BeamSystem.
BuiltInFailures.BendFailures
 Failures about Bends.
BuiltInFailures.BlendFailures
 Failures about Blend.
BuiltInFailures.ColorFillFailures
 Failures about ColorFill.
BuiltInFailures.ColumnFailures
 Failures about Columns.
BuiltInFailures.ColumnInsideWallFailures
 Failures description ColumnInsideWall
BuiltInFailures.ComponentRepeaterFailures
 Failures related to component repeaters.
BuiltInFailures.ComponentRepeaterSlotFailures
 Failures related to component repeater slots.
BuiltInFailures.ConnectorFailures
 Failures about Connector.
BuiltInFailures.ConstraintFailures
 Failures about Constraint.
BuiltInFailures.ConversionFailures
 Failures about conversion of data to a different format.
BuiltInFailures.CopyMonitorFailures
 Failures about CopyWatch.
BuiltInFailures.CopyPasteFailures
 Failures about CopyPasteFailures.
BuiltInFailures.CreationFailures
 Failures about CreationFailures.
BuiltInFailures.CurtainGridFamilyFailures
 Failures about CurtainGrid Family.
BuiltInFailures.CurtainWallFailures
 Failures about CurtainWall.
BuiltInFailures.CurveByPointFailures
 Failures about Curve By Point Element
BuiltInFailures.CurveFailures
 Failures about Curves and Curve-Driven Elements.
BuiltInFailures.CutFailures
 Failures about Cut.
BuiltInFailures.CutterFailures
 Failures about Cutter.
BuiltInFailures.CuttingFailures
 Failures about Cutting.
BuiltInFailures.DatumPlaneFailures
 Failures about DatumPlane.
BuiltInFailures.DebugTabBindingFailures
 Failures related to binding framework demo panel on Ribbon Debug Tab.
BuiltInFailures.DecalFailures
 Failures about Decal.
BuiltInFailures.DesignOptionFailures
 Failures about DesignOptionFailures.
BuiltInFailures.DetailFailures
 Failures about Detail.
BuiltInFailures.DimensionFailures
 Failures about DimensionFailures.
BuiltInFailures.DisplacementElementFailures
 Error messages related to the DisplacementElement.
BuiltInFailures.DividedPathFailures
 Failures related to divided path operations.
BuiltInFailures.DividedSurfaceFailures
 Failures about DividedSurface.
BuiltInFailures.DocumentFailures
 Failures about DocumentFailures.
BuiltInFailures.DPartFailures
 Failures related to parts.
BuiltInFailures.DuctFailures
 Failures about Duct.
BuiltInFailures.EditingFailures
 Failures related to editing operations.
BuiltInFailures.ElectricalFailures
 Failures about Electricity.
BuiltInFailures.ElectricityFailures
 Failures related to electrical system and circuits.
BuiltInFailures.ElementFailures
 Failures about Elements.
BuiltInFailures.ElementTypeFailures
 Failures about ElementTypeFailures.
BuiltInFailures.ElevationFailures
 Failures about Elevation.
BuiltInFailures.EnergyAnalysisFailures
 Failures about EnergyAnalysis.
BuiltInFailures.EnergyAnalysisUtilitiesDBFailures
 Failures about EnergyAnalysisUtilitiesDBFailures.
BuiltInFailures.ExportFailures
 Failures about ExportFailures.
BuiltInFailures.ExtrusionFailures
 Failures about Extrusions.
BuiltInFailures.FabricAreaFailures
 Failures related to fabric area elements.
BuiltInFailures.FabricFailures
 Failures about Fabric.
BuiltInFailures.FabricSheetFailures
 Failures related to fabric sheet elements.
BuiltInFailures.FaceSplitterFailures
 Failures about FaceSplitter.
BuiltInFailures.FamilyFailures
 Failures related to families.
BuiltInFailures.FilledRegionFailures
 Failures about FilledRegion.
BuiltInFailures.FloorFailures
 Failures related to floors and slabs.
BuiltInFailures.FluidFailures
 Failures about Fluid.
BuiltInFailures.FormFailures
 Failures about Form.
BuiltInFailures.GeneralFailures
 Failures about GeneralFailures.
BuiltInFailures.GenericFailures
 Generic failures that may apply to any Revit Element
BuiltInFailures.GenericMEPFailures
 Failures applicable to different mechanical, electrical and piping Elements.
BuiltInFailures.GeometryFailures
 Failures about GeometryFailures.
BuiltInFailures.GlobalParameterFailures
BuiltInFailures.GridChainSketchFailures
 Failures related to the GridChain sketch.
BuiltInFailures.GridFailures
 Failures about Grid.
BuiltInFailures.GroupFailures
 Failures related to groups and their behavior.
BuiltInFailures.HostObjFailures
 Failures about HostObj.
BuiltInFailures.HvacFailures
 Failures related to HVAC in MEP.
BuiltInFailures.IlluminationFailures
 Failures about Illumination.
BuiltInFailures.ImageFailures
 Failures about Image.
BuiltInFailures.ImportExportFailures
BuiltInFailures.ImportFailures
 Failures about ImportFailures.
BuiltInFailures.InaccurateFailures
 Failures about Inaccurate.
BuiltInFailures.InfillFailures
 Failures about Infill.
BuiltInFailures.InterferenceFailures
 Failures about Interference.
BuiltInFailures.JoinElementsFailures
 Failures about JoinElements.
BuiltInFailures.KeyBasedTreeEntryFailures
 Failures about KeyBasedTreeEntry.
BuiltInFailures.KeyBasedTreeFileFailures
 Failures occurred when reading key based tree text file.
BuiltInFailures.KeynoteFailures
BuiltInFailures.KeynoteTagFailures
 Failures related to keynote tags.
BuiltInFailures.LegendFailures
 Failures about Legend.
BuiltInFailures.LevelFailures
 Failures about Level.
BuiltInFailures.LinkFailures
 Failures about LinkFailures.
BuiltInFailures.LoadFailures
 Failures about Load.
BuiltInFailures.LooseDimensionFailures
 Failures about LooseDimension.
BuiltInFailures.MassFailures
 Failures about Mass.
BuiltInFailures.MatchlineFailures
 Failures about Matchline.
BuiltInFailures.MechanicalFailures
 Failures about HVAC.
BuiltInFailures.MEPCalculationFailures
 Failures about Fluid.
BuiltInFailures.MEPFabricationFailures
 Failures about MEP fabrication.
BuiltInFailures.MirrorFailures
 Failures about Mirror.
BuiltInFailures.MultiReferenceAnnotationFailures
 Failures about MultiReferenceAnnotations.
BuiltInFailures.NumberingFailures
 Failures related to object numbering operations.
BuiltInFailures.OffsetFacesCellLegacyFailures
 Failures related to offset faces operations.
BuiltInFailures.OpeningFailures
 Failures about Opening.
BuiltInFailures.OverlapFailures
 Failures detected by overlap check.
BuiltInFailures.ParameterFailures
 Failures related to parameters and parameter operations.
BuiltInFailures.PartMakerMethodForFamilyInstanceFailures
 Failures related to part creation from family instances.
BuiltInFailures.PartMakerMethodForMergePartFailures
 Failures related to part merge operations.
BuiltInFailures.PartMakerMethodForWallFailures
 Failures related to parts related to walls.
BuiltInFailures.PathFailures
 Failures about Path.
BuiltInFailures.PerformanceFailures
 Failures which give hints pointing to situations where performance could be improved.
BuiltInFailures.PipingFailures
 Failures about Pipes.
BuiltInFailures.PlanRegionFailures
 Failures about PlanRegion.
BuiltInFailures.PointFailures
 Failures about Point Element.
BuiltInFailures.ProfileFailures
 Failures about Profile.
BuiltInFailures.PropertySetElementFailures
 Failures related to property set elements.
BuiltInFailures.RebarFailures
 Failures about Rebar.
BuiltInFailures.RebarShapeFailures
 Failures about RebarShape.
BuiltInFailures.RebarSystemFailures
 Failures related to rebar systems.
BuiltInFailures.RefPlaneFailures
 Failures about RefPlane.
BuiltInFailures.RegenFailures
 Failures about RegenFailures.
BuiltInFailures.RenderFailures
 Failures related to rendering.
BuiltInFailures.RevisionCloudFailures
 Failures about RevisionCloud.
BuiltInFailures.RevisionFailures
 Failures about Revision Settings.
BuiltInFailures.RevolutionFailures
 Failures about Revolution.
BuiltInFailures.RoofFailures
 Failures about Roof.
BuiltInFailures.RoomFailures
 Failures about Room.
BuiltInFailures.ScheduleViewFailures
 Failures about Schedule.
BuiltInFailures.SculptingFailures
 Failures about Sculpting.
BuiltInFailures.SectionViewFailures
 Failures about Section.
BuiltInFailures.SelectionFailures
 Failures about Selections.
BuiltInFailures.SheetFailures
 Failures about Sheet.
BuiltInFailures.SiteFailures
 Failures about Site.
BuiltInFailures.SiteImportFailures
 Failures about SiteImport.
BuiltInFailures.SketchFailures
 Failures about Sketch.
BuiltInFailures.SkylightFailures
 Failures about Skylight.
BuiltInFailures.SlabFailures
 Failures about Slab.
BuiltInFailures.SlabShapeFailures
 Failures about SlabShape.
BuiltInFailures.SlantedColumnFailures
 Failures about SlantedColumn.
BuiltInFailures.SpanDirectionSymbolFailures
 Failures about SpanDirectionSymbol.
BuiltInFailures.SplineFailures
 Failures about Spline.
BuiltInFailures.StairRampFailures
 Failures about StairRamp.
BuiltInFailures.StructuralAssetFailures
 Failures related to structural materials.
BuiltInFailures.StructuralConnectionFailures
 Failures about StructuralConnectionHandler.
BuiltInFailures.StructuralLoadFailures
 Failures about Load.
BuiltInFailures.SweepFailures
 Failures about Sweep.
BuiltInFailures.SweptBlendFailures
 Failures about SweptBlend.
BuiltInFailures.SystemNavigatorFailures
 Failures related with the system browser.
BuiltInFailures.SystemsFailures
 Failures about System.
BuiltInFailures.TagFailures
 Failures about Tag.
BuiltInFailures.TextFailures
 Failures about Text.
BuiltInFailures.TilePatternTileFailures
 Failures related to tile pattern tile.
BuiltInFailures.ToggleViewFailures
 Failures about ToggleView.
BuiltInFailures.TrussFailures
 Failures about Truss.
BuiltInFailures.ViewFailures
 Failures about ViewFailures.
BuiltInFailures.WallFailures
 Failures about Wall.
BuiltInFailures.WallJoinFailures
 Failures about WallJoin.
BuiltInFailures.WallJoinRoofFailures
 Failures about WallJoinRoof.
BuiltInFailures.WorksharingFailures
 Failures about WorksharingFailures.
CADExportOptions
Generic CAD Export options.
CADLinkType
 CADLinkType represents both CAD links and CAD imports. The function IsLink can be used to distinguish between the two. CAD imports are not ExternalFileReferences; they are brought completely into the document and maintain no connection to their original file.
CameraInfo
 An object holding information about the projection mapping of a 3D view.
Categories
The Categories object is a map that contains all the top-level Category objects within the Document.
Category
Represents the category or subcategory to which an element belongs.
CategoryNameMap
A map that contains a mapping of category name to its category object.
CategoryNameMapIterator
An iterator to a category name map.
CategorySet
A set that can contains Category objects.
CategorySetIterator
An iterator to a category set.
Ceiling
 Represents a ceiling in Autodesk Revit.
CeilingAndFloor
A base class that provides support for all ceiling and floor objects.
CeilingType
 Represents a ceiling type in Autodesk Revit.
ChangeType
 A class representing a change that can be detected and tracked during Dynamic Update.
City
An object that contains geographical location information for a known city.
CitySet
An set that contains cities.
CitySetIterator
An iterator to a city set.
ClassificationEntries
 A collection of ClassificationEntry objects that make up the classification table.
ClassificationEntry
 Represents an entry in the classification table.
Color
Represents a color in Autodesk Revit.
ColorBackgroundSettings
 Represents the rendering color background settings.
ColumnAttachment
 An object representing the attachment of the top or bottom of a column to some target: a floor, roof, ceiling, beam, or brace.
CombinableElement
An element that can be added to a geometry combination.
CombinableElementArray
An array that contains CombinableElement objects.
CombinableElementArrayIterator
An iterator to an CombinableElement array.
ComponentRepeater
 An element that contains and manages a set of repeated components.
ComponentRepeaterIterator
 A slot iterator for ComponentRepeater.
ComponentRepeaterSlot
 Represents a slot that holds one repeated component in a component repeater.
CompoundStructure
 Describes the internal structure of a wall, floor, roof or ceiling.
CompoundStructureLayer
 Describes a single layer in a CompoundStructure.
ConfigurationReloadInfo
 This object contains information returned by a reload of the fabrication configuration.
ConicalFace
A cone face of a 3d solid.
ConnectionValidationInfo
 This object contains information about fabrication connection validations.
ConnectionValidationWarning
 Contains information about a specific connection validation problem.
Connector
 A connector in an Autodesk Revit MEP project document.
ConnectorElement
 A base class that provides support for all connector elements occurring in families.
ConnectorManager
 Provides access to the Connector Manager
ConnectorSet
A set that can contain any type of object.
ConnectorSetIterator
An iterator to a set.
Construction
Construction definition for Project Information.
ContentNode
 This is a class representing a generic content node in a model-exporting process.
Control
A control in Autodesk Revit family document.
CopyPasteOptions
 Settings to control the behavior of a copy-paste operation.
CurtainCell
Represents a CurtainCell within Autodesk Revit.
CurtainGrid
Represents a curtain grid element within Autodesk Revit.
CurtainGridLine
Represents a CurtainGridLine within Autodesk Revit.
CurtainGridSet
A set that can contain any type of object.
CurtainGridSetIterator
An iterator to a set.
CurtainSystem
Provides access to the CurtainSystem object in Autodesk Revit.
CurtainSystemBase
Provides access to the CurtainSystemBase object in Autodesk Revit.
CurtainSystemType
An object that represents CurtainSystem type.
Curve
A parametric curve.
CurveArrArray
An array that can contain any type of object.
CurveArrArrayIterator
An iterator to a array.
CurveArray
An array that can contain curves.
CurveArrayIterator
An iterator to a curve array.
CurveByPoints
A curve interpolating two or more points.
CurveByPointsArray
An array that can contain CurveByPoints elements.
CurveByPointsArrayIterator
An iterator to a CurveByPoints array.
CurveByPointsUtils
 A static class that contains methods for processing curves driven by points.
CurveElement
Represents a curve element in Autodesk Revit. This could be a Model Line,Detail Line, or other specialty curve such as a Room Boundary Line.
CurveElementFilter
 A filter used to pass curve elements which are of a specific type.
CurveExtents
 Represents the start and end parameters for a curve segment.
CurveLoop
 A class that represents a chain of curves.
CurveLoopIterator
 An iterator to a curve loop.
CurveLoopsProfile
Represents a curve loop based profile for sweep or swept blend elements.
CurveNode
 An output node that represents a model curve.
CustomExporter
 A class that allows exporting 3D views via an export context.
CylindricalFace
A cylinder face of a 3d solid.
CylindricalHelix
A cylindrical helix.
DataConversionMonitorScope
 This class is used to regsiter an application-supplied object that implements IDataConversionMonitor. Creating the object registers an implementation of IDataConversionMonitor supplied as constructor argument. When the scope object is destroyed, that object is unregistered.
DatumPlane
 A base class representing a datum surface (level, grid or reference plane) in Autodesk Revit.
DaylightPortalNode
 This is a class representing a Daylight Portal in a model-exporting process.
DefaultDivideSettings
 Provides access to project-wide divide settings.
Definition
The Definition object is a base object for all type of parameter definitions within the Autodesk Revit API.
DefinitionBindingMap
A map that contains mappings of parameter definitions to parameter bindings.
DefinitionBindingMapIterator
An iterator to a parameter definition to parameter bindings map.
DefinitionFile
The DefinitionFile object represents a shared parameters file on disk.
DefinitionGroup
The DefinitionGroup is a container that is used to hold shared parameter definitions on disk.
DefinitionGroups
A specialized set of definition groups that allows creation of new groups.
Definitions
A base class that supports the addition of new parameter definitions.
DeleteElements
 Deletes element(s) related to the failure.
DesignOption
 An element that represents a design alternative.
DetailArc
Represents a DetailArc within Autodesk Revit.
DetailCurve
 A curve that is used to create a detail drawing. A detail curve is visible only in the view in which it is drawn.
DetailCurveArray
An array that can contain any type of object.
DetailCurveArrayIterator
An iterator to a array.
DetailElementOrderUtils
 A utility class that arranges the draw order of the detail objects.
DetailEllipse
Represents a DetailEllipse within Autodesk Revit.
DetailLine
Represents a DetailLine within Autodesk Revit.
DetailNurbSpline
Represents a DetailNurbSpline within Autodesk Revit.
DGNExportOptions
 The export options used by exporting DGN format file.
DGNImportOptions
 The import options used to import DGN format files.
Dimension
 An object that represents a dimension within the Revit project.
DimensionSegment
 A segment of a dimension within the Autodesk Revit project.
DimensionSegmentArray
An array that can contain any number of DimensionSegment objects.
DimensionSegmentArrayIterator
An iterator to an array of DimensionSegment objects..
DimensionType
 An object that represents a dimension style.
DirectShape
 This class is used to store externally created geometric shapes. Primary intended use is for importing shapes from other data formats such as IFC or STEP. A DirectShape object may be assigned a category. That will affect how that object is displayed in Revit.
DirectShapeLibrary
 DirectShapeLibrary is used to store pre-created geometry for further referencing via the definition/instance mechanism. It is not persistent: the scope of a library object is usually a single data creation session. DirectShape::createGeometryInstance and DirectShape::CreateElementInstance will use the current DirectShapeLibrary to look up the definitions. store a collection of GNodes as definition end class DirectShapeDefinition
DirectShapeOptions
 This class is used to control behavior of a DirectShape or a DirectShapeType object.
DirectShapeType
 The type element associated with a DirectShape element. This element includes data reused by DirectShape elements of the same type.
DisplacementElement
 A view-specific element that causes other elements to appear to be displaced from their actual locations.
DisplacementPath
 A view-specific annotation related to a DisplacementElement.
DividedPath
 An element that consists of a set of points distributed along a path which consists of a connected set of curves and edges.
DividedSurface
 An element that represents a mesh on the surface of another element, a family instance, an import instance or a geometry combination, and a tile pattern built on that mesh.
Document
 An object that represents an open Autodesk Revit project.
DocumentPreviewSettings
 Contains the settings related to the saving of preview images for a given document.
DocumentSet
A set that can contain any documents.
DocumentSetIterator
An iterator to a set of documents.
DocumentValidation
 Utility functions with document validation
DocumentVersion
 This class uniquely identifies an edition of a given document.
DoubleArray
An array that contains doubles.
DoubleArrayIterator
An iterator to an array of doubles.
DoubleParameterValue
 A class that holds a Double value of a parameter element.
DuplicateTypeNamesHandlerArgs
 A structure that provides information about an attempt to copy types with names that already exist in the destination document.
DWFExportOptions
Export options specific to AutoCAD file formats.
DWFImportOptions
 The import options used by importing DWF or DWFx format file.
DWFXExportOptions
DWFX Export options.
DWGExportOptions
 The export options used by exporting DWG format file.
DWGImportOptions
 The import options used by importing DWG or DXF format file.
DXFExportOptions
 The export options used by exporting DXF format file.
Edge
An edge of a 3d solid.
EdgeArray
An array that contains edges.
EdgeArrayArray
An array of edge arrays.
EdgeArrayArrayIterator
An iterator to an array or edge arrays.
EdgeArrayIterator
An iterator to an edge array.
EditScope
 The base class for a scope object that provides special access and limitations related to editing certain elements.
Element
 Base class for most persistent data within a Revit document.
ElementArray
An array that contains element objects.
ElementArrayIterator
An iterator to an element array.
ElementBinding
A base class for all types of binding that attach to an element.
ElementCategoryFilter
 A filter used to match elements by their category.
ElementClassFilter
 A filter used to match elements by their class.
ElementDesignOptionFilter
 A filter used to find elements contained within a particular design option.
ElementFilter
 A base class for a type of filter that accepts or rejects elements based upon criteria.
ElementId
The ElementId object is used as a unique identification for an element within a single project.
ElementIdParameterValue
 A class that holds a ElementId value of a parameter element.
ElementIntersectsElementFilter
 A filter to find elements that intersect the solid geometry of a given element.
ElementIntersectsFilter
 A base class for filters used to match elements which intersect with geometry.
ElementIntersectsSolidFilter
 A filter to find elements that intersect the given solid geometry.
ElementIsCurveDrivenFilter
 A filter used to match elements which are curve driven.
ElementIsElementTypeFilter
 A filter used to match elements which are ElementTypes.
ElementLevelFilter
 A filter used to match elements by their associated level.
ElementLogicalFilter
 A filter used to logically combine two or more filters.
ElementMulticategoryFilter
 A filter used to find elements whose category matches any of a given set of categories.
ElementMulticlassFilter
 A filter used to match elements by their class, where more than one class of element may be passed.
ElementOwnerViewFilter
 A filter used to match elements which are owned by a particular view.
ElementParameterFilter
 A filter used to match elements by one or more parameter filter rules.
ElementPhaseStatusFilter
 A filter used to match elements that have a given phase status on a given phase.
ElementQuickFilter
 A base class for a type of filter that operates on element records.
ElementRecord
 A record in the Revit database representing an element.
ElementSet
A set that contains element objects.
ElementSetIterator
An iterator to an element set.
ElementSlowFilter
 A base class for a type of filter that operates on expanded elements.
ElementStructuralTypeFilter
 A filter used to find elements matching a structural type.
ElementTransformUtils
 A collection of utilities allowing transformation of elements (e.g. move, rotate, mirror and copy).
ElementType
 Base class for all Types within Autodesk Revit.
ElementWorksetFilter
 A filter used to match elements which reside in a given workset.
ElevationMarker
 ElevationMarkers either host elevation ViewSection views or view references.
Ellipse
A whole or partial ellipse.
ExclusionFilter
 A filter used to exclude a set of elements automatically.
ExportDGNSettings
 This element contains DGN export settings which are saved in a Revit document.
ExportDWGSettings
 This element contains DWG/DXF export settings which are saved in a Revit document.
ExportFontInfo
 A value used to represent the info stored in an ExportFontTable.
ExportFontKey
 A key used to represent an item stored in an ExportFontTable.
ExportFontTable
 A table supporting a mapping of Revit font names to font names that will be set in the target export format.
ExportFontTableIterator
 An iterator to a set of font table.
ExportLayerInfo
 A value used to represent the info stored in the ExportLayerTable.
ExportLayerKey
 A key used to represent an item stored in an ExportLayerTable.
ExportLayerTable
 A table supporting a mapping of category and subcategory to layer name and other layer properties that will be set in the target export format.
ExportLayerTableIterator
 An iterator to a set of Layer table.
ExportLinetypeInfo
 A value used to represent the info stored in the ExportLinetypeTable.
ExportLinetypeKey
 A key used to represent an item stored in an ExportLinetypeTable.
ExportLinetypeTable
 A table supporting a mapping of linetypes in Revit to linetype names that will be set in the target export format.
ExportLinetypeTableIterator
 An iterator to a set of line type table.
ExportLineweightInfo
 A value used to represent the info stored in the ExportLineweightTable.
ExportLineweightKey
 A key used to represent an item stored in an ExportLineweightTable.
ExportLineweightTable
 A table supporting a mapping of line weights in Revit to line weight names that will be set in the target export format.
ExportLineweightTableIterator
 An iterator to a set of line weight table.
ExportPatternInfo
 A value used to represent the info stored in the ExportPatternTable.
ExportPatternKey
 A key used to represent an item stored in an ExportPatternTable.
ExportPatternTable
 A table supporting a mapping of FillPatterns in Revit to pattern names that will be set in the target export format.
ExportPatternTableIterator
 An iterator to a set of Pattern table.
ExportUtils
 This class provides utilities related to document export.
ExternalDefinition
 The ExternalDefinition object adds properties specific to Autodesk Revit shared parameter definitions.
ExternalDefinitionCreationOptions
 An option class used for creating a new shared parameter definition, including options such as name, type, visibility, Guid description and modifiable flag.
ExternalDefinitions
Supports the creation of new shared parameters definitions.
ExternalFileReference
 A class that contains the details of a reference to a file outside of a given document.
ExternalFileUtils
 A utility class containing functions related to external file references.
ExternalResourceBrowserData
 Represents a collection of external resources and external resource folders to be presented as the content of a folder in the file browser in Revit.
ExternalResourceLoadContent
 This class contains the actual content data and other results of an external resource load operation that are returned by an IExternalResourceServer to Revit.
ExternalResourceLoadContext
 This class contains data describing the context related to an external resource load operation.
ExternalResourceLoadData
This class contains the input and output data resulting from invoking an IExternalResourceServer's LoadResource method.
After the call to LoadResource, the resulting ExternalResourceLoadData will be passed into IExternalResourceServer.HandleLoadResourceResults() so that appropriate UI can be displayed.
Server providers can inspect the ExternalResourceLoadData to get an ExternalResourceLoadContent object of the subclass appropriate to the external resource. The class also contains a copy of the ExternalResourceReference, and information about the context of the load operation.
ExternalResourceMatchOptions
 Represents match options used to filter external resources when listing them from external resource server.
ExternalResourceReference
 This class identifies an external resource provided by an IExternalResourceServer.
ExternalResourceServerExtensions
 An object that contains overrides for external resource-specific methods.
ExternalResourceServerUtils
 Contains utilities related to external resource server.
ExternalResourceServiceUtils
 Contains utilities related to external resource service.
ExternalResourceType
 A type class used to distinguish between different kinds of external resource.
ExternalResourceTypes
Provides a container of all Revit built-in ExternalResourceType instances.
ExternalResourceTypes.BuiltInExternalResourceTypes
 A collection of ids of the ExternalResourceTypes provided by Revit.
ExternalResourceUtils
 A utility class containing functions related to external resource references.
Extrusion
A extrusion solid or void form.
ExtrusionAnalyzer
 This geometry utility allows you to attempt to "fit" a given piece of geometry into the shape of an extrusion.
ExtrusionRoof
Represents some kinds of Extrusion Roofs.
FabricationConfiguration
 This element contains the information about the fabrication configuration settings used by the project.
FabricationConfigurationInfo
 Represents an MEP object that holds the properties of an MEP fabrication configuration.
FabricationConnectorInfo
 Fabrication connector information.
FabricationDimensionDefinition
 Fabricaition dimension definition
FabricationHostedInfo
 The fabrication hosted element information.
FabricationPart
 Represents a fabrication component in the Autodesk Revit MEP product.
FabricationPartType
 Represents a fabrication component type in the Autodesk Revit MEP product.
FabricationRodInfo
 The rod information of the fabrication part.
FabricationService
 This object contains information about a fabrication service.
FabricationServiceButton
 The object contains information about a fabricaton button.
Face
A face of a 3d solid.
FaceArray
An array that contains faces.
FaceArrayIterator
An iterator to a face array.
FaceNode
 An output node that represents a Face.
FaceSecondDerivatives
 Contains second partial derivatives of a face at a specified point.
FaceSplitter
 Represents an element that splits a face.
FacetingUtils
 This class is used to convertTrianglesToQuads a triangulated structure into a structure in which some of the triangles have been consolidated into quadrilaterals.
FaceWall
 A wall attached to a non-vertical massing face.
FailureDefinition
 Defines persistent information about a failure.
FailureDefinitionAccessor
 A class that provides access to the details of a FailureDefinition after the definition has been defined.
FailureDefinitionId
 The unique identifier of a FailureDefinition.
FailureDefinitionRegistry
 The global registry for all FailureDefinitions in the Revit session.
FailureHandlingOptions
 Options to control how failures (if any occurred during the transaction) should be handled at the time the transaction is being ended.
FailureMessage
 Represents a message describing a failure of an operation in Revit.
FailureMessageAccessor
 Restricted accessor for FailureMessage.
FailureMessageKey
 A unique key assigned to each posted failure message
FailureResolution
 Defines a resolution for a failure.
FailuresAccessor
 An interface class that provides access to failure information posted in a document and methods to resolve these failures.
Family
 An element that represents a custom family (not a system family) in Autodesk Revit.
FamilyElementVisibility
Provides access to the visibility parameters of family elements in family document.
FamilyInstance
This object represents a single instance of a family type, such as a single I beam.
FamilyInstanceFilter
 A filter used to find elements that are family instances of the given family symbol.
FamilyManager
The family manager object to manage the family types and parameters in family document.
FamilyParameter
The family parameter object.
FamilyParameterSet
A set that contains FamilyParameter objects.
FamilyParameterSetIterator
An iterator to a FamilyParameter set.
FamilyPointLocation
 Data corresponding to the point locations in certain types of Family Symbols.
FamilyPointPlacementReference
 This object represents data corresponding to the placement references in a certain types of Family Instances (see examples listed below).
FamilySizeTable
 Contains size information for a family.
FamilySizeTableColumn
 Contains column information for a FamilySizeTable.
FamilySizeTableErrorInfo
 Error information generated from the CSV file import of a FamilySizeTable.
FamilySizeTableManager
 Manages importing, exporting, and querying size data through the FamilySizeTable class.
FamilySymbol
 An element that represents a single type with a Family.
FamilySymbolFilter
 A filter used to find all family symbols of the given family.
FamilySymbolProfile
Represents a family symbol based profile for sweep or swept blend elements.
FamilyThermalProperties
 A class that contains thermal properties for specific types of families (doors, windows, and curtain wall panels).
FamilyType
The family type object provides read access to the values of family parameters for this type.
FamilyTypeSet
A set that contains FamilyType objects.
FamilyTypeSetIterator
An iterator to a FamilyType set.
FamilyUtils
 Contains utilities related to family operations.
FBXExportOptions
3D-Studio Max (FBX) Export options.
FilePath
 This class represents a path on a disk or network location, but not a path to a Revit server location.
FilledRegion
 A filled region element.
FilledRegionType
 A filled region attributes element.
FillGrid
 Represents a grid line in a fill pattern.
FillPattern
 Represents a fill pattern object.
FillPatternElement
 An element that represents a fill pattern.
FilterableValueProvider
 Defines the interface for classes that extract values from elements in a Revit project for testing against filter rules.
FilterCategoryRule
 A filter rule that matches elements of a set of categories.
FilterDoubleRule
 A filter rule that operates on double-precision numeric values in a Revit project.
FilteredElementCollector
 This class is used to search, filter and iterate through a set of elements.
FilteredElementIdIterator
 An iterator to a set of element ids filtered by the settings of a FilteredElementCollector.
FilteredElementIterator
 An iterator to a set of element ids filtered by the settings of a FilteredElementCollector.
FilteredWorksetCollector
 This class is used to search, filter and iterate through a set of worksets.
FilteredWorksetIdIterator
 An iterator to a set of workset ids filtered by the settings of a FilteredWorksetCollector.
FilteredWorksetIterator
 An iterator to a set of worksets filtered by the settings of a FilteredWorksetCollector.
FilterElement
 The base class for filter elements in the document.
FilterElementIdRule
 A filter rule that operates on ElementId values in a Revit project.
FilterIntegerRule
 A filter rule that operates on integer values in a Revit project.
FilterInverseRule
 A filter rule that inverts the boolean values returned by the rule it contains.
FilterNumericEquals
 Tests whether numeric values from the document are equal to a certain value
FilterNumericGreater
 Tests whether numeric values from the document are greater than a certain value
FilterNumericGreaterOrEqual
 Tests whether numeric values from the document are greater than or equal to a certain value
FilterNumericLess
 Tests whether numeric values from the document are less than a certain value
FilterNumericLessOrEqual
 Tests whether numeric values from the document are less than or equal to a certain value
FilterNumericRuleEvaluator
 Base for all classes that compare numeric values from Revit to a user-supplied filter value.
FilterNumericValueRule
 Base for all classes that use a FilterNumericRuleEvaluator to perform their comparisons
FilterRule
 Defines a boolean operation that can be used to cull elements from a document.
FilterStringBeginsWith
 Tests whether string values from the document begin with a certain string.
FilterStringContains
 Tests whether string values from the document contain a certain string.
FilterStringEndsWith
 Tests whether string values from the document end with a certain string.
FilterStringEquals
 Tests whether string values from the document match a certain string.
FilterStringGreater
 Tests whether string values from the document would sort after a certain string.
FilterStringGreaterOrEqual
 Tests whether string values from the document would sort after or match a certain string.
FilterStringLess
 Tests whether string values from the document would sort before a certain string.
FilterStringLessOrEqual
 Tests whether string values from the document would sort before or match a certain string.
FilterStringRule
 A filter rule that operates on string values in a Revit project.
FilterStringRuleEvaluator
 Base for all classes that compare string values from Revit to a user-supplied filter value
FilterValueRule
 A rule that filters on a particular value of an element.
Floor
An object that represents a Floor within the Autodesk Revit project.
FloorType
 An object that specifies the type of a floor in Autodesk Revit.
FolderItemInfo
 Contains data for each folder item in the organization settings of the project browser including folder parameter Id and folder name.
FootPrintRoof
Represents kinds of FootPrintRoofs.
Form
An object that represents a Form within the Autodesk Revit Massing Family.
FormArray
An array that contains form objects.
FormArrayIterator
An iterator to a form array.
FormatOptions
 Options for formatting numbers with units.
FormattedTextRun
 A structure that defines a single run of a formated text.
FormatUtils |  Obsolete.
 A utility class for formatting numbers with units.
FormatValueOptions
 Options for formatting numbers with units into strings.
FormUtils
 Define Form utility functions
Frame
 Represents a coordinate frame of reference.
FreeFormElement
 A Free Form Element that contains non-parametric geometry created from an input solid outline.
GBXMLExportOptions
 Green-Building XML Export options. Not used currently. Reserved for future use.
GBXMLImportOptions
Import options for Green-Building XML format.
GenericForm
Provides access to the Generic Form model in Autodesk Revit.
GenericImportOptions
Generic Import options.
GeomCombination
An element created by Join and Cut operations applied to combinable elements in an Autodesk Revit family document.
GeomCombinationSet
A set that contains GeomCombination objects.
GeomCombinationSetIterator
An iterator to a GeomCombination set.
GeometryCreationUtilities
 A utility that allows construction of basic solid shapes.
GeometryElement
Geometric representation of an element.
GeometryInstance
An instance of another element (symbol), specially positioned by this element.
GeometryObject
The common base class for all geometric primitives.
GlobalParameter
 This class represents a GlobalParameter element in Revit.
GlobalParametersManager
 A class to access and query information about global parameters in Revit models.
GradientBackgroundSettings
 Represents the view gradient background settings.
GraphicsStyle
The graphics style instance in Autodesk Revit document.
Grid
 Represents a single grid line within Autodesk Revit.
GridType
An object that represents a grid type.
Group
This object represents a group of elements within the project.
GroupNode
 A node that represents set of individual elements grouped together in some form, such as an instance of a family or linked Revit file.
GroupSet
An set that contains groups.
GroupSetIterator
An iterator to a group set.
GroupType
Represents a type of a user defined group.
GuidEnum
 Base class of all GUID-based enum classes.
HermiteFace
A cubic hermite spline face of a 3d solid.
HermiteSpline
A Hermite spline.
HermiteSplineTangents
 This class indicates tangency at the start, the end, or both ends of the curve.
HomeCamera
 A structure that contains information about the camera and view for the Home view orientation stored in the model.
HostedSweep
An object that represents an object hosted by an edge of a roof or floor within the Autodesk Revit project.
HostedSweepType
An object that represents the attributes for sweep host objects in Autodesk Revit.
HostObjAttributes
An object that represents characteristics of several kinds of type.
HostObject
 A base class that provides support for all objects that can host other objects, such as walls roofs, and floors.
HostObjectUtils
 These are generic host object utilities.
IFCExportOptions
 IFC Export options.
ImageBackgroundSettings
 Represents the rendering image background settings.
ImageExportOptions
 This class defines options for exporting views and sheets as an image.
ImageImportOptions
Options used to import specific image formats and place an instance of them on a view or sheet.
ImageType
 Represents a type containing an image. Instances of this type can be displayed in 2D views, sheets, and schedules.
ImageView
 Class for ImageView views
ImportInstance
An element created during either import or link operation in Autodesk Revit.
IndependentTag
 Represents an IndependentTag within Autodesk Revit.
InsertableObject
A base class you all types that are insertable.
InSessionPrintSetting
Represents the in-session Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
InSessionViewSheetSet
Represents the in-session ViewSheetSet.
Instance
 The base class for all instance objects.
InstanceBinding
The InstanceBinding object is used to signify a binding between a parameter definition and a parameter on each instance of an element, such as a wall.
InstanceNode
 An output node that represents a family instance.
InstanceVoidCutUtils
 Utilities for cutting elements by unattached voids in family instances.
InsulationLiningBase
 Acts as the base class for duct insulation, pipe insulation and duct lining elements.
IntegerParameterValue
 A class that holds an Integer value of a parameter element.
IntegerRange
 A class to define a range of a sequence of consecutive integer numbers
InternalDefinition
 This object represents a parameter definition in Autodesk Revit.
InternalDefinitions
This object blocks attempts to create new internal definitions as they are not permitted.
IntersectionResult
This class captures results of intersecting geometric entities. "Intersecting" is meant in generalized sense, so the same class will be used for projection, containment, etc. Refer to the documentation of the method providing the result for the precise meaning of properties.
IntersectionResultArray
An array that can contain any type of object.
IntersectionResultArrayIterator
An iterator to a array.
JoinGeometryUtils
 Utilities for joining and unjoining elements, and for managing the order in which elements are joined.
KeyBasedTreeEntries
 A collection of KeyBasedTreeEntry objects that make up the key-based tree.
KeyBasedTreeEntriesIterator
 An iterator to a set of KeyBasedTreeEntry objects.
KeyBasedTreeEntriesLoadContent
 This class is used by IExternalResourceServers to return KeyBasedTreeEntries data to Revit when their LoadResource method is invoked.
KeyBasedTreeEntriesLoadResults
 This class contains the results and status information regarding an attempt to load the KeyBasedTreeEntries from an External Resource.
KeyBasedTreeEntry
 A key-based tree entry, containing the key, parent key, and children keys (if applicable).
KeyBasedTreeEntryError
 This class contains information about a problem encountered while creating a KeyBasedTreeEntries object.
KeyBasedTreeEntryTable
 KeyBasedTreeEntryTable represents the collection of key-based tree entries for a document.
KeynoteEntries
 A collection of KeynoteEntry objects that make up the keynote table.
KeynoteEntry
 Represents an entry in the keynote table, containing the key value, keynote text, and parent key (if applicable).
KeynoteTable
 KeynoteTable represents the collection of keynotes (KeynoteEntries) for a document.
LabelUtils
 Used to obtain user-visible names for enums.
LayerModifier
 A modifier used to designate extra strings to appear in the exported layer name.
LayoutRule
The LayoutRule object is a base object for all type of layout rules for Beam System within the Autodesk Revit API.
LayoutRuleClearSpacing
This class indicate the layout rule of a Beam System is Clear-Spacing.
LayoutRuleFixedDistance
This class indicate the layout rule of a Beam System is Fixed-Distance.
LayoutRuleFixedNumber
This class indicate the layout rule of a Beam System is Fixed-Number.
LayoutRuleMaximumSpacing
This class indicate the layout rule of a Beam System is Max-Spacing.
Leader
 A leader object that can be attached to annotation elements such as text notes.
LeaderArray
An array that can contain any number of leaders.
LeaderArrayIterator
An iterator to an array of leaders.
Level
 Represents a Level line within Autodesk Revit.
LevelType
An object that represents a Level type.
LightNode
 This is a class representing a Light element in a model-exporting process.
Line
A line in space.
LineAndTextAttrSymbol
An object that represents a dimension style.
LinearArray
 An object that represents an Array created linearly within the Revit project.
LinePattern
 Represents a line pattern definition.
LinePatternElement
 An element that represents a line pattern.
LinePatternSegment
 Represents a segment in a line pattern.
LineProperties
 A structure that has access to the pen properties of lines/curves that are currently being drawn/exported via an export context during a custom export process.
LineSegment
 An output node that represents a tessellated line segment.
LinkConversionData
 This class contains the information necessary to re-create a Revit document from an external source.
LinkElementId
 LinkElementId represents an element in a linked document.
LinkLoadContent
 This class is used by IExternalResourceServers to return Link data to Revit when their LoadResource method is invoked. It also contains additional information used by IExternalResourceUIServers to display link load status results to the user.
LinkNode
 An output node that represents a linked Revit document.
Location
Provides location functionality for all elements.
LocationCurve
Provides location functionality for all elements that are based upon a curve.
LocationPoint
Provides location functionality for all elements that have a single insertion point.
LogicalAndFilter
 A filter that contains a set of filters. The filter passes when all filters in the set pass.
LogicalOrFilter
 A filter that contains a set of filters. The filter passes when any filter in the set passes.
MassInstanceUtils
 A static class that contains methods for processing curves driven by points.
Material
 Represents a material element within an Autodesk Revit project.
MaterialNode
 This class represents a change of material during a model-exporting process.
MEPCalculationServerInfo
 a struct to hold the information about a MEP calucation servers
MEPConnectorInfo
 MEP connector information.
MEPCurve
A curve object for duct or pipe blend elements.
MEPCurveType
 The base type class for MEP curves, such as ducts, pipes, cable trays and conduits.
MEPModel
Supports all MEP models that are persistent within the Autodesk Revit project
MEPSize
 Stores the basic size information for an MEP duct, pipe, cable tray, or conduit.
MEPSystem
 A system in the Autodesk Revit MEP product.
MEPSystemType
 A system type in the Autodesk Revit MEP product.
Mesh
MeshFromGeometryOperationResult
 Describes what TessellatedShapeBuilder has built.
MeshTriangle
One triangle of a mesh.
ModelArc
Represents a ModelArc within Autodesk Revit.
ModelCurve
 A model element that exists in 3D space and is visible in all views of a Revit project.
ModelCurveArrArray
An array that can contain any type of object.
ModelCurveArrArrayIterator
An iterator to a array.
ModelCurveArray
An array that contains model curves.
ModelCurveArrayIterator
An iterator to a model curve array.
ModelCurveNode
 A base class of output nodes that represent various model curves.
ModelEllipse
Represents a ModelEllipse within Autodesk Revit.
ModelHermiteSpline
Represents a ModelHermiteSpline within Autodesk Revit.
ModelLine
Represents a ModelLine within Autodesk Revit.
ModelNurbSpline
Represents a ModelNurbSpline within Autodesk Revit.
ModelPath
 A path to a file stored on a disk or on a server.
ModelPathUtils
 Utility functions using ModelPaths
ModelText
A model text element in an Autodesk Revit family document.
ModelTextType
A model text type symbol in the Autodesk Revit Family document.
Mullion
Represents a CurtainGrid within Autodesk Revit.
MullionType
An object that represents a mullion type.
MullionTypeSet
A set that contains mullion types.
MullionTypeSetIterator
An iterator to a mullion type set.
MultiReferenceAnnotation
 Multi-reference annotations are annotations pointing to more than one reference, consisting of a dimension and associated tag.
MultiReferenceAnnotationOptions
 Options which control the creation of MultiReferenceAnnotations.
MultiReferenceAnnotationType
 The type for MultiReferenceAnnotation.
MultiSegmentGrid
 This element acts as a multi-segmented Grid. The individual grids associated to the MultiSegmentGrid behave as a single unit and all share the same text. They inherit their type (GridType) from the MultiSegmentGrid.
NamingUtils
 A collection of utilities related to element naming.
NavisworksExportOptions
 Options which controls the Navisworks export.
NestedFamilyTypeReference
 A proxy element representing a nested family type.
NullParameterValue
 A class that represent an empty (null) value of a parameter element.
NumberingSchema
 A class to support assigning numbers to elements of a particular kind for the purpose of tagging and scheduling them.
NumberingSchemaType
 A type for identifying a NumberingSchema of a particular kind.
NumberingSchemaTypes
Provides a container of all Revit built-in NumberingSchemaType instances.
NumberingSchemaTypes.StructuralNumberingSchemas
 A collection of types of built-in Numbering Schemas that are used for numbering structure elements.
NumberSystem
 An annotation that consists of a series of numeric tags attached to and describing a host element.
NumericRevisionSettings
 Contains settings that apply to Revisions with the Numeric RevisionNumberType.
NurbSpline
A nurb spline.
ObjectFactory
 For Internal Use Only.
Opening
An opening in an Autodesk Revit project or family document.
OpenOptions
 This class contains options available for opening a document from disk.
OptionalFunctionalityUtils
 A collection of utilities that can be used to determine if a particular set of functionality is installed and available.
Options
User preferences for parsing of geometry.
Outline
 Outline is a generic object that provides a bounding box/bounding outline. It supports operations to scale and transform. It also supports intersections and contains operations.
OverrideGraphicSettings
 Settings to override display of elements in a view.
Panel
This object represents a curtain panel.
PanelType
An object that represents a curtain panel type.
PanelTypeSet
A set that contains panel types.
PanelTypeSetIterator
An iterator to a panel type set.
PaperSize
An object that represents a Paper Size of Print Setup within the Autodesk Revit project.
PaperSizeSet
A set that can contain any number of paper size objects.
PaperSizeSetIterator
An iterator to a set of paper size objects.
PaperSource
An object that represents a Paper Source of Print Setup within the Autodesk Revit project.
PaperSourceSet
A set that can contain any number of paper source objects.
PaperSourceSetIterator
An iterator to a set of paper source objects.
Parameter
The parameter object contains the value data assigned to that parameter.
ParameterElement
 An Element that stores a user-defined parameter.
ParameterFilterElement
 Admits elements that satisfy two conditions:
The element's category must be one of a certain set of allowed categories.
The element must pass a series of filter rules.
ParameterFilterRuleFactory
 Contains functions that create appropriate FilterRule objects based on the parameters given.
ParameterFilterUtilities
 Contains static utility functions for enumerating the categories and parameters that are available for use by ParameterFilterElement objects.
ParameterMap
A map that can contain a mapping of a parameter name (a String) to a parameter.
ParameterMapIterator
An iterator to a map relating a parameter name (the key, a String) to a parameter.
ParameterSet
A set that contains parameters.
ParameterSetIterator
An iterator to a parameter set.
ParameterValue
 A class that holds a value of a parameter element.
ParameterValueProvider
 Gets the value of a parameter from any element passed to getStringValue, getDoubleValue, getIntegerValue, or getElementIdValue.
Part
 This element represents a part of another element.
PartMaker
 PartMaker is an element which takes some source elements (e.g., a wall with all its layers) and creates one or more Parts out of it. The logic according to which these Parts are created is non-trivial and PartMaker uses various PartMakerMethods which represents these logics. This element manages the strategy to make Part elements for one or more original elements.
PartMakerMethodToDivideVolumes
 By-References dividing strategy used by PartMaker element.
PartUtils
 General Part utility methods
Path3d
Provides access to the Generic 3D path object in Autodesk Revit.
PerformanceAdviser
 The tool to report performance problems in a given document.
PerformanceAdviserRuleId
 The unique identifier of a PerformanceAdviserRule
PerformanceAdviserRules
Provides a container of all Revit built-in PerformanceAdviserRuleId instances.
Phase
Represents a phase in the life of a building.
PhaseArray
An array that contains phase objects.
PhaseArrayIterator
An iterator to a phase array.
PhaseFilter
 Represents an phase filter within Autodesk Revit.
PlanarFace
A planar face of a 3d solid.
PlanCircuit
An object that represents an enclosed area in a plan view within the Autodesk Revit project.
PlanCircuitSet
A set that can contain any number of plan circuit objects.
PlanCircuitSetIterator
An iterator to a set of plan circuit objects.
Plane
 A Planar surface.
PlanTopology
An object that represents a Plan Topology within the Autodesk Revit project.
PlanTopologySet
A set that can contain any number of plan topology objects.
PlanTopologySetIterator
An iterator to a set of plan topology objects.
PlanViewRange
 This class represents the view range of a plan view or a plan region. It records the element ids of the levels which a plane is relative to and the offset of each plane from that level.
Point
A 3D point.
PointCloudInstance
 Represents a single instance of a point cloud in the Revit document.
PointCloudType
 Represents a type of point cloud loaded into a Revit document. Each PointCloudType maps to a single file or identifier (depending upon the type of Point Cloud Engine which governs it).
PointElementReference
Base class for objects defining a way to constrain a ReferencePoint to one or more other objects in a document.
PointLocationOnCurve
 Defines the measurement parameters necessary to create a point at a specific location on a curve.
PointNode
 An output node that represents a 3D point.
PointOnEdge
Define a ReferencePoint relative to a referenceable edge or curve on another element.
PointOnEdgeEdgeIntersection
Define a ReferencePoint at the intersection of two referenceable lines.
PointOnEdgeFaceIntersection
Define a ReferencePoint at the intersection of a referenceable edge or curve and a referenceable face.
PointOnFace
Define a ReferencePoint relative to a Face.
PointOnPlane
Define a ReferencePoint relative to a planar reference.
PointRelativeToPoint
Represents a point placed relative to another point.
PolyLine
A polyline.
PolylineNode
 An output node that represents a 3D polyline.
PolylineSegments
 An output node that represents a tessellated polyline segments.
PolymeshFacet
 A class representing one triangular piece - a facet - in a polymesh topology.
PolymeshTopology
 A class representing topology of a polymesh.
PrimaryDesignOptionMemberFilter
 A filter used to find elements contained in any primary design option of any design option set.
PrimarySizeCriterion
 This class contains a size criterion for a RoutingPreferenceRule.
PrintManager
The PrintManager object is used to configure the global print settings.
PrintParameters
An object that contains settings used for printing the document.
PrintSetting
Represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
PrintSetup
Represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
Profile
A geometric profile consisting of a loop of curves.
ProjectInfo
An object that represents a Project Information within the Autodesk Revit project.
ProjectLocation
An object that represents a named location in a project.
ProjectLocationSet
An set that contains project locations.
ProjectLocationSetIterator
An iterator to a project location set.
ProjectPosition
An object that is used to represent a geographical offset and rotation.
PropertyLine
Represents kinds of PropertyLines.
PropertySetElement
 An element that groups together a set of related parameters.
PropertySetLibrary |  Obsolete.
 A named collection of property sets.
RadialArray
 An object that represents an Array created along a circle arc within the Revit project.
Reference
A stable reference to a geometric object in a Revit model.
ReferenceableViewUtils
 Utilities related to reference views such as reference sections and reference callouts.
ReferenceArray
An array that contains reference objects.
ReferenceArrayArray
An array that contains ReferenceArray objects.
ReferenceArrayArrayIterator
An iterator to a ReferenceArray array.
ReferenceArrayIterator
An iterator to a reference array.
ReferenceIntersector
 A class used to find and return elements that intersect a ray created from an origin point and direction.
ReferencePlane
 Represents a reference plane of Autodesk Revit.
ReferencePoint
A reference point in an Autodesk Revit family.
ReferencePointArray
An array that contains reference objects.
ReferencePointArrayIterator
An iterator to a reference array.
ReferenceWithContext
 An object including a reference to a geometric object and related context, as instance transform etc.
RelinquishedItems
 List of elements and worksets that were relinquished by the current user.
RelinquishOptions
 Options to control behavior of relinquishing ownership of elements and worksets.
ReloadLatestOptions
 Options to control behavior of pure reload latest (not part of synchronize with central).
RenderingImageExposureSettings
 Represents the exposure settings of rendering.
RenderingQualitySettings
 Represents the quality settings of rendering.
RenderingSettings
 Represents the rendering settings for a 3d view.
RenderNode
 This is a base class representing a render node in a model-exporting process.
RepeaterBounds
 Represents bounds of the array of repeating references in 0, 1, or 2 dimensions. (See RepeatingReferenceSource).
RepeaterCoordinates
 Represents coordinates in the array of repeating references in 0, 1, or 2 dimensions.
RepeatingReferenceSource
 Represents a collection of repeating references.
Revision
 Represents a single revision in the project.
RevisionCloud
 A RevisionCloud is a graphical "cloud" that can be displayed on a view or sheet to indicate where revisions in the model have occurred.
RevisionSettings
 Provides access to project-wide settings related to revisions.
RevitLinkInstance
 Represents an instance of a RevitLinkType.
RevitLinkLoadResult
 This class stores the results of trying to load a single linked model.
RevitLinkOperations
 This class is used to extend the IExternalResourceServer interface with methods to support operations specifically related to Revit links.
RevitLinkOptions
 This class contains the options in use when creating or loading a Revit link.
RevitLinkType
 This class represents another Revit Document ("link") brought into the current one ("host").
Revolution
A revolution solid or void form.
RevolvedFace
A revolved face of a 3d solid.
RoofBase
Represents all kinds of Roofs.
RoofType
 Represents a specific type of roof.
RoutingCondition
 RoutingCondition represents routing information that is used as input when determining if a routing criterion, such as minimum or maximum diameter, is met.
RoutingConditions
 RoutingConditions contain routing information that is used as input when determining if a routing criterion, such as minimum or maximum diameter, is met.
RoutingCriterionBase
 RoutingCriteriaBase is the base class for all routing criteria.
RoutingPreferenceManager
 Manages default pipe segments, fittings, and selection criteria for a given MEPCurveType
RoutingPreferenceRule
 A class representing a rule set in MEP routing preferences.
RPCNode
 This is a class representing an RPC content in a model-exporting process.
RuledFace
A ruled face of a 3d solid.
SATExportOptions
 The export options used by exporting SAT format file. So far, there is no option in it.
SATImportOptions
 The import options used to import SAT format files.
SaveAsOptions
 This class contains options available for saving a document to disk with a new filename.
SaveOptions
 This class contains options available for saving a document to disk.
SchedulableField
 A non-calculated field eligible to be included in a schedule.
ScheduleDefinition
 Settings that define the contents of a schedule.
ScheduleField
 A field in a schedule.
ScheduleFieldId
The ScheduleFieldId object is used as a unique identification for a field in a schedule.
ScheduleFilter
 A filter in a schedule.
ScheduleSheetInstance
 An element that represents a particular placement of a schedule on a sheet.
ScheduleSortGroupField
 A field that is used for sorting and/or grouping in a schedule.
Segment
 This element represents a segment of an MEP curve object.
SelectionFilterElement
 A filter element that stores an explicit list of ElementIds. Only elements whose ElementIds are in this list will pass the filter.
ServerPath
 This class represents a path to a Revit Server location, rather than a location on disk or a network drive.
Settings
The settings object provides access to general components of the Autodesk Revit application, such as Categories.
ShapeBuilder
 The base class for geometry builder classes.
SharedParameterApplicableRule
 Tests whether an element supports a shared parameter.
SharedParameterElement
 An element that stores the definition of a shared parameter which is loaded into the document.
SiteLocation
Contains the geographical location information for the project's site.
Sketch
Provides access to the Sketch in Autodesk Revit.
SketchBase
Provides access to the SketchBase in Autodesk Revit.
SketchPlane
 Represents a sketch plane or work plane.
SKPImportOptions
 The import options used to import SKP format files.
SkyBackgroundSettings
 Represents the rendering sky background settings.
SlabEdge
An object that represents a slab edge within the Autodesk Revit project.
SlabEdgeType
An object that represents the slab edge type in Autodesk Revit.
SlabShapeCrease
A crease used in Slab Shape Editing.
SlabShapeCreaseArray
An array that can contain any number of creases used in Slab Shape Editing.
SlabShapeCreaseArrayIterator
An iterator to an array of creases used for Slab Shape Editing.
SlabShapeEditor
An object used for Slab Shape Editing.
SlabShapeVertex
A vertex used in Slab Shape Editing.
SlabShapeVertexArray
An array that can contain any number of vertices used in Slab Shape Editing.
SlabShapeVertexArrayIterator
An iterator to an array of vertices used for Slab Shape Editing.
Solid
A 3d solid.
SolidCurveIntersection
 This class represents the results of a calculation of intersection between a solid volume and a curve.
SolidCurveIntersectionOptions
 This class contains the options used to calculate the intersection between a solid and a curve.
SolidOptions
 A class containing optional information to control the properties of the Solid generated by the GeometryCreationUtilities routines.
SolidOrShellTessellationControls
 Controls various aspects of the triangulation produced by SolutUtils::tessellateSolidOrShell.
SolidSolidCutUtils
 Exposes utilities which can cause one solid to cut another.
SolidUtils
 Contains utility functions for solid operations.
SpacingRule
A rule for specifying a set of equidistant, parallel gridlines within a region.
SpatialElement
Represents an enclosed area or volume in the Revit model. This is the parent class for rooms, spaces and areas.
SpatialElementBoundaryOptions
 Options that can be passed to a SpatialElementBoundaryCalculator to influence the results of the calculation.
SpatialElementBoundarySubface
 SpatialElementBoundarySubface represents the geometry boundary information of spatial element.
SpatialElementCalculationLocation
 The Spatial Element Calculation Location is used to specify the room/space where an element should be considered as placed.
SpatialElementCalculationPoint
 SpatialElementCalculationPoint is used as the search point for family instances placement inside rooms and spaces.
SpatialElementFromToCalculationPoints
 SpatialElementFromToCalculationPoints is used to specify the search points for a family instance which connects two rooms or spaces, such as a door or window. The points determine which room or space is considered the "from" and which is considered the "to".
SpatialElementGeometryCalculator
 Use this class to calculate the geometry of a spatial element and obtain the relationships between the geometry and the element's boundary elements.
SpatialElementGeometryResults
 The results of spatial element geometry calculation.
SpatialElementTag
A tag attached to an SpatialElement (room, space or area) in Autodesk Revit.
SpotDimension
 An object that represents a spot dimension within the Revit project.
SpotDimensionType
 A type element containing the properties of a spot elevation.
StairsEditScope
 StairsEditScope allows user to maintain a stairs-editing session.
StartingViewSettings
 The initial view settings for a document dictate which view will initially be open when this model is opened. These settings are available for all Revit project documents.
StringParameterValue
 A class that holds a String value of a parameter element.
StructuralAsset
 Represents the properties of a material pertinent to structural analysis.
SubTransaction
 Sub-transactions are objects that provide control over a subset of changes in a document.
SunAndShadowSettings
 The SunAndShadowSettings class represents the sun control.
Surface
 This is a base class for all Revit surface types. It defines methods common to all surfaces.
Sweep
A sweep solid or void form.
SweepProfile
Represents a profile for sweep or swept blend elements.
SweptBlend
A swept blend solid or void form.
SweptProfile
 Represents an extruded profile swept along a driving curve.
SymbolicCurve
A curve that provides information but is not intended to represent actual geometry in an element.
SymbolicCurveArray
An array that contains model curves.
SymbolicCurveArrayIterator
An iterator to a model curve array.
SynchronizeWithCentralOptions
 Options to control behavior of synchronization with central.
TableCellCalculatedValueData
 The TableCellCalculatedValueData stores the data for calculated value
TableCellCombinedParameterData
 The TableCellCombinedParameterData stores the data for combined parameters
TableCellStyle
 The TableCellStyle class contains the appearance settings for a given table cell, column, or table.
TableCellStyleOverrideOptions
 This helper class represents the overridden characteristics of the associated cell.
TableData
 The TableData class is implemented to hold most of the data that describe the style of the rows, columns, and cells in a table.
TableMergedCell
 The TableMergedCell class defines a merged area of the upper-left and lower-right of a table grid.
TableSectionData
 The TableSectionData class represents a serialized version of an instance of section table data. The class holds row, column and cell data.
TableView
 This represents a view that shows a table. Most of the layout data for the table is contained in the TableData class.
TemporaryViewModes
 A data structure containing data related to temporary view modes.
TessellatedBuildIssue
 Types of issues encountered while constructing geometrical objects from the tessellated face sets.
TessellatedFace
 Defines a planar face bounded by a polyline in 3d space. A face consists of a single connected component and can have holes.
TessellatedShapeBuilder
 A class that permits structured building of geometry or a mesh from a collection of connected faces. Contains all closed face sets and custom precisions.
TessellatedShapeBuilderResult
 Describes what TessellatedShapeBuilder has construct.
TextElement
 Base class representing text elements in Revit.
TextElementType
An object that represents a text style.
TextNode
 This is a class representing a text annotation object in a model-exporting process.
TextNote
 A class representing text note annotations in Revit.
TextNoteOptions
 Options to use when creating a new text note element.
TextNoteType
An object that represents a text note style.
ThermalAsset
 Represents the properties of a material pertinent to energy analysis.
ThermalProperties
 Class specific to thermal properties for assembly types, such as Wall, Floor, Ceiling, Roof and Building Pad.
TilePattern
An object representing a tile pattern that may be applied to a DividedSurface.
TilePatterns
The TilePatterns object is an interface for retrieving the TilePattern objects within the Document.
Transaction
 Transactions are context-like objects that guard any changes made to a Revit model
TransactionGroup
 Transaction groups aggregate a number of transactions.
TransactWithCentralOptions
 Options to customize Revit behavior when accessing the central model.
Transform
A transformation of the affine 3-space.
TransmissionData
 A class representing information on all external file references in a document.
TriangleInShellComponent
 This class represents a triangle in a TriangulatedShellComponent object. The triangle is defined by its vertices, which are specified by their indices in the TriangulatedShellComponent's array of vertices.
TriangulatedShellComponent
 This class represents a triangulated boundary component of a solid or a triangulated connected component of a shell.
TriangulatedSolidOrShell
 This class represents a triangulated solid or shell.
TriangulationInterface
 This abstract class provides an interface for querying a triangulation structure (vertices and triangles).
TriangulationInterfaceForTriangulatedShellComponent
 This class is used to call FacetingUtils::convertTrianglesToQuads with a triangulation defined by a TriangulatedShellComponent.
TriangulationInterfaceForTriangulatedSolidOrShell
 This class is used to call FacetingUtils::convertTrianglesToQuads with a triangulation defined by a TriangulatedSolidOrShell.
TriOrQuadFacet
 This class represents a triangle or quadrilateral in a faceted structure.
TypeBinding
TypeBinding objects are used to bind a property to a Revit type, such as a wall type.
UnitFormatUtils
 A utility class for formatting and parsing numbers with units.
Units
 A document's default settings for formatting numbers with units.
UnitUtils
 A utility class of functions related to units.
UpdaterData
 Service class that is passed to an Updater to prove access to update execution context
UpdaterId
 A unique identifier of an Updater
UpdaterInfo
 Information of an updater, such as: Name, AdditionalInformation, name of the application that owns the updater, etc.
UpdaterRegistry
 An object that stores and manages all updaters registered in the current session.
UV
Object representing coordinates in 2-dimensional space.
ValueAtPointBase
 A base class representing storage of values at a given point.
ValueParsingOptions
 Options for parsing strings into numbers with units.
VertexIndexPair
Represents a connection between vertices in the top and bottom profile of a blend.
VertexIndexPairArray
An array that contains VertexIndex pairs.
VertexIndexPairArrayIterator
An iterator to an array of VertexIndex pairs.
VertexPair
 Indices of a pair of vertices in two CurveLoops(one vertex in each loop).
View
 Base class for all types of views in Autodesk Revit.
View3D
 Class for 3D views
ViewCropRegionShapeManager
 A class that provides access to settings related to the crop assigned to a view or a reference callout.
ViewDisplayBackground
 Set of values that control how background is drawn in a view. Background can only be set for a 3d view or for a section or elevation view.
ViewDisplayModel
 Represents the settings for displaying model graphics. version 2: m_showHiddenLines type changed bool -> ShowHiddenLinesValues::Enum
ViewDisplaySketchyLines
 Represents the settings for sketchy lines.
ViewDrafting
 ViewDrafting represents a drafting view within the model.
ViewFamilyType
 Represents a type of a Revit view.
ViewNavigationToolSettings
 Represents the settings contained in the document associated to the View Navigation tools (such as the View Cube).
ViewNode
 A render node that represents a view.
ViewOrientation3D
 Container for the point and vectors which define View3D's orientation.
ViewPlan
 Class for plan views
Viewport
 An element that establishes the placement of a view on a sheet.
ViewSchedule
 A schedule view.
ViewScheduleExportOptions
 The export options used to export schedule views.
ViewSection
 ViewSection covers sections, details, elevations, and callouts, all in their reference and non-reference variations.
ViewSet
A set that contains views.
ViewSetIterator
An iterator to a view set.
ViewShapeBuilder
 Builds and verifies a view-specific shape representation that would typically be stored in a DirectShape object. Currently limited to curve-based representations for plan and elevation views.
ViewSheet
 Class for ViewSheet
ViewSheetSet
Represents ViewSheetSets stored in a document. ViewSheetSets can be stored so that the same printing task can be executed multiple times.
ViewSheetSetting
Represents the View/Sheet Set (Application Menu->Print) within Autodesk Revit.
Wall
 Represents a wall in Autodesk Revit.
WallFoundation
 An object that represents a wall foundation element.
WallFoundationType
 An object that represents the type of a wall foundation in Autodesk Revit.
WallSweep
 Represents a wall sweep or reveal.
WallSweepInfo
 Represents a wall sweep or reveal of a vertically compound structure.
WallType
 Represents a specific type of wall, such as 'Generic -8" '.
WallUtils
 General Wall utility methods
WireframeBuilder
 Constructs a shape representation consisting of points and curves. That shape would typically be stored in a DirectShape or a DirectShapeType object.
Workset
 Represents a workset in the document.
WorksetConfiguration
 A configuration class that is passed in to methods that open Revit documents to specify which user-created worksets are opened/closed.
WorksetDefaultVisibilitySettings
 An object that manages default visibility of worksets in a document.
WorksetFilter
 A base class for a type of filter that accepts or rejects worksets based upon criteria.
WorksetId
 WorksetId identifies a workset within a single document.
WorksetKindFilter
 A filter used to match worksets of the given WorksetKind.
WorksetPreview
 Represents an accessor for workset data which can be obtained from an unopened document.
WorksetTable
 A table containing references to all the worksets contained in a document.
WorksharingDisplayGraphicSettings
 Represents the graphical settings that can be assigned to elements in the worksharing display modes.
WorksharingDisplaySettings
 WorksharingDisplaySettings controls how elements will appear when they are displayed in any of the worksharing display modes.
WorksharingSaveAsOptions
 This class contains options specific to worksharing SaveAs.
WorksharingTooltipInfo
 Worksharing information about a single element suitable for display in an in-canvas tooltip.
WorksharingUtils
 A static class that contains utility functions related to worksharing.
XYZ
Object representing coordinates in 3-dimensional space.
Structures
Structure | Description
GridNode
A structure that represents a particular location in (U,V) from a grid.
Interfaces
Interface | Description
ICentralLockedCallback
 An interface that may be used to control Revit's behavior when it tries to lock central and is blocked because another user already has locked central.
IConnector
An interface which provides access to connector in Autodesk Revit MEP document.
IDataConversionMonitor
 A base class for an application-specific logger. It should be used to track errors during conversion and/or , track conversion progress, cancel a conversion process if necessary. Implementing a logger class is optional, but highly recommended for all but most basic data converters. The base class is UI- and language-independent. It is up to the using app to implement UI. Language-specifc data may be used to communicate information to application users. English should be used to communicate data of interest to Revit development.
IDuplicateTypeNamesHandler
 An interface for custom handlers of duplicate type names encountered during a paste operation. When the destination document contains types that have the same names as the types being copied, but different internals, a decision must be made on how to proceed - whether to cancel the operation or continue, but only copy types with unique names.
IExportContext
 An interface that is used in custom export to process a Revit model.
IExtension
An interface that supports the additional operation for Extension Status
IExternalDBApplication
An interface that supports addition of DB-level external applications to Revit, to subscribe to DB-level events and updaters.
IExternalResourceServer
IFailuresPreprocessor
 An interface that may be used to perform a preprocessing step to either filter out anticipated transaction failures or to mark certain failures as non-continuable.
IFailuresProcessor
 To create your own UI or fully automated tool to process Revit Failures, derive a class from this interface.
IFamilyLoadOptions
 An interface class which provide the callback for family load options.
IGetLocalPathForOpenCallback
 The interface used to provide custom support for the "Open (and Unload)" command for Revit Links obtained as external resources.
IModelExportContext
 An interface that is used in custom export to export 3D views of a Revit model.
INavisworksExporter
 The interface used to implement a Navisworks exporter.
IOnLocalLinkSharedCoordinatesSavedCallback
 A callback for notifying an IExternalResourceServer that shared coordinates changes have been saved back to one of the Revit links provided by that server.
IPerformanceAdviserRule
 Base class to derive specific performance adviser rules from.
IPhotoRenderContext
 An interface that is used in custom export to render 3D views of a Revit model.
IPrintSetting
An interface which represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
ISaveSharedCoordinatesCallback
 An interface that may be used to control Revit when trying to unload or reload a Revit link with changes in shared coordinates.
ISaveSharedCoordinatesCallbackForUnloadLocally
 An interface that is used to control Revit when trying to unload locally a Revit link with changes in shared coordinates.
ITransactionFinalizer
 An interface that may be used to perform a custom action at the end of a transaction. A method of the interface will be called when a transaction is either committed or rolled back.
IUpdater
 The interface used to create an updater capable of reacting to changes in the Revit model.
IViewSheetSet
This interface represents a selected set of views/sheets which will be used for printing.
Enumerations
Enumeration | Description
ACADVersion
 An enumerated type listing available AutoCAD versions, into which a file may be exported.
ACAObjectPreference
 An enumerated type listing possible ways to generate geometry of an ACA object Revit object parameters used to generate geometry of the exported ACA object. Revit object geometry is used to generate geometry of the exported ACA object. That may produce better geometric fidelity in some cases.
AdaptivePointConstraintType
 An enumerated type containing possible constraint types for Adaptive Points.
AdaptivePointOrientationType
 An enumerated type containing possible orientation types for Adaptive Points.
AdaptivePointType
 An enumerated type containing possible types for Adaptive Points.
AllowedValues
 A range of allowed values.
AlternateUnits
 An enumerated type listing the locations where Alternate units may be displayed in dimensions.
AnalyzesAsType
 This enum class is used for the BuiltInParameter STRUCTURAL_ANALYZES_AS.
AreaElemType
An enumerated type to store type of AreaElement.
ArrayAnchorMember
 Represents the possible choices for how the translation or rotation is used to place each member of the array.
AssemblyDetailViewOrientation
 Orientation of the Assembly Detail View.
AttachmentType
 Enum determining whether a link is an attachment or an overlay
AutomaticConnectionBehaviorType
 Defines behavior of connector with respect to automatic creation of connections
BackgroundImageFit
 Indicates the background image fit type in rendering settings.
BackgroundStyle
 Indicates the background style in rendering settings.
BaseLoadOn
An enumerated type listing all the possible power load use types for a space object.
BeamSystemJustifyType
Describes the justify method of beamsystem.
BehaviorType
 An enumerated type listing all the behavior type for MEP Components.
BooleanOperationsType
 An enumerated type listing boolean types that are supported for boolean operation.
BorderTile
Options for controlling tiles that overlap the face boundary. See DividedSurface.
BoxPlacement
An enumerated type listing possible placement of a box (an object of rectangular shape).
BrowserOrganizationType
 Enumerated type representing the type of browser organization.
BuildingType
An enumerated type listing all of the built-in parameter groups supported by Autodesk Revit.
BuiltInCategory
 A list of all the built in categories within Revit.
BuiltInParameter
An enumerated type listing all of the built-in parameter IDs supported by Autodesk Revit.
BuiltInParameterGroup
An enumerated type listing all of the built-in parameter groups supported by Autodesk Revit.
CategoryType
 The type of category.
CellType
 Declares the cell data type.
ChangePriority
 Enum used to specify the priority of an Updater during execution.
CheckoutStatus
 Indicates the ownership status of an element
ColorDepthType
An enumerated type listing all Color Depth types of Print Setting.
ColumnAttachmentCutStyle
 Control the handling of columns that intersect their targets.
ColumnAttachmentJustification
 Control the column extent in cases where the target is not a uniform height.
ComponentRotation
ComponentRotation property of DividedSurface. See DividedSurface.
CompoundStructureDeckUsage
Describes how the deck relates to the surrounding layers.
CompoundStructureError
 When CompoundStructure::isValid() returns false, it uses these values to indicate precise nature of defect.
CompoundStructureLayerFunction
Describes the purpose of the layer within a compound structure, such as a wall or floor.
ConnectionResolution
 An enumerated type listing all the possible resolutions for connectivity validation.
ConnectionWarning
 An enumerated type listing all the reasons for connectivity failure.
ConnectorDomainType
 Type of connector domain.
ConnectorGenderType
 Connector gender type enum
ConnectorJointType
 Connector joint type enum
ConnectorProfileType
 An enumerated type listing all connector profile types
ConnectorType
 An enumerated type listing all connector types for a connection
ControlShape
An enumerated type listing four shapes of control that Autodesk Revit supports.
CoordinatePlaneVisibility
 Visibility settings for ReferencePoint element's coordinate reference planes.
CurtainGridAlignType
An enumerated to list CurtainGrid patterns.
CurveElementType
 An enumerated type listing the curve element types that can be used when filtering elements (via CurveElementFilter).
CurveProjectionType
 This attribute indicates how the curve will be projected to the surface if the curve is sketched on the surface.
CutFailureReason
 The reason why a solid-solid cut cannot be created.
DataExchangeMessageId
 Predefined message ids for DataExchangeLog.
DataExchangeMessageSeverity
 Error levels for DataExchangeLog
DataExchangeMessageVerbosity
 Predefined verbosity levels for DataExchangeLog
DatumEnds
 An enumerated type representing ends of a datum plane.
DatumExtentType
 Represents the type of datum extent that is displayed in a particular view.
DecimalSymbol
 The symbol used to separate the integer and fractional parts of a number.
DetachFromCentralOption
 Options for workset detachment behavior.
DGNFileFormat
 An enumerated type listing available Microstation versions into which a file may be exported.
DigitGroupingAmount
 The number of digits in each group when numbers are formatted with digit grouping.
DigitGroupingSymbol
 The symbol used to separate groups of digits when numbers are formatted with digit grouping.
DimensionShape
An enumerated type to list dimension type.
DimensionStyleType
 An enumerated type containing possible style types of dimensions.
DirectShapeReferencingOption
 An enumerated type containing possible referencing options for DirectShapes.
DirectShapeRoomBoundingOption
 An enumerated type containing possible room bounding settings for DirectShapes.
DirectShapeTargetViewType
 View types for which DirectShape objects are allowed to have alternative shape representations
DisplacementPathStyle
 Used to control the graphical representation of a DisplacementPath element.
DisplayStyle
 Display type of the view.
DisplayUnit
Describes the type of Revit display unit, metric or imperial.
DisplayUnitType
 The units and display format used to format numbers as strings. Also used for unit conversions.
DistanceMeasuredFrom
 Indicates if the distance is measured from the top or bottom of the wall.
DistributionOfNormals
 An enumeration containing the choices of how normal vectors are assigned and distributed along the surface of a polymesh. Planar faces would typically have only normal vector associated, but curved faces can have a different normal either for each facet (triangle) or each point of the tessellated polymesh.
DividedPathMeasurementType
 DividedPath measurement type.
DocumentType
 Types of Revit documents.
Domain
 Type of connector domain.
DuplicateTypeAction
 This enumerated type defines the action to be taken when there are types with the same name being pasted.
DWFImageFormat
An enumerated type listing possible image format for DWF Export.
DWFImageQuality
An enumerated type listing possible image quality for DWF Export.
EaveCutterType
An enumerated type to store type of EaveCutter.
ElementOnPhaseStatus
 The statuses that an element can have with respect to a given phase.
ElementReferenceType
Element reference types.
ElementTypeGroup
 The element type group.
EndCapCondition
 Used by CompoundStructure to describe which shell layers participate in end wrapping.
ExportColorMode
 An enumerated type listing export color mode.
ExportColumnHeaders
 Options for exporting column headers in schedule view export.
ExportEnergyModelType
 This enum is used to define if energy model used for gbXML export should be based on rooms/spaces or building elements.
ExportPaperFormat
Paper formats supported by DWF export
ExportRange
 This enum is used to define what view, part of the view, or list of views will be exported.
ExportSheetType
 An enumerated type listing possible Sheet type.
ExportTextQualifier
 Options for the text qualifier character in schedule view export.
ExportUnit
 An enumerated type listing possible target units for CAD Export.
ExternalDBApplicationResult
Informs Autodesk Revit of the status of your external db application after execution.
ExternalFileReferenceType
 Enum class indicating kinds of external file references
ExternalResourceLoadStatus
 A flag to indicate the status of an ExternalResource load request.
ExternalResourceUIBrowseResultType
 Describes the type of external resource browsing result.
ExtrusionAnalyzerFaceAlignment
 Indicates whether a face of the solid analyzed by ExtrusionAnalyzer is fully aligned, partially aligned, or unaligned with faces of the extrusion.
FabricationDimensionType
 Fabrication dimension type.
FabricationDimensionUnitType
 Fabrication dimension unit type.
FaceIntersectionFaceResult
 An enumerated type listing the possible results of a face-face intersection calculation.
FailureProcessingResult
 An enumerated type representing the result achieved by any of the available types of failure handlers: FailuresPreprocessor, the handler of FailuresProcessing event or a FailuresProcessor.
FailureResolutionType
 Enumeration to classify FailureResolutions by nature of operation they perform on failing Elements.
FailureSeverity
 Enum represents severity of a failure.
FamilyElementVisibilityType
Indicates the Visibility type of generic forms.
FamilyHostingBehavior
 Types of hosts into/onto which a family can be hosted. For informative purposes only. Does not affect anything in Revit!
FamilyPlacementType
 The type of placement required for a given family.
FamilySizeTableErrorType
 The set of errors that can be returned when importing a FamilySizeTable from a CSV file.
FamilySource
 Describes which version of the family to be loaded.
FilledRegionBackground
 The filled region background types.
FillPatternHostOrientation
 The types of orientations for fill patterns.
FillPatternTarget
 The type of the fill pattern.
FindReferenceTarget
 The type of reference to find from a ReferenceIntersector.
FitDirectionType
 This enum is used to define the direction to fit the number of pixels defined by PixelSize.
FittingAndAccessoryCalculationType
 The MEP fitting and accessory pressure drop calculation type.
FittingAngleUsage
 An enumerated type representing the options for how to limit the angle values applicable to fitting content.
FloorFace
 An enumerated type listing floor face types (top or bottom)
FlowDirectionType
 An enumerated type listing direction types for a connector.
GraphicsStyleType
Describes the type of graphics style.
GridNodeLocation
Location of a grid node relative to the face boundary. See DividedSurface.
GridSegmentDirection
 Specify one of the four adjacent segments to a GridNode. See DividedSurface.
HiddenLineViewsType
An enumerated type listing all Hidden Line Views types of Print Setting.
HorizontalAlign
Horizontal alignment of model text.
HorizontalAlignmentStyle
 Declares the horizontal alignment style of font.
HorizontalTextAlignment
 Supported kinds of text horizontal alignment within the text containing box.
IFCVersion
 An enumerated type listing available IFC file versions into which a file may be exported.
ImageFileType
 This enum is used to define exported file type.
ImageResolution
 This enum is used to define image resolution in order to calculate the image size.
ImportColorMode
 An enumerated type listing how colors are handled in an import process.
ImportExportFileFormat
 Describes formats supported by import / export.
ImportPlacement
 An enumerated type listing possible placement modes for imported drawings.
ImportUnit
 An enumerated type listing possible target units for CAD Import.
JoinType
The type of join at the end of an element. The join type affects only the graphic treatment, i.e. cleaning of the end, not the physical join behavior.
JunctionType
An enumerated type listing all the junction types for MEP curve types.
KeyBasedTreeEntryErrorType
 An Enum indicating the type of error associated with a KeyBasedTreeEntry.
LayerCategoryType
 An enumerated type listing category types supported in an ExportLayerTable.
LeaderAtachement
 Supported kinds of vertical attachments of a leader to a text note.
LeaderEndCondition
 An enumerated type listing Leader end conditions that are supported for IndependentTags.
LeaderShape
 Supported geometric shapes of annotation leaders.
LightingSource
 Indicates the lighting scheme type in rendering settings.
LinePatternSegmentType
 Represents the type of a line pattern segment.
LineScaling
 An enumerated type listing possible LineType scaling modes.
LinkedFileStatus
 Enum displaying the loaded status of a linked file
LoadOperationType
 An enum indicating whether a resource load operation was triggered by a user action or an automatic process.
MarginType
An enumerated type listing all Margin types of Print Setting.
MassDisplayTemporaryOverrideType
 This enum identifies the mass display overrides.
MaterialAspect
 A list of all material aspects that a material can store PropertySetElements for.
MaterialFunctionAssignment
 Used in class CompoundStructure to specify the function of a layer.
MaterialPropertyPathType
 Enum class indicating kinds of paths which ExternalFileReferenceType.Material references can have.
MEPSystemClassification
 This enumeration is used to classify MEP connectors and systems and drives certain behavior for a particular system type
MeshFromGeometryOperationIssue
 Issues encountered while constructing meshes as fallbacks for geometrical operations.
ModelUpdatesStatus
 Indicates whether an element in the current model has additional user changes in the central model.
ModifierType
 An enumerated type listing options to appear in the exported layer name.
NavisworksCoordinates
 An enumerated type listing possible Coordinates of Navisworks Exporter.
NavisworksExportScope
 An enumerated type listing possible "Element Scopes" of Navisworks Exporter.
NavisworksParameters
 An enumerated type listing possible "Parameter conversions" of Navisworks Exporter.
NumberSystemDisplayRule
 The available options for display of numeric values in the number system.
NumberSystemJustifyOption
 The available options for justification of the numbers in a number system.
OpeningWrappingCondition
 Used by CompoundStructure to describe which shell layers participate in wrapping at openings.
OverridePermissions
 Types of overrides that can be applied to a category.
PageOrientationType
An enumerated type listing all Page Orientation types of Print Setting.
PaperPlacementType
An enumerated type listing all Paper Placement types of Print Setting.
ParametersOrder
 The order of the parameters.
ParameterType
 An enumerated type listing all of the data type interpretation that Autodesk Revit supports.
PartEdgeConditionOrientation
 Relative orientation of the right/lower and left/upper edge condition profiles.
PartsVisibility
 Indicates the visibility of parts for the view.
PartType
 An enumerated type listing all MEP family part types. A part type typically provides one unique set of type parameters that defines this part.
PathType
 Enum determining what kind of path a given external file reference path is. Paths are valid for all types of external file references unless otherwise specified.
PhaseStatusPresentation
 An enumerated type listing the options for element display in a phase filter.
PlanViewDirection
 This enumerated type represents the possible directions for a plan view.
PlanViewPlane
 Locations where view range offsets can be specified.
PlanViewRangeError
 Describes errors in the location of planes in a PlanViewRange object.
PlanViewRangeLevel
 An enumerated type representing the options for seting the range for a plan view.
PointCloudColorMode
 Color mode of a point cloud or part of a point cloud
PointCloudFoundStatus
 Enumerated type representing the possible states related to searching for a point cloud file.
PointOnCurveMeasureFrom
 Point on curve MeasureFrom - It tells from which end of the host curve the point location is measured.
PointOnCurveMeasurementType
 Point on curve measurement type Defines the types of measurements that may be used when placing a point at a designated distance along a curve.
PreferredJunctionType
 Enumerated type representing the possible options for the preferred junction for a routine preference rule.
PreviewFamilyVisibilityMode
PrinterResolution
 Controls the resolution level in rendering settings.
PrintRange
An enumerated type listing all Print Range types of Print.
ProfileFamilyUsage
 An enumerated type listing all types of profile families.
ProfilePlaneLocation
Indicates the location of Sweep profile plane on the path curve.
PropOverrideMode
 An enumerated type listing ways how overridden object styles get exported.
RasterQualityType
An enumerated type listing the options for raster quality.
RectangularGridSegmentOrientation
 The orientation type of rectangular grid segment.
ReferenceType
Reference types of curve element.
RenderEngine
 Controls Render Engine in use
RenderingQuality
 Indicates the rendering quality in rendering settings.
RenderNodeAction
 Enumerated actions for processing a render node during custom export.
ResolutionTarget
 Indicates the resolution target(Screen or Printer) used for rendering settings.
ResourceVersionStatus
 An enum indicating whether a resource is current or out of date.
RevisionNumbering
 The options for how revision numbers should be displayed on sheets within a project.
RevisionNumberType
 Determines how a particular revision will be numbered.
RevisionVisibility
 Determines whether Revision Clouds and Revision Tags will be visible in the project.
RevitLinkLoadResultType
 Enum listing the possible results after loading a linked model.
RoundingMethod
 Rounding methods
RoutingPreferenceErrorLevel
 An enumerated type listing the options for posting errors or warnings when routing preferences are not satisfied.
RoutingPreferenceRuleGroupType
 Add more rule group type here.
SaveModifiedLinksOptions
 Class giving options when saving linked files which have been modified in-memory by shared coordinates operations.
SaveModifiedLinksOptionsForUnloadLocally
 Class giving options when saving linked files which are unloaded locally and have been modified in-memory by shared coordinates operations.
ScheduleFieldType
 The type of data displayed in a schedule field.
ScheduleFilterType
 Type of schedule filter.
ScheduleHeadingOrientation
 Orientation of schedule heading.
ScheduleHorizontalAlignment
 Horizontal alignment of data in a schedule.
ScheduleSortOrder
 Options for sort order of rows in a schedule.
SectionType
 Declares the section data type.
SelectionFilterAction
 An enumerated type containing the type of actions that may be taken with a selection filter applied to a point cloud.
ServiceType
An enumerated type listing all of the built-in parameter groups supported by Autodesk Revit.
SetComparisonResult
An enumerated type listing all the relationship types between two sets of arbitrary nature.
ShellLayerType
 Used to distinguish exterior and interior shell layers.
ShowHiddenLinesValues
 Provides options for display of hidden lines in a given view.
SimpleWorksetConfiguration
 Indicates the set of user-created worksets to open in memory
SlabShapeCreaseType
An enumerated type listing all Crease types of Slab Shape Edit.
SlabShapeVertexType
An enumerated type listing all Vertex types of Slab Shape Edit.
SlantedOrVerticalColumnType
 This enum class is used for the BuiltInParameter SLANTED_COLUMN_TYPE_PARAM.
SolidCurveIntersectionMode
 Represents the types of results available for calculating the intersection between a solid and a curve.
SolidGeometry
 An enumerated type listing possible ways of exporting solids in 3D views.
SortingOrder
 Enumerated type representing the sorting order of a collection of objects.
SpacingRuleJustification
 Justification property of spacing rule
SpacingRuleLayout
 Rules for laying out a series of equidistant points or parallel lines
SpatialElementBoundaryLocation
 An enumerated type listing boundary options of spatial element geometry calculation.
SpatialElementType
 An enumerated type listing types of spaces.
SpecialType
 An enumerated type listing special types that can appear in an ExportLayerTable. These types do not represent an independent category in Revit, but can be mapped to specific layers on export.
StickSymbolLocation
 Indicates the stick symbol location on the UI, which is used for the BuiltInParameter STRUCTURAL_STICK_SYMBOL_LOCATION.
StorageType
 An enumerated type listing all of the internal parameter data storage types that Autodesk Revit supports.
StructDeckEmbeddingType
 Used in class CompoundStructure to specify the usage of a layer whose function is StructuralDeck.
StructuralAssetClass
 Represents the type of material described by a structural asset. This enum value is returned by Autodesk::Revit::DB::StructuralAsset::StructuralAssetClass.
StructuralBehavior
 Specifies whether structural elements behave orthotropically, isotropically, or transverse-isotropically.
StructuralReleaseType
 Type of structural release, which is used for the BuiltIn parameter STRUCTURAL_END_RELEASE_TYPE.
SubfaceType
 Meaning of a subface's type.
SunAndShadowType
 Sun study type enum of SunAndShadowSettings.
SunStudyTimeInterval
 Time interval enum for a single or multi-day sun study.
TagMode
 An enumerated type listing tag mode that are supported for IndependentTags.
TagOrientation
 An enumerated type listing tag orientation options that are supported by IndependentTags.
TemporaryViewMode
 Enumeration to represent the various temporary view modes a view can be in.
TessellatedBuildIssueType
 Types of issues encountered while constructing geometrical objects from the tessellatted face sets.
TessellatedShapeBuilderFallback
 Describes what TessellatedShapeBuilder function should do, if it cannot build a requested TessellatedShapeBuilderTarget.
TessellatedShapeBuilderOutcome
 Describes the outcome of TessellatedShapeBuilder attempt to build geometrical objects.
TessellatedShapeBuilderTarget
 Describes what TessellatedShapeBuilder should generate, if possible.
TextAlignFlags
An enumerated type listing all the Text align flags.
TextAlignMask
An enumerated type listing all the Text align mask.
TextBaselineStyle
 Supported styles of text position relative to the normal baseline.
TextElementBackground
An enumerated type listing all the background mode for the built-in parameter TEXT_BACKGROUND.
TextListStyle
 Supported styles of text list paragraphs.
TextNoteLeaderStyles
An enumerated type listing all the Leader styles.
TextNoteLeaderTypes
 Types of text-note leaders
TextTreatment
 An enumerated type listing possible text treatment modes.
ThermalMaterialType
 Represents the thermal material type.
TilePatternsBuiltIn
Revit's built-in tile patterns. See TilePattern.
TransactionStatus
 An enumerated type listing the possible statuses associated with a Transaction, TransactionGroup, or SubTransaction, or the result of a particular method call on one of those objects.
TransmittedModelOptions
 Enum giving desired behavior when opening or saving a transmitted workshared model.
UnderlayOrientation
 Indicates how elements in the underlay are viewed.
UnitGroup
 A group of related unit types, primarily classified by discipline.
UnitSymbolType
 The unit symbol displayed in the formatted string representation of a number to indicate the units of the value.
UnitSystem
 A system of measurement: Metric or Imperial units.
UnitType
 The type of physical quantity to be measured, for example length or force.
UVGridlineType
 A choice between U-gridlines or V-gridlines of a divided surface U Gridlines V Gridlines
ValueAtPointFlags
 Enumerated type containing flags related to the display on particular points. Enumerated type that stores bit values of flags that can be set at any domain point.
VerticalAlignmentStyle
 Declares the vertical alignment style of font.
VerticalTextAlignment
 Supported kinds of text vertical alignment within the text containing box.
ViewDetailLevel
 Detail level of the view
ViewDiscipline
 Discipline of the view
ViewDisplayBackgroundImageFlags
 A collection of bit flags that control how the background image is positioned in relation to the crop region (or the view boundary).
ViewDisplayBackgroundType
 A collection of settings defining the type of the view background
ViewDisplayEdges
 A collection of settings defining how visible edges are displayed
ViewDuplicateOption
 Options for duplicating views
ViewFamily
 An enumerated type that corresponds to the type of a Revit view.
ViewPlanType
An enumerated type listing plan view types.
ViewportRotation
 Rotation of the viewport
ViewTemplateApplicationOption
 Options for applying view templates
ViewType
An enumerated type listing available view types.
VirtualPrinterType
An enumerated to list Virtual Printer Types in Revit.
Visibility
Describes the visibility of a particular geometry object.
WallFunction
 Indicates the function of a specified WallType, as specified in the parameter FUNCTION_PARAM on the WallType.
WallKind
 Describes the fundamental type of wall, such as curtain wall or stacked wall.
WallLocationLine
 This enumerated type represents the options for alignment of a wall's location line.
WallSide
 Represents the possible sides of a wall where a sweep or reveal may be attached.
WallSweepType
 Represents the possible types for methods affecting wall sweeps or reveals.
WorksetConfigurationOption
 A collection of options used to initialize a WorksetConfiguration.
WorksetKind
 Indicates one of the standard kinds of workset (as available in the UI).
WorksetVisibility
 Indicates the visibility settings of a workset in a particular view.
WorksharingDisplayMode
 Indicates which worksharing display mode a view is in.
ZoomFitType
 This enum is used to define type of zoom.
ZoomType
An enumerated type listing all Zoom types of Print Setting.