Revit 2016 API
LoadUsageArrayIterator Methods
The LoadUsageArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
See Also
LoadUsageArrayIterator Class
Autodesk.Revit.DB.Structure Namespace