Revit 2016 API
TextElement Members
The TextElement type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Align |  Obsolete.
Alignment attributes of the text.
BaseDirection
 Direction of the base line of the text element.
Coord
 Position of the text (in model coordinates.)
Height
 Height of the area of the text content.
HorizontalAlignment
 Horizontal alignment of the text content within the text area of the element.
IsTextWrappingActive
 A flag identifying whether text-wrapping is currently active in this text element or not.
KeepRotatedTextReadable
 A flag to control how text behaves inside a rotated text element.
LineWidth |  Obsolete.
 Width of widest line of the text element
Symbol
Get the type of the TextElement object.
Text
 The content of the element as a plain string stripped of all formating.
UpDirection
 Direction along the vertical axis of letters of the text note.
VerticalAlignment
 Vertical alignment of the text content within the text area of the element.
Width
 Width of the area of the text content.
See Also
TextElement Class
Autodesk.Revit.DB Namespace