Revit 2016 API
BoundaryConditions Members
The BoundaryConditions type exposes the following members.
Methods
Name | Description
associateWithLoad |  Obsolete.
Sets the Autodesk::Revit::DB::ElementId^ of Load to associate.
GetBoundaryConditionsType
 Returns the boundary conditions type.
GetCurve
 Returns curve that define geometry of the line boundary conditions.
GetDegreesOfFreedomCoordinateSystem
 Gets the origin and rotation of coordinate system that is used by translation and rotation parameters, like X Translation or Z Rotation.
GetLoops
 Returns curve loops that define geometry of the area boundary conditions.
GetOrientTo
 Returns the boundary conditions orientation option.
SetOrientTo
 Sets the boundary condition orientation option.
Properties
Name | Description
AssociatedLoad |  Obsolete.
Retrieve the AssociatedLoad.
AssociatedLoadId
 The Id of the internal load element associated with a boundary conditions.
Curve |  Obsolete.
Returns the geometric curve within a geometric loop that defines the area.
HostElement
 The host element for the boundary conditions.
HostElementId
 The host element Id for the boundary conditions.
NumCurves |  Obsolete.
Returns the number of curves represent the Boundary Conditions Element.
Point
 Returns the position of point boundary conditions.
See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace