Revit 2016 API
LoadCombination Properties
The LoadCombination type exposes the following members.
Properties
Name | Description
CombinationCaseName |  Obsolete.
Returns load combination case name.
CombinationNatureName |  Obsolete.
Returns load combination nature name of load case element.
CombinationState |  Obsolete.
Returns load combination state.
CombinationStateIndex |  Obsolete.
Returns the index in predefined load combination state array {}.
CombinationType |  Obsolete.
Returns load combination type.
CombinationTypeIndex |  Obsolete.
Returns the index in predefined load combination type array.
Factor |  Obsolete.
Returns factor value.
IsThirdPartyGenerated
 Indicates if the load combination was created by API.
NumberOfComponents |  Obsolete.
Returns number of factors.
NumberOfUsages |  Obsolete.
Returns number of usages.
State
 The state of the load combination.
Type
 The type of the load combination.
UsageName |  Obsolete.
Returns usage value.
See Also
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace