Revit 2016 API
UIView Members
The UIView type exposes the following members.
Methods
Name | Description
Close
Closes the view.
Dispose
Releases all resources used by the UIView
GetWindowRectangle
Gets the rectangle containing the coordinates of the view's drawing area.
GetZoomCorners
Gets the corners of the view's rectangle.
Zoom
Zoom the view.
ZoomAndCenterRectangle
Zoom and center the view to a specified rectangle.
ZoomSheetSize
Zoom to the sheet size.
ZoomToFit
Zoom the view to fit its contents.
Properties
Name | Description
ViewId
The id of the View associated with a UIView.
See Also
UIView Class
Autodesk.Revit.UI Namespace