Revit 2016 API
CurveElement Methods
The CurveElement type exposes the following members.
Methods
Name | Description
GetLineStyleIds
Retrieves the set of available line style Element Ids.
SetGeometryCurve
SetSketchPlaneAndCurve
See Also
CurveElement Class
Autodesk.Revit.DB Namespace