Revit 2016 API
LoadCaseSetIterator Members
The LoadCaseSetIterator type exposes the following members.
Constructors
Name | Description
LoadCaseSetIterator
Initializes a new instance of the LoadCaseSetIterator class
Methods
Name | Description
MoveNext
Reset
Properties
Name | Description
Current
See Also
LoadCaseSetIterator Class
Autodesk.Revit.DB.Structure Namespace