Revit 2016 API
LoadUsageArray Methods
The LoadUsageArray type exposes the following members.
Methods
Name | Description
Append
Add the load usage to the end of the array.
Clear
Removes every load usage from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified load usage into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
See Also
LoadUsageArray Class
Autodesk.Revit.DB.Structure Namespace