Revit 2016 API
Floor Properties
The Floor type exposes the following members.
Properties
Name | Description
FloorType
Retrieves/set an object that represents the type of the floor.
SlabShapeEditor
Get the SlabShapeEditor used for slab shape editing.
SpanDirectionAngle
Retrieve the span direction angle of the floor
StructuralUsage |  Obsolete.
The floors designated structural usage, such as bearing or non bearing.
See Also
Floor Class
Autodesk.Revit.DB Namespace