Revit 2016 API
LoadCase Members
The LoadCase type exposes the following members.
Methods
Name | Description
Create
 Creates a new LoadCase.
Properties
Name | Description
NatureCategory
 The nature category of the load case.
NatureId
 The nature of the load case.
Number
 Returns the load case number.
See Also
LoadCase Class
Autodesk.Revit.DB.Structure Namespace