Revit 2016 API
LoadCombinationArray Members
The LoadCombinationArray type exposes the following members.
Constructors
Name | Description
LoadCombinationArray
Initializes a new instance of the LoadCombinationArray class
Methods
Name | Description
Append
Clear
Removes every item from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets an item at a specified index within the array.
Size
Returns the number of objects that are in the array.
See Also
LoadCombinationArray Class
Autodesk.Revit.DB.Structure Namespace