Revit 2016 API
ControlledApplication Properties
The ControlledApplication type exposes the following members.
Properties
Name | Description
ActiveAddInId
Retrieves the Id of the currently running external application.
AllUsersAddinsLocation
 The folder location for .addin files for all users.
Cities
Returns a set of all the known city locations within Revit.
Create
Provides an object that can be used to create new instances of Autodesk Revit API objects.
CurrentUserAddinsLocation
 The folder location for .addin files for the current user.
IsLateAddinLoading
 Indicates whether this add-in is loaded on the fly or not. If it is loaded when is Revit starting up, it is false, otherwise it should be true.
IsQuiescent |  Obsolete.
 Returns if the current application is quiescent.
Language
The language used in the current session of Revit.
Product
 The product type for the current session of Revit.
RecordingJournalFilename
 Retrieve the name of the journal file the Revit is currently recording to.
SharedParametersFilename
Contains the fully qualified path to a shared parameters file.
VersionBuild
 Returns the internal build number of the Autodesk Revit application.
VersionName
 Returns the name of the Revit application.
VersionNumber
 Return the primary version of the Revit application.
See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace