Revit 2016 API
LoadCaseSet Members
The LoadCaseSet type exposes the following members.
Constructors
Name | Description
LoadCaseSet
Initializes a new instance of the LoadCaseSet class
Methods
Name | Description
Clear
Contains
Erase
ForwardIterator
GetEnumerator
Insert
ReverseIterator
Properties
Name | Description
IsEmpty
Size
See Also
LoadCaseSet Class
Autodesk.Revit.DB.Structure Namespace