Revit 2016 API
WallFoundation Properties
The WallFoundation type exposes the following members.
Properties
Name | Description
FootingType |  Obsolete.
Retrieves an object that represents the type of the footing.
WallId
 Returns the host wall Id.
See Also
WallFoundation Class
Autodesk.Revit.DB Namespace