Revit 2016 API
PipeFittingAndAccessoryConnectorData Methods
The PipeFittingAndAccessoryConnectorData type exposes the following members.
Methods
Name | Description
Dispose
See Also
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace