Revit 2016 API
SkyBackgroundSettings Properties
The SkyBackgroundSettings type exposes the following members.
Properties
Name | Description
VisibilityDistance
 The visibility distance of sky background.
See Also
SkyBackgroundSettings Class
Autodesk.Revit.DB Namespace