Revit 2016 API
DGNExportOptions Members
The DGNExportOptions type exposes the following members.
Constructors
Name | Description
DGNExportOptions()
 Constructs a new instance of DGNExportOptions with default values of all properties.
DGNExportOptions(DGNExportOptions)
 Constructs a new instance of DGNExportOptions as a copy of the export options.
Methods
Name | Description
GetExportLineweightTable
 Gets a copy of the line weight table.
GetPredefinedOptions
 Returns an instance DGNExportOptions containing settings from a predefined export setup.
SetExportLineweightTable
 Sets the line weight table to use during export.
Properties
Name | Description
FileVersion
 The DGN file version. Default value of fileVersion is DGNFileFormat.Default.
MasterUnits
 The master units. Default value of masterUnits is true.
MergedViews
 Whether to merge all views in one file (via XRefs). Default value of mergedViews is false.
SeedName
 The name of the DGN seed. Default value of seedName is empty.
See Also
DGNExportOptions Class
Autodesk.Revit.DB Namespace