Revit 2016 API
FabricationRodInfo Methods
The FabricationRodInfo type exposes the following members.
Methods
Name | Description
AttachToStructure
 Attaches to the nearest structural element.
Dispose
GetRodAttachedElementId
 Gets the id of the attached component for the specified rod.
GetRodEndPosition
 Gets the position of the rod end.
See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace