Revit 2016 API
RenderingQualitySettings Members
The RenderingQualitySettings type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RenderingQualitySettings
Properties
Name | Description
AreCurtainWallsDaylightPortals
 Indicates whether curtain walls daylight portals.
AreDoorsDaylightPortals
 Indicates whether doors daylight portals.
AreShadowsEnabled
 Indicates whether to make shadow edges soft(blurred).
AreWindowsDaylightPortals
 Indicates whether windows daylight portals.
BlurredReflectionPrecision
 The blurred reflections precision.
BlurredRefractionPrecision
 The blurred refractions precision.
ImagePrecision
 A value that controls how antialiasing is applied to the background image.
IndirectIlluminationBounces
 The indirect illumination bounces value.
IndirectIlluminationPrecision
 The indirect illumination precision value.
IndirectIlluminationSmoothness
 The indirect illumination smoothness value.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MaxReflections
 The maximum number of reflections.
MaxRefractions
 The maximum number of refractions.
RenderingQuality
 The quality applied for rendering.
ShouldComputeIndirectAndSkyIllumination
 Indicates whether to include light that bounces off other objects, and light from the sky when calculating the lighting for this scene.
SoftShadowsPrecision
 The soft shadows precision value.
See Also
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace