Revit 2016 API
BoundaryConditions Properties
The BoundaryConditions type exposes the following members.
Properties
Name | Description
AssociatedLoad |  Obsolete.
Retrieve the AssociatedLoad.
AssociatedLoadId
 The Id of the internal load element associated with a boundary conditions.
Curve |  Obsolete.
Returns the geometric curve within a geometric loop that defines the area.
HostElement
 The host element for the boundary conditions.
HostElementId
 The host element Id for the boundary conditions.
NumCurves |  Obsolete.
Returns the number of curves represent the Boundary Conditions Element.
Point
 Returns the position of point boundary conditions.
See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace