Revit 2016 API
Face Members
The Face type exposes the following members.
Methods
Name | Description
ComputeDerivatives
Returns the vectors describing the face at the specified point.
ComputeNormal
Returns the normal vector for the face at the given point.
ComputeSecondDerivatives
Returns the second partial derivatives of the face at the specified point.
Evaluate
Evaluates parameters on the face.
GetBoundingBox
Returns the UV bounding box of the face.
GetEdgesAsCurveLoops
Returns a list of closed curve loops that correspond to the edge loops of the face. Curves in each curve loop correspond to individual edges.
GetRegions
Face regions (created with the Split Face command) of the face.
Intersect(Curve)
Calculates the intersection of the specified curve with this face.
Intersect(Face)
Calculates the intersection of the specified face with this face and returns the intersection results.
Intersect(Curve, IntersectionResultArray)
Calculates the intersection of the specified curve with this face and returns the intersection results.
Intersect(Face, Curve)
Calculates the intersection of the specified face with this face and returns the intersection results.
IsInside(UV)
Indicates whether the specified point is within this face.
IsInside(UV, IntersectionResult)
Indicates whether the specified point is within this face and outputs additional results.
Project
Projects the specified point on this face.
Triangulate()
Returns a triangular mesh approximation to the face.
Triangulate(Double)
Returns a triangular mesh approximation to the face.
Properties
Name | Description
Area
The area of this face.
EdgeLoops
Each edge loop is a closed boundary of the face.
HasRegions
Reports if the face contains regions created with the Split Face command.
IsCyclic
The boolean value that indicates whether this face is periodic in the specified parametric direction.
IsTwoSided
Determines if a face is two-sided (degenerate)
MaterialElementId
Element ID of the material from which this face is composed.
Period
The period of this face in the specified parametric direction.
Reference
Returns a stable reference to the face.
See Also
Face Class
Autodesk.Revit.DB Namespace