Revit 2016 API
PlanarFace Members
The PlanarFace type exposes the following members.
Methods
Name | Description
Properties
Name | Description
FaceNormal
Normal of the planar face.
Normal |  Obsolete.
Normal of the planar surface.
Origin
Origin of the surface.
Vector |  Obsolete.
Defining vectors of the surface.
XVector
The X-vector of the planar face.
YVector
The Y-vector of the planar face.
See Also
PlanarFace Class
Autodesk.Revit.DB Namespace