Revit 2016 API
DialogBoxShowingEventArgs Properties
The DialogBoxShowingEventArgs type exposes the following members.
Properties
Name | Description
HelpId
 An ID that represents the dialog that has been displayed.
See Also
DialogBoxShowingEventArgs Class
Autodesk.Revit.UI.Events Namespace