Revit 2016 API
PointLoad Properties
The PointLoad type exposes the following members.
Properties
Name | Description
Force |  Obsolete.
 Returns the three dimensional force applied to the point load.
ForceVector
 The force vector applied to the point load, oriented according to OrientTo setting.
Moment |  Obsolete.
 Returns the three dimensional moment applied to the point load.
MomentVector
 The moment vector applied to the point load, oriented according to OrientTo setting.
Point
 Returns the position of point load, measured in decimal feet.
See Also
PointLoad Class
Autodesk.Revit.DB.Structure Namespace