Revit 2016 API
LoadUsageArray Members
The LoadUsageArray type exposes the following members.
Constructors
Name | Description
LoadUsageArray
Initializes a new instance of the LoadUsageArray class
Methods
Name | Description
Append
Add the load usage to the end of the array.
Clear
Removes every load usage from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified load usage into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets an load usage at a specified index within the array.
Size
Returns the number of load usages that are in the array.
See Also
LoadUsageArray Class
Autodesk.Revit.DB.Structure Namespace