Revit 2016 API
RevitLinkInstance Methods
The RevitLinkInstance type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of a linked Revit project (RevitLinkType).
GetLinkDocument
 The document associated with the Revit link.
MoveBasePointToHostBasePoint
MoveOriginToHostOrigin
See Also
RevitLinkInstance Class
Autodesk.Revit.DB Namespace