Revit 2016 API
RuledFace Properties
The RuledFace type exposes the following members.
Properties
Name | Description
Curve
Profile curves of the surface.
Point
Profile points of the surface.
RulingsAreParallel
Determines if the rulings of this ruled surface are parallel.
See Also
RuledFace Class
Autodesk.Revit.DB Namespace