Revit 2016 API
TableCellCombinedParameterData Methods
The TableCellCombinedParameterData type exposes the following members.
Methods
Name | Description
Dispose
See Also
TableCellCombinedParameterData Class
Autodesk.Revit.DB Namespace