Revit 2016 API
LoadCombinationArray Properties
The LoadCombinationArray type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets an item at a specified index within the array.
Size
Returns the number of objects that are in the array.
See Also
LoadCombinationArray Class
Autodesk.Revit.DB.Structure Namespace