Revit 2016 API
FabricationRodInfo Members
The FabricationRodInfo type exposes the following members.
Methods
Name | Description
AttachToStructure
 Attaches to the nearest structural element.
Dispose
Releases all resources used by the FabricationRodInfo
GetRodAttachedElementId
 Gets the id of the attached component for the specified rod.
GetRodEndPosition
 Gets the position of the rod end.
Properties
Name | Description
IsAttachedToStructure
 Checks if the hanger is attached to structure.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
RodCount
 Gets the number of rods.
See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace