Revit 2016 API
LoadCase Methods
The LoadCase type exposes the following members.
Methods
Name | Description
Create
 Creates a new LoadCase.
See Also
LoadCase Class
Autodesk.Revit.DB.Structure Namespace