Revit 2016 API
RoomTag Members
The RoomTag type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Room
The room that the tag is associated with.
RoomTagType
The tag type.
See Also
RoomTag Class
Autodesk.Revit.DB.Architecture Namespace