Revit 2016 API
LoadCaseArrayIterator Members
The LoadCaseArrayIterator type exposes the following members.
Constructors
Name | Description
LoadCaseArrayIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
LoadCaseArrayIterator Class
Autodesk.Revit.DB.Structure Namespace