Revit 2016 API
NurbSpline Methods
The NurbSpline type exposes the following members.
Methods
Name | Description
Create(IList<XYZ>, IList<Double>)
 Creates a new geometric NurbSpline object using the same calculations that Revit uses when sketching splines in the user interface.
Create(IList<XYZ>, IList<Double>, IList<Double>, Int32, Boolean, Boolean)
 Creates a new geometric NURBSpline object.
SetControlPointsAndWeights
Set the control points, weights simultaneously.
See Also
NurbSpline Class
Autodesk.Revit.DB Namespace