Revit 2016 API
FabricRoundingManager Members
The FabricRoundingManager type exposes the following members.
Methods
Name | Description
Properties
Name | Description
ApplicableReinforcementRoundingSource
 Identifies the source of the rounding settings for this element.
ApplicableTotalLengthRounding
 The applicable rounding for Cut Overall Length and Cut Overall Width parameters.
ApplicableTotalLengthRoundingMethod
 The applicable rounding method for Cut Overall Length and Cut Overall Width parameters.
TotalLengthRounding
 The rounding for Cut Overall Length and Cut Overall Width parameters.
TotalLengthRoundingMethod
 Identifies the total length rounding method
See Also
FabricRoundingManager Class
Autodesk.Revit.DB.Structure Namespace