Revit 2016 API
FabricSheet Properties
The FabricSheet type exposes the following members.
Properties
Name | Description
BendFinalLoopOrientationVector
 Direction of local Fabric Sheet Y axis in bending polyline LCS.
BentFabricBendDirection
 Specifies which wire direction of the fabric sheet is bent.
BentFabricLongitudinalCutLength
 Specifies the cut length of the fabric sheet perpendicular to the bend edge.
BentFabricWiresOrientation
 Specifies the placement of the non-bent bars in the fabric sheet.
CoverOffset
 The additional cover offset of the Fabric Sheet.
CutOverallLength
 The sheet length after cutting has taken place.
CutOverallWidth
 The sheet length after cutting has taken place.
CutSheetMass
 The sheet mass after cutting has taken place.
FabricAreaOwnerId
 The Fabric Area Id.
FabricHostReference
 Controls if Single Fabric Sheet should be cut by the Host Cover
FabricLocation
 The Fabric Sheet location in the host.
HostId
 The structure element that contains the Fabric Sheet.
IsBent
 The type of fabric sheet. True for bent fabric sheet, false for flat fabric sheet.
SketchId
 The id of the Sketch element for this element.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace