Revit 2016 API
LoadCombinationArrayIterator Properties
The LoadCombinationArrayIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
LoadCombinationArrayIterator Class
Autodesk.Revit.DB.Structure Namespace