Revit 2016 API
ObjectFactory Members
The ObjectFactory type exposes the following members.
Constructors
Name | Description
ObjectFactory
 For Internal Use Only.
Methods
Name | Description
Dispose
For Internal Use Only.
See Also
ObjectFactory Class
Autodesk.Revit.DB Namespace