Revit 2016 API
WallFoundation Members
The WallFoundation type exposes the following members.
Methods
Name | Description
GetFoundationType
 Gets an object that represents the type of the foundation.
SetFoundationType
 Sets an object that represents the type of the foundation.
Properties
Name | Description
FootingType |  Obsolete.
Retrieves an object that represents the type of the footing.
WallId
 Returns the host wall Id.
See Also
WallFoundation Class
Autodesk.Revit.DB Namespace