Revit 2016 API
FabricationConfigurationInfo Methods
The FabricationConfigurationInfo type exposes the following members.
Methods
Name | Description
Dispose
FindSourceFabricationConfiguration
 Finds the source fabrication configuration on disk which matches the input fabrication configuration.
GetAllFabricationConfigurations
 Gets all added fabrication configurations.
IsValid
 Checks if the fabrication configuration is valid.
See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace