Revit 2016 API
RebarShape Methods
The RebarShape type exposes the following members.
Methods
Name | Description
Create
 Create a new instance of a Rebar Shape, which defines the shape of a rebar.
GetAllowed
 Check whether a bar type can be used with this RebarShape. Bar types are allowed by default.
GetCurvesForBrowser
 Generate curves for the shape, as used in the shape browser.
GetDefaultHookAngle
 Get the hook angle, expressed as an integral number of degrees (common values are 0, 90, 135, and 180).
GetDefaultHookOrientation
 Get the hook orientation.
GetMultiplanarDefinition
 The optional 3D structure of the shape.
GetRebarShapeDefinition
 Return the definition of the RebarShape.
IsSameShapeIgnoringHooks
 Test whether two shapes have equivalent definitions by comparing the RebarShapeDefinition and MultiplanarDefinition properties.
SetAllowed
 Specify which bar types can be used with this RebarShape. Bar types are allowed by default.
See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace