Revit 2016 API
InternalDefinition Properties
The InternalDefinition type exposes the following members.
Properties
Name | Description
BuiltInParameter
 Identifies if the parameter is a BuiltIn parameter.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
The user-visible name for the parameter.
 (Overrides Definition.Name.)
ParameterGroup
 Returns the group ID of the parameter definition.
 (Overrides Definition.ParameterGroup.)
ParameterType
Returns the user-visible interpretation of the parameter data.
 (Overrides Definition.ParameterType.)
VariesAcrossGroups
Whether or not the parameter values can vary across group members.
Visible
Indicates if the parameter is visible in the Autodesk Revit user interface.
See Also
InternalDefinition Class
Autodesk.Revit.DB Namespace