Revit 2016 API
TextNote Members
The TextNote type exposes the following members.
Methods
Name | Description
AddLeader
 Adds a leader to the text note.
Create(Document, ElementId, XYZ, String, ElementId)
 Creates a new unwrapped text note element with the given properties.
Create(Document, ElementId, XYZ, String, TextNoteOptions)
 Creates a new unwrapped text note element with the given properties.
Create(Document, ElementId, XYZ, Double, String, ElementId)
 Creates a new line-wrapping text note element of the given width and properties.
Create(Document, ElementId, XYZ, Double, String, TextNoteOptions)
 Creates a new line-wrapping text note element of the given width and properties.
GetLeaders
 Returns a collection of leaders currently attached to the text note.
RemoveLeaders
 Removes all leaders currently attached to the text note.
Properties
Name | Description
LeaderCount
 Number of leader objects currently attached to the text note.
LeaderLeftAttachment
 Attachment position of leaders on the left side of the text note.
LeaderRightAttachment
 Attachment position of leaders on the right side of the text note.
Leaders |  Obsolete.
Retrieves all leaders currently attached to the TextNote object.
TextNoteType
Access the type of the TextNote object.
See Also
TextNote Class
Autodesk.Revit.DB Namespace