Revit 2016 API
LoadCombinationArrayIterator Methods
The LoadCombinationArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
See Also
LoadCombinationArrayIterator Class
Autodesk.Revit.DB.Structure Namespace