Revit 2016 API
PointCloudOverrides Methods
The PointCloudOverrides type exposes the following members.
Methods
Name | Description
ArePointCloudOverrideSettingsValid
 Checks if PointCloudOverrideSettings are valid
Assign
 Assigns values of the source overrides to this object.
Dispose
GetPointCloudOverrideSettings(ElementId)
 Gets override settings assigned to the whole PointCloudInstance element.
GetPointCloudOverrideSettings(ElementId, String, Document)
 Gets override settings assigned to a particular scan within a PointCloudInstance element.
IsEqual
 Check if the contents of two overrides are equal.
SetPointCloudOverrideSettings(ElementId, PointCloudOverrideSettings)
 Assigns override settings to the whole PointCloudInstance element.
SetPointCloudOverrideSettings(ElementId, PointCloudOverrideSettings, String, Document)
 Assigns override settings to a particular scan within a PointCloudInstance element.
See Also
PointCloudOverrides Class
Autodesk.Revit.DB.PointClouds Namespace