Revit 2016 API
ReferencePlane Properties
The ReferencePlane type exposes the following members.
Properties
Name | Description
BubbleEnd
 The bubble end of the reference plane.
Direction
 The direction of the reference plane.
FreeEnd
 The free end of the reference plane.
Name
The name property of the reference plane.
Normal
 The normal vector of the reference plane.
Plane |  Obsolete.
The geometry plane to which the reference plane is assigned.
Reference |  Obsolete.
The geometry reference of the reference plane.
See Also
ReferencePlane Class
Autodesk.Revit.DB Namespace