Revit 2016 API
ElectricalSetting Properties
The ElectricalSetting type exposes the following members.
Properties
Name | Description
CircuitNamePhaseA
 Circuit Naming by Phase - Phase A Label.
CircuitNamePhaseB
 Circuit Naming by Phase - Phase B Label.
CircuitNamePhaseC
 Circuit Naming by Phase - Phase C Label.
CircuitRating
 The default circuit rating for newly created circuit.
CircuitSequence
 The sequence in which power circuits are created.
DistributionSysTypes
 Get all distribution system types of the project.
VoltageTypes
 Get all voltage type definitions information of the project.
WireConduitTypes
 Get electrical conduit types information of the project.
WireMaterialTypes
 Get electrical wire material types information of the project.
WireTypes
 Get all wire type definition information of the project.
See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace