Revit 2016 API
ReinforcementSettings Methods
The ReinforcementSettings type exposes the following members.
Methods
Name | Description
DocumentContainsNoAreaOrPathReinforcement |  Obsolete.
 Checks whether the document is free of AreaReinforcement and PathReinforcement elements. Only in this case is it permissible to change the HostStructuralRebar property. Only in this case it is allowed to change RebarShapeDefinesHooks property.
DocumentContainsNoRebar |  Obsolete.
 Checks whether the document is free of Rebar elements. Only in this case it is allowed to change RebarShapeDefinesHooks property.
GetFabricRoundingManager
 Returns an object for managing reinforcement rounding override settings used by FabricSheetType and FabricSheet elements.
GetRebarRoundingManager
 Returns an object for managing reinforcement rounding override settings used by RebarBarTypes, Rebar and RebarInSystem elements.
GetReinforcementAbbreviationTag
 Gets one abbreviation tag for desired ReinforcementAbbreviationTagType.
GetReinforcementAbbreviationTags
 Gets a list of abbreviation tags for desired reinforcement object type.
GetReinforcementSettings
 Obtains the ReinforcementSettings object for the specified project document.
IsEqual
 Checks if Reinforcement Settings is equal to other
SetReinforcementAbbreviationTag
 Sets one abbreviation tag for desired ReinforcementAbbreviationTagType.
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace