Revit 2016 API
Grid Methods
The Grid type exposes the following members.
Methods
Name | Description
Create(Document, Arc)
 Creates a new radial grid line.
Create(Document, Line)
 Creates a new grid line.
ExtendToAllLevels |  Obsolete.
 Adjusts the grid to cut all levels.
GetExtents
 Gets the extents of the grid in the model.
SetVerticalExtents
 Adjusts the grid to extend through only the vertical range between bottom and top.
See Also
Grid Class
Autodesk.Revit.DB Namespace