Revit 2016 API
FamilySymbol Methods
The FamilySymbol type exposes the following members.
Methods
Name | Description
Activate
CanHaveStructuralSection
 Identifies if this FamilySymbol can have a structural section.
GetFamilyPointLocations
Returns the Point Locations for the Family Symbol.
GetStructuralSection
 Gets the structural section from element.
GetThermalProperties
 Gets the thermal properties for the given FamilySymbol.
HasStructuralSection |  Obsolete.
 Identifies if this FamilySymbol can have a structural section. This property is deprecated in Revit 2016. Use canHaveStructuralSection instead.
HasThermalProperties
 Identifies if this FamilySymbol can include thermal properties.
SetStructuralSection
 Sets the structural section in element.
SetThermalProperties
 Sets the thermal properties for the given FamilySymbol.
See Also
FamilySymbol Class
Autodesk.Revit.DB Namespace