Revit 2016 API
WallFoundation Methods
The WallFoundation type exposes the following members.
Methods
Name | Description
GetFoundationType
 Gets an object that represents the type of the foundation.
SetFoundationType
 Sets an object that represents the type of the foundation.
See Also
WallFoundation Class
Autodesk.Revit.DB Namespace