Revit 2016 API
SpatialElementTag Properties
The SpatialElementTag type exposes the following members.
Properties
Name | Description
HasLeader
Identifies if a leader is displayed for the tag.
Location
The location of the tag.
 (Overrides Element.Location.)
Name
The name associated with the tag.
 (Overrides Element.Name.)
View
The view in which the tag was placed.
See Also
SpatialElementTag Class
Autodesk.Revit.DB Namespace