Revit 2016 API
BasicFileInfo Members
The BasicFileInfo type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the BasicFileInfo
Extract
 Retrieves basic file data.
GetDocumentVersion
 Gets the DocumentVersion for the file.
Properties
Name | Description
AllLocalChangesSavedToCentral
 Are all local changes saved to the central file?
CentralPath
 Returns the central model path.
IsCentral
 Checks if the file is workshared and Central.
IsCreatedLocal
 Checks if the file is created local.
IsInProgress
 Checks if the file is workshared and is in process of becoming Central.
IsLocal
 Checks if the file is workshared and Local.
IsSavedInCurrentVersion
 Checks if the file is saved in the current version.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
IsWorkshared
 Checks if the file is workshared.
LanguageWhenSaved
 Return the language active for the last save
LatestCentralEpisodeGUID
 This is the central model's episode GUID corresponding to the last reload latest done for this model.
LatestCentralVersion
 This is the central model's version number corresponding to the last reload latest done for this model.
SavedInVersion
 Returns the version in which file is saved.
Username
 Returns the username.
See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace