Revit 2016 API
Face Properties
The Face type exposes the following members.
Properties
Name | Description
Area
The area of this face.
EdgeLoops
Each edge loop is a closed boundary of the face.
HasRegions
Reports if the face contains regions created with the Split Face command.
IsCyclic
The boolean value that indicates whether this face is periodic in the specified parametric direction.
IsTwoSided
Determines if a face is two-sided (degenerate)
MaterialElementId
Element ID of the material from which this face is composed.
Period
The period of this face in the specified parametric direction.
Reference
Returns a stable reference to the face.
See Also
Face Class
Autodesk.Revit.DB Namespace