Revit 2016 API
MechanicalSystem Members
The MechanicalSystem type exposes the following members.
Methods
Name | Description
Create(Document, ElementId)
 Creates a new instance of a mechanical system and adds it to the document.
Create(Document, ElementId, String)
 Creates a new instance of a mechanical system and adds it to the document.
IsPressureDropServerMissing
 Indicates if any pressure drop server which was used in the mechanical system is not available.
Properties
Name | Description
BaseEquipmentConnector
The connector within the base equipment which is used to connect with the system.
DuctNetwork
 The ducts and fittings contained within the system.
Flow
 Indicates the computed total flow for the mechanical system.
IsWellConnected
 Indicates if the system is well connected or not.
StaticPressure
 Indicates the computed static pressure for the mechanical system.
SystemType
The type of this duct system.
See Also
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace