Revit 2016 API
FabricationPartType Methods
The FabricationPartType type exposes the following members.
Methods
Name | Description
Create
 Creates a fabrication part type element based on a specific fabrication service button and condition.
Lookup
 Looks up an existing fabrication part type based on a specific fabrication service button and condition.
See Also
FabricationPartType Class
Autodesk.Revit.DB Namespace