Revit 2016 API
Railing Methods
The Railing type exposes the following members.
Methods
Name | Description
Create
 Automatically creates new railings with the specified railing type on all sides of a stairs element.
Flip
 Flips the railing.
GetHandRails
 Get all the handrails of the railing.
GetPath
 Gets the railing path.
IsValidHostForNewRailing
 Checks whether new railing can be created and placed on the specified host.
RemoveHost
 Removes the association between the railing and its host.
Reset
 Resets the railing to the default one that the system generates.
See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace