Revit 2016 API
LoadCaseArray Members
The LoadCaseArray type exposes the following members.
Constructors
Name | Description
LoadCaseArray
Initializes a new instance of the LoadCaseArray class
Methods
Name | Description
Append
Add the load case to the end of the array.
Clear
Removes every load case from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified load case into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets an load case at a specified index within the array.
Size
Returns the number of load cases that are in the array.
See Also
LoadCaseArray Class
Autodesk.Revit.DB.Structure Namespace