Revit 2016 API
FabricationHostedInfo Methods
The FabricationHostedInfo type exposes the following members.
Methods
Name | Description
DisconnectFromHost
 Disconnects the part from the host.
Dispose
PlaceOnHost
 Places the part on the specified host.
See Also
FabricationHostedInfo Class
Autodesk.Revit.DB Namespace