Revit 2016 API
LoadCaseSetIterator Properties
The LoadCaseSetIterator type exposes the following members.
Properties
Name | Description
Current
See Also
LoadCaseSetIterator Class
Autodesk.Revit.DB.Structure Namespace