Revit 2015 API
GutterTypeSet Properties
The GutterTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of gutter types that are in the set.
See Also
GutterTypeSet Class
Autodesk.Revit.DB.Architecture Namespace