Revit 2015 API
RebarCoverTypeSet Members
The RebarCoverTypeSet type exposes the following members.
Constructors
Name | Description
RebarCoverTypeSet
Initializes a new instance of the RebarCoverTypeSet class
Methods
Name | Description
Clear
Removes every RebarCover type from the set, rendering it empty.
Contains
Tests for the existence of a RebarCover type within the set.
Erase
Removes a specified RebarCover type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified RebarCover type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of RebarCover types that are in the set.
See Also
RebarCoverTypeSet Class
Autodesk.Revit.DB.Structure Namespace