Revit 2015 API
CurtainGridLine Methods
The CurtainGridLine type exposes the following members.
Methods
Name | Description
AddAllSegments
All the segments on this grid line will be added.
AddMullions
 Add mullions on the specified segments of a grid. If any segment already has a mullion, no change is made to that segment.
AddSegment
Add a segment based on the specified segment curve of the gridline.
Move |  Obsolete.
It is used to move unlocked type-driven grid lines or user defined grid lines.
RemoveSegment
Remove the segment specified by the input curve.
See Also
CurtainGridLine Class
Autodesk.Revit.DB Namespace