Revit 2015 API
FloorTypeSet Members
The FloorTypeSet type exposes the following members.
Constructors
Name | Description
FloorTypeSet
Initializes a new instance of the FloorTypeSet class
Methods
Name | Description
Clear
Removes every floor type from the set, rendering it empty.
Contains
Tests for the existence of a floor type within the set.
Erase
Removes a specified floor type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified floor type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of floor types that are in the set.
See Also
FloorTypeSet Class
Autodesk.Revit.DB Namespace