Revit 2015 API
Family Properties
The Family type exposes the following members.
Properties
Name | Description
CurtainPanelHorizontalSpacing
 For Curtain Panel families, the horizontal spacing of the driving mesh.
CurtainPanelTilePattern
 For Curtain Panel families, the choice of tile pattern.
CurtainPanelVerticalSpacing
 For Curtain Panel families, the vertical spacing of the driving mesh.
FamilyCategory
Retrieves or sets a Category object that represents the category or sub category in which the elements ( this family could generate ) reside.
FamilyCategoryId
 The id of the category or sub category in which the elements that this family could generate reside.
FamilyPlacementType
 Identifies the type of placement required by a given family.
IsConceptualMassFamily
 Whether the Family is a Conceptual Mass family.
IsCurtainPanelFamily
 Whether the Family is a Curtain Panel family. Curtain Panel family symbols are used as the ObjectTypes of DividedSurface elements.
IsEditable
 True if the family supports editing, false otherwise.
IsInPlace
 True if the family is an in-place family, false if the family is a loadable family.
IsOwnerFamily
 True if the family is the owner family for its own editable document, false otherwise.
IsUserCreated
 Determine if the family is defined by the user. Some families are created internally and cannot be saved or reloaded. This function should return false.
ShowSpatialElementCalculationPoint
 For families that can have a calculation point for spatial elements, hide or show the calculation point. SpatialElementCalculationPoint elements.
StructuralMaterialType
 The family's structural material type.
StructuralSectionShape
 The family's structural section shape.
Symbols |  Obsolete.
A set of all symbols (types) that belong to a Family.
See Also
Family Class
Autodesk.Revit.DB Namespace