Revit 2015 API
MaterialSet Members
The MaterialSet type exposes the following members.
Constructors
Name | Description
MaterialSet
Initializes a new instance of the MaterialSet class
Methods
Name | Description
Clear
Removes every material from the set, rendering it empty.
Contains
Tests for the existence of a material within the set.
Erase
Removes a specified material from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified material into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of materials that are in the set.
See Also
MaterialSet Class
Autodesk.Revit.DB Namespace