Revit 2015 API
MaterialSet Methods
The MaterialSet type exposes the following members.
Methods
Name | Description
Clear
Removes every material from the set, rendering it empty.
Contains
Tests for the existence of a material within the set.
Erase
Removes a specified material from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified material into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
MaterialSet Class
Autodesk.Revit.DB Namespace