Revit 2015 API
CurtainSystemTypeSet Properties
The CurtainSystemTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of CurtainSystem types that are in the set.
See Also
CurtainSystemTypeSet Class
Autodesk.Revit.DB Namespace