Revit 2015 API
StructuralSectionStructuralTees Properties
The StructuralSectionStructuralTees type exposes the following members.
Properties
Name | Description
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
See Also
StructuralSectionStructuralTees Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace