Revit 2015 API
FabricSheet Methods
The FabricSheet type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of a single Fabric Sheet element within the project.
GetReinforcementRoundingManager
 Returns an object for managing reinforcement rounding override settings.
GetSheetLocation
 Gets the position and the orientation of the Fabric Sheet instance.
GetWireCenterlines()
 Gets a list of curves representing the wires centerlines of the Fabric Sheet in the both distribution directions.
GetWireCenterlines(WireDistributionDirection)
 Gets a list of curves representing the wires centerlines of the Fabric Sheet.
IsCoverOffsetValid
 Identifies if the specified value is valid for use as a cover offset.
IsSingleFabricSheetWithinHost
 Identifies if the specified single Fabric Sheet position is within the host.
PlaceInHost
 Inserts the single Fabric Sheet instance into the host element.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace