Revit 2015 API
StructuralSectionISlopedFlange Members
The StructuralSectionISlopedFlange type exposes the following members.
Methods
Name | Description
Properties
Name | Description
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
See Also
StructuralSectionISlopedFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace