Revit 2015 API
FabricRoundingManager Properties
The FabricRoundingManager type exposes the following members.
Properties
Name | Description
ApplicableReinforcementRoundingSource
 Identifies the source of the rounding settings for this element.
ApplicableTotalLengthRounding
 The applicable rounding for Cut Overall Length and Cut Overall Width parameters.
TotalLengthRounding
 The rounding for Cut Overall Length and Cut Overall Width parameters.
See Also
FabricRoundingManager Class
Autodesk.Revit.DB.Structure Namespace