Revit 2015 API
AreaTagTypeSet Methods
The AreaTagTypeSet type exposes the following members.
Methods
Name | Description
Clear
Removes every areatag type from the set, rendering it empty.
Contains
Tests for the existence of a areatag type within the set.
Erase
Removes a specified areatag type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified areatag type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
AreaTagTypeSet Class
Autodesk.Revit.DB Namespace