Revit 2015 API
RebarHookTypeSetIterator Methods
The RebarHookTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
RebarHookTypeSetIterator Class
Autodesk.Revit.DB.Structure Namespace