Revit 2015 API
TextNoteTypeSet Members
The TextNoteTypeSet type exposes the following members.
Constructors
Name | Description
TextNoteTypeSet
Initializes a new instance of the TextNoteTypeSet class
Methods
Name | Description
Clear
Removes every textnote type from the set, rendering it empty.
Contains
Tests for the existence of a textnote type within the set.
Erase
Removes a specified textnote type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified textnote type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of textnote types that are in the set.
See Also
TextNoteTypeSet Class
Autodesk.Revit.DB Namespace