Revit 2015 API
GridTypeSetIterator Methods
The GridTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
GridTypeSetIterator Class
Autodesk.Revit.DB Namespace