Revit 2015 API
BoundarySegmentArray Methods
The BoundarySegmentArray type exposes the following members.
Methods
Name | Description
Append
Add the boundary segment to the end of the array.
Clear
Removes every boundary segment from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified boundary segment into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
See Also
BoundarySegmentArray Class
Autodesk.Revit.DB.Architecture Namespace