Revit 2015 API
EnergyAnalysisDetailModel Methods
The EnergyAnalysisDetailModel type exposes the following members.
Methods
Name | Description
Create
 Creates a new energy analysis detailed model.
Destroy
 Delete the created analytical model and the analytical elements such as spaces, surfaces, and openings.
Dispose
GetAnalyticalOpenings
 The collection of analytical openings.
GetAnalyticalShadingSurfaces
 The collection of analytical shading surfaces.
GetAnalyticalSpaces
 The collection of analytical spaces.
GetAnalyticalSurfaces
 The collection of analytical surfaces.
TransformModel
 Transforms all surfaces in the model according to the document's active ground plane, shared coordinates and true north.
See Also
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace