Revit 2015 API
Category Methods
The Category type exposes the following members.
Methods
Name | Description
GetGraphicsStyle
Gets the graphics style associated with this category for the given graphics style type.
GetHashCode |  (Overrides Object.GetHashCode().)
GetLineWeight
Retrieves the line weight assigned to the category for the given graphics style type.
SetLineWeight
Sets the line weight for the given graphics style type.
See Also
Category Class
Autodesk.Revit.DB Namespace