Revit 2015 API
Plane Properties
The Plane type exposes the following members.
Properties
Name | Description
Normal
Get the Normal of the plane.
Origin
Get the Origin of the plane.
XVec
Get the XVec of the plane.
YVec
Get the YVec of the plane.
See Also
Plane Class
Autodesk.Revit.DB Namespace