Revit 2015 API
MeshArrayIterator Members
The MeshArrayIterator type exposes the following members.
Constructors
Name | Description
MeshArrayIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
MeshArrayIterator Class
Autodesk.Revit.DB Namespace