Revit 2015 API
BoundaryConditions Methods
The BoundaryConditions type exposes the following members.
Methods
Name | Description
associateWithLoad
Sets the Autodesk::Revit::DB::ElementId^ of Load to associate.
GetBoundaryConditionsType
 Returns the boundary conditions type.
GetDegreesOfFreedomCoordinateSystem
 Gets the origin and rotation of coordinate system that is used by translation and rotation parameters, like X Translation or Z Rotation.
GetOrientTo
 Returns the boundary conditions orientation option.
SetOrientTo
 Sets the boundary condition orientation option.
See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace