Revit 2015 API
LoadCaseSet Properties
The LoadCaseSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of load cases that are in the set.
See Also
LoadCaseSet Class
Autodesk.Revit.DB.Structure Namespace