Revit 2015 API
RoofTypeSet Members
The RoofTypeSet type exposes the following members.
Constructors
Name | Description
RoofTypeSet
Initializes a new instance of the RoofTypeSet class
Methods
Name | Description
Clear
Removes every roof type from the set, rendering it empty.
Contains
Tests for the existence of a roof type within the set.
Erase
Removes a specified roof type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified roof type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of roof types that are in the set.
See Also
RoofTypeSet Class
Autodesk.Revit.DB Namespace