Revit 2015 API
StructuralSectionISlopedFlange Properties
The StructuralSectionISlopedFlange type exposes the following members.
Properties
Name | Description
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
See Also
StructuralSectionISlopedFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace