Revit 2015 API
InstanceArrayIterator Methods
The InstanceArrayIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
See Also
InstanceArrayIterator Class
Autodesk.Revit.DB Namespace