Revit 2015 API
WorksetConfiguration Methods
The WorksetConfiguration type exposes the following members.
Methods
Name | Description
Close
 Sets a group of user-created worksets to close.
CloseAll |  Obsolete.
 Sets the configuration to close user-created worksets by default.
Dispose
Open
 Sets a group of user-created worksets to open.
OpenLastViewed |  Obsolete.
 Sets the configuration to open all user-created worksets that were last recorded to be open; other worksets are not affected.
See Also
WorksetConfiguration Class
Autodesk.Revit.DB Namespace