Revit 2015 API
GeometryObjectArray Members
The GeometryObjectArray type exposes the following members.
Constructors
Name | Description
GeometryObjectArray
Initializes a new instance of the GeometryObjectArray class
Methods
Name | Description
Append
Add the geometry object to the end of the array.
Clear
Removes every geometry object from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified geometry object into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a geometry object at a specified index within the array.
Size
Returns the number of geometry objects that are in the array.
See Also
GeometryObjectArray Class
Autodesk.Revit.DB Namespace