Revit 2015 API
StructuralSectionIWelded Members
The StructuralSectionIWelded type exposes the following members.
Methods
Name | Description
Properties
Name | Description
BottomFlangeThickness
 Bottom Flange Thickness.
BottomFlangeWidth
 Bottom Flange Width.
TopFlangeThickness
 Top Flange Thickness.
TopFlangeWidth
 Top Flange Width.
WebHeight
 Web Height.
WebThickness
 Web Thickness.
See Also
StructuralSectionIWelded Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace