Revit 2015 API
Family Methods
The Family type exposes the following members.
Methods
Name | Description
ExtractPartAtom
 Writes a PartAtom XML from the contents of a family object.
GetFamilySymbolIds
 Gets the ids of the FamilySymbols owned by this Family.
HasStructuralSection
 Identifies if this Family can have a structural section.
IsAppropriateCategoryId
 Identifies if the input category id can be assigned as the new category for this family.
See Also
Family Class
Autodesk.Revit.DB Namespace