Revit 2015 API
SolidArray Methods
The SolidArray type exposes the following members.
Methods
Name | Description
Append
Add the solid to the end of the array.
Clear
Removes every solid from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified solid into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
See Also
SolidArray Class
Autodesk.Revit.DB Namespace