Revit 2015 API
SlabEdgeTypeSet Properties
The SlabEdgeTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of slab edge types that are in the set.
See Also
SlabEdgeTypeSet Class
Autodesk.Revit.DB Namespace