Revit 2015 API
InSessionViewSheetSet Members
The InSessionViewSheetSet type exposes the following members.
Methods
Name | Description
Properties
Name | Description
Views
The views.
See Also
InSessionViewSheetSet Class
Autodesk.Revit.DB Namespace