Revit 2015 API
PointElementReference Members
The PointElementReference type exposes the following members.
Constructors
Name | Description
PointElementReference
Initializes a new instance of the PointElementReference class
Methods
Name | Description
See Also
PointElementReference Class
Autodesk.Revit.DB Namespace