Revit 2015 API
RoofTypeSet Methods
The RoofTypeSet type exposes the following members.
Methods
Name | Description
Clear
Removes every roof type from the set, rendering it empty.
Contains
Tests for the existence of a roof type within the set.
Erase
Removes a specified roof type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified roof type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
RoofTypeSet Class
Autodesk.Revit.DB Namespace