Revit 2015 API
EnergyAnalysisOpening Members
The EnergyAnalysisOpening type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the EnergyAnalysisOpening
GetAnalyticalSurface
 Gets the associative analytical parent surface element.
GetPolyloop
 Gets the planar polygon describing the opening geometry.
Properties
Name | Description
CADLinkUniqueId
 The unique id of the originating CAD object's link (linked document) associated with this opening.
CADObjectUniqueId
 The unique id of the originating CAD object (model element) associated with this opening.
Corner
 The lower-left coordinate for the analytical rectangular geometry viewed from outside.
Height
 The height of the analytical rectangular geometry.
Id
 The unique identifier for the opening.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
 The unique name identifier for the opening.
OpeningType
 The analytical opening type.
OriginatingElementDescription
 The description for the originating Revit element.
OriginatingElementId |  Obsolete.
 The element id for the originating Revit element.
Type
 The gbXML opening type attribute.
Width
 The width of the analytical rectangular geometry.
See Also
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace