Revit 2015 API
IFCTypeInfo Methods
The IFCTypeInfo type exposes the following members.
Methods
Name | Description
Dispose
Get2DMapHandle
 Gets the associated handle to a 2D IfcRepresentationMap for the type.
Get3DMapHandle
 Gets the associated handle to a 3D IfcRepresentationMap for the type.
GetStyle
 Gets the associated handle to an IfcTypeProduct for the type.
GetStyleTransform
 Gets the transform between the coordinate system of the type and the coordinate system of the instance's location in the Revit model.
IsValid
 Identifies if the object represents a valid type info.
Set2DMapHandle
 Sets the associated handle to a 2D IfcRepresentationMap for the type.
Set3DMapHandle
 Sets the associated handle to a 3D IfcRepresentationMap for the type.
SetStyle
 Sets the associated handle to an IfcTypeProduct for the type.
SetStyleTransform
 Sets the transform between the coordinate system of the type and the coordinate system of the instance's location in the Revit model.
See Also
IFCTypeInfo Class
Autodesk.Revit.DB.IFC Namespace