Revit 2015 API
PointLoadTypeSetIterator Properties
The PointLoadTypeSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
PointLoadTypeSetIterator Class
Autodesk.Revit.DB.Structure Namespace