Revit 2015 API
SpaceTagTypeSetIterator Properties
The SpaceTagTypeSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
SpaceTagTypeSetIterator Class
Autodesk.Revit.DB.Mechanical Namespace