Revit 2015 API
BoundaryConditions Properties
The BoundaryConditions type exposes the following members.
Properties
Name | Description
AssociatedLoad
Retrieve the AssociatedLoad.
Curve
Returns the geometric curve within a geometric loop that defines the area.
HostElement
Retrieve the HostElementId.
NumCurves
Returns the number of curves represent the Boundary Conditions Element.
Point
 If successful, returns the point represents Boundary Conditions.
See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace