Revit 2015 API
GridTypeSetIterator Properties
The GridTypeSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
GridTypeSetIterator Class
Autodesk.Revit.DB Namespace