Revit 2015 API
BoundarySegmentArray Properties
The BoundarySegmentArray type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a boundary segment at a specified index within the array.
Size
Returns the number of boundary segments that are in the array.
See Also
BoundarySegmentArray Class
Autodesk.Revit.DB.Architecture Namespace