Revit 2015 API
LineLoadTypeSetIterator Methods
The LineLoadTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
LineLoadTypeSetIterator Class
Autodesk.Revit.DB.Structure Namespace