Revit 2015 API
DimensionTypeSetIterator Properties
The DimensionTypeSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
DimensionTypeSetIterator Class
Autodesk.Revit.DB Namespace