Revit 2015 API
PointLoad Properties
The PointLoad type exposes the following members.
Properties
Name | Description
Force
Returns the three dimensional force applied to the point load.
Moment
Returns the three dimensional moment application to the point load.
Point
Returns the three dimensional coordinates of point load.
See Also
PointLoad Class
Autodesk.Revit.DB.Structure Namespace