Revit 2015 API
BoundarySegmentArrayIterator Members
The BoundarySegmentArrayIterator type exposes the following members.
Constructors
Name | Description
BoundarySegmentArrayIterator
For Internal Use Only.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the array.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
BoundarySegmentArrayIterator Class
Autodesk.Revit.DB Namespace