Revit 2015 API
BooleanOperationsUtils Members
The BooleanOperationsUtils type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the BooleanOperationsUtils
ExecuteBooleanOperation
 Perform a boolean geometric operation between two solids, and return a new solid to represent the result.
ExecuteBooleanOperationModifyingOriginalSolid
 Perform a boolean geometric operation between two solids, and modify the original solid to represent the result.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
BooleanOperationsUtils Class
Autodesk.Revit.DB Namespace