Revit 2015 API
RebarCoverTypeSet Methods
The RebarCoverTypeSet type exposes the following members.
Methods
Name | Description
Clear
Removes every RebarCover type from the set, rendering it empty.
Contains
Tests for the existence of a RebarCover type within the set.
Erase
Removes a specified RebarCover type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified RebarCover type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
RebarCoverTypeSet Class
Autodesk.Revit.DB.Structure Namespace