Revit 2015 API
Grid Members
The Grid type exposes the following members.
Methods
Name | Description
ExtendToAllLevels
Adjust the grid to cut all levels.
GetExtents
Gets the extents of the grid in the model.
Properties
Name | Description
Curve
Retrieves an object that represents the geometry of the grid line.
GridType
Get and Set the type of the grid object.
IsCurved
Test to see if the grid line is curved or straight.
See Also
Grid Class
Autodesk.Revit.DB Namespace