Revit 2015 API
ComponentRepeater Methods
The ComponentRepeater type exposes the following members.
Methods
Name | Description
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Returns an enumerator that iterates through the curve loop.
IsTypeValidForRepeater
 Determines whether given family type can be used as the default type for the repeater.
RepeatElements
 Repeats a set of adaptive component hosted on one or more repeating references.
See Also
ComponentRepeater Class
Autodesk.Revit.DB Namespace