Revit 2015 API
EnergyAnalysisDetailModel Members
The EnergyAnalysisDetailModel type exposes the following members.
Methods
Name | Description
Create
 Creates a new energy analysis detailed model.
Destroy
 Delete the created analytical model and the analytical elements such as spaces, surfaces, and openings.
Dispose
Releases all resources used by the EnergyAnalysisDetailModel
GetAnalyticalOpenings
 The collection of analytical openings.
GetAnalyticalShadingSurfaces
 The collection of analytical shading surfaces.
GetAnalyticalSpaces
 The collection of analytical spaces.
GetAnalyticalSurfaces
 The collection of analytical surfaces.
TransformModel
 Transforms all surfaces in the model according to the document's active ground plane, shared coordinates and true north.
Properties
Name | Description
ExportMullions
 Indicates if to specify the setting for exporting mullions.
IncludeShadingSurfaces
 Indicates if to set and get the setting for if shading surfaces should be included.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SimplifyCurtainSystems
 Indicates if to specify the setting for simplified curtain systems.
Tier
 Level of computation for energy analysis model.
See Also
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace