Revit 2015 API
ExporterIFCRegistry Methods
The ExporterIFCRegistry type exposes the following members.
Methods
Name | Description
Dispose
See Also
ExporterIFCRegistry Class
Autodesk.Revit.DB.IFC Namespace