Revit 2015 API
LineLoadTypeSet Methods
The LineLoadTypeSet type exposes the following members.
Methods
Name | Description
Clear
Removes every lineload type from the set, rendering it empty.
Contains
Tests for the existence of a lineload type within the set.
Erase
Removes a specified lineload type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified lineload type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
See Also
LineLoadTypeSet Class
Autodesk.Revit.DB.Structure Namespace