Revit 2015 API
SolidArray Members
The SolidArray type exposes the following members.
Constructors
Name | Description
SolidArray
Initializes a new instance of the SolidArray class
Methods
Name | Description
Append
Add the solid to the end of the array.
Clear
Removes every solid from the array, rendering it empty.
ForwardIterator
Retrieve a forward moving iterator to the array.
GetEnumerator
Retrieve a forward moving iterator to the array.
Insert
Insert the specified solid into the array.
ReverseIterator
Retrieve a backward moving iterator to the array.
Properties
Name | Description
IsEmpty
Test to see if the array is empty.
Item
Gets or sets a solid at a specified index within the array.
Size
Returns the number of solids that are in the array.
See Also
SolidArray Class
Autodesk.Revit.DB Namespace