Revit 2015 API
RebarShapeSetIterator Methods
The RebarShapeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
RebarShapeSetIterator Class
Autodesk.Revit.DB.Structure Namespace