Revit 2015 API
GenericFormSetIterator Properties
The GenericFormSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
GenericFormSetIterator Class
Autodesk.Revit.DB Namespace