Revit 2015 API
RebarBarTypeSet Properties
The RebarBarTypeSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of RebarBar types that are in the set.
See Also
RebarBarTypeSet Class
Autodesk.Revit.DB.Structure Namespace