Revit 2015 API
PathReinforcement Methods
The PathReinforcement type exposes the following members.
Methods
Name | Description
Create(Document, Element, IList<Curve>, Boolean) |  Obsolete.
 Creates a new PathReinforcement object from an array of curves.
Create(Document, Element, IList<Curve>, Boolean, ElementId, ElementId, ElementId, ElementId)
 Creates a new PathReinforcement object from an array of curves. This method replaces the NewPathReinforcement method, which has been deprecated.
GetCurveElementIds
 Retrieves the set of ElementIds of curves forming the boundary of the Path Reinforcement.
GetHostId
 The element that contains the Path Reinforcement.
GetRebarInSystemIds
 Returns the ids of the RebarInSystem elements owned by the PathReinforcement element.
IsSolidInView
 Checks if this Path Reinforcement is shown solidly in a 3D view.
IsUnobscuredInView
 Checks if Path Reinforcement is shown unobscured in a view.
RemovePathReinforcementSystem
 Deletes the specified PathReinforcement, and converts its RebarInSystem elements to equivalent Rebar elements.
SetSolidInView
 Sets this Path Reinforcement to be shown solidly in a 3D view.
SetUnobscuredInView
 Sets Path Reinforcement to be shown unobscured in a view.
See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace