Revit 2015 API
LevelTypeSetIterator Methods
The LevelTypeSetIterator type exposes the following members.
Methods
Name | Description
MoveNext
Move the iterator one item forward.
Reset
Bring the iterator back to the start of the set.
See Also
LevelTypeSetIterator Class
Autodesk.Revit.DB Namespace