Revit 2015 API
AnnotationSymbol Members
The AnnotationSymbol type exposes the following members.
Methods
Name | Description
addLeader
add a leader to this annotation symbol.
duplicate
Duplicate this annotation symbol.
removeLeader
remove a leader of this annotation symbol.
Properties
Name | Description
AnnotationSymbolType
 The AnnotationSymbol style of this AnnotationSymbol.
Leaders
Get all the leaders of this annotation symbol.
See Also
AnnotationSymbol Class
Autodesk.Revit.DB Namespace