Revit 2015 API
FamilySymbolSet Properties
The FamilySymbolSet type exposes the following members.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of family symbols that are in the set.
See Also
FamilySymbolSet Class
Autodesk.Revit.DB Namespace