Revit 2015 API
ReinforcementSettings Methods
The ReinforcementSettings type exposes the following members.
Methods
Name | Description
DocumentContainsNoAreaOrPathReinforcement
 Checks whether the document is free of AreaReinforcement and PathReinforcement elements. Only in this case is it permissible to change the HostStructuralRebar property. Only in this case it is allowed to change RebarShapeDefinesHooks property.
DocumentContainsNoRebar
 Checks whether the document is free of Rebar elements. Only in this case it is allowed to change RebarShapeDefinesHooks property.
GetFabricRoundingManager
 Returns an object for managing reinforcement rounding override settings used by FabricSheetType and FabricSheet elements.
GetRebarRoundingManager
 Returns an object for managing reinforcement rounding override settings used by RebarBarTypes, Rebar and RebarInSystem elements.
GetReinforcementSettings
 Obtains the ReinforcementSettings object for the specified project document.
IsEqual
 Checks if Reinforcement Settings is equal to other
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace