Revit 2015 API
RoofTypeSetIterator Properties
The RoofTypeSetIterator type exposes the following members.
Properties
Name | Description
Current
Retrieves the item that is the current focus of the iterator.
See Also
RoofTypeSetIterator Class
Autodesk.Revit.DB Namespace