Revit 2015 API
DirectShape Methods
The DirectShape type exposes the following members.
Methods
Name | Description
CreateElement
 Create a DirectShape object and add it to document.
CreateElementInstance
 Create a DirectShape object and add it to document. The shape stored in the element is either a reference or a copy of a definition shape that was created earlier. How the definitions are stored will determine whether an instance or a copy of the shape will be created. See DirectShapeLibrary for more details. This function is included for convenience. It essentially combines CreateGeometryInstance and CreateElement.
CreateGeometryInstance
 Create a copy of a definition shape that was created earlier. Use DirectShapeLibrary class to store definitions prior to using them here. How the definitions are stored will determine whether an instance or a copy of the shape will be created. See DirectShapeLibrary for more details. Use the output of this function as input to CreateElement to make the created shape persistent.
IsValidCategoryId
 Test the category id to make sure it is indeed a top-level built-in category
IsValidGeometry
 Validate geometry to be stored in a DirectShape. Suitable geometry validation is performed. Additionally, the geometry must make sense as a shape representation for the category assigned to this DirectShape object.
IsValidTypeId
 Test the type id to make sure it satisfies the following conditions - It is a valid element id - It corresponds to a valid DirectShapeType - The DirectShapeType has the same category assigned. Additionally, this functions tests that the current type id in this DirectShape is invalid. The type id is initialized to invalidElementId by the create functions. Once it is set, it may no longer be changed.
SetGUIDs
 Sets the GUID of the application that has created this DirectShape element and the GUID of the native data that was the source of this DirectShape.
SetName
 Sets the name for the DirectShape element.
SetShape(IList<GeometryObject>)
 sets the Shape of this object to the supplied collection of Geometry objects. The objects are copied.
SetShape(IList<GeometryObject>, DirectShapeTargetViewType)
 sets the view-specific Shape of this object to the supplied collection of Geometry objects. The objects are copied.
SetTypeId
 Sets the DirectShapeType for the DirectShape element
See Also
DirectShape Class
Autodesk.Revit.DB Namespace