Revit 2015 API
ContFootingTypeSet Members
The ContFootingTypeSet type exposes the following members.
Constructors
Name | Description
ContFootingTypeSet
Initializes a new instance of the ContFootingTypeSet class
Methods
Name | Description
Clear
Removes every ContFooting type from the set, rendering it empty.
Contains
Tests for the existence of a ContFooting type within the set.
Erase
Removes a specified ContFooting type from the set.
ForwardIterator
Retrieve a forward moving iterator to the set.
GetEnumerator
Retrieve a forward moving iterator to the set.
Insert
Insert the specified ContFooting type into the set.
ReverseIterator
Retrieve a backward moving iterator to the set.
Properties
Name | Description
IsEmpty
Test to see if the set is empty.
Size
Returns the number of ContFooting types that are in the set.
See Also
ContFootingTypeSet Class
Autodesk.Revit.DB Namespace